[{"content":"This section contains other articles.\n","date":1656912375,"description":"","lastmod":"2022-07-04T05:26:15Z","objectID":"d74498136f6a1e04126e9c6f41bd3182","permalink":"https://cosmosgame.github.io/save-the-world/other/","publishdate":"2022-07-04T05:26:15Z","title":"Other Articles"},{"content":"This is an essay I wrote back in my 40\u0026amp;rsquo;s. It describes my path away from atheism, and into a deeper truth that doesn\u0026amp;rsquo;t discard any part of me. I discovered that Reason and Spirit are equally important parts of the bigger Truth.\n","date":1656926775,"description":"","lastmod":"2022-07-04T09:26:15Z","objectID":"8bcbf5d8c25a7b22a43b15bc1078379c","permalink":"https://cosmosgame.github.io/save-the-world/other/my-waking-up/","publishdate":"2022-07-04T09:26:15Z","title":"My Waking Up"},{"content":"\u0026amp;ldquo;I can\u0026amp;rsquo;t quite explain why, but I know what he is saying is not true\u0026amp;rdquo;. We were sitting in a grassy courtyard surrounded by the dark-grey University of Chicago walls. Grey, grey minds always peering down at you was how a friend described the walls, but it was sunny and we were sitting on a park bench looking at the surprisingly pretty, purple-grey pigeons hop around on the grass. We had just gotten out of class, and for some reason this brilliant young woman was taking me into her confidence. The class was a small freshman seminar based on the Great books. At the moment we were studying Immanuel Kant, a genius philosopher, who had written a book arguing very persuasively that morality could be explained entirely on the basis of rational, logical rules. He was saying, in other words, that any moral decision can be decided if you just think rationally enough about it. I had found myself persuaded, but this young woman was not, and that is what we were talking about.\nShe thought for a moment, searching for a way to explain herself. I sympathized with her - it was hard to argue against a genius. \u0026amp;ldquo;I know he\u0026amp;rsquo;s wrong because I tried to commit suicide, but I\u0026amp;rsquo;m still alive. I chose to stay alive because I realized that life is good.\u0026amp;rdquo; I looked at her not knowing what to say. This was not the typical University of Chicago conversation. This school, more than most, treasured the clear calmness of pure rationality. It was why a lot of us had chosen the school. What she was saying was emotional and non-rational, and yet it felt incredibly powerful and vibrant. It had the smell of truth. But I also recognized the truth in what Immanuel Kant was saying \u0026amp;ndash; along with all the other philosophers we were reading. How could such conflicting views both seem so right? Something was wrong here, but what? It was the start of my crisis of faith.\nIf I\u0026amp;rsquo;m in a lot of pain, should I commit suicide? \u0026amp;ndash; what a deeply moral question, and yet …","date":1656926775,"description":"","lastmod":"2022-07-04T09:26:15Z","objectID":"7c7920671ab98c63e1c95b45ed82822b","permalink":"https://cosmosgame.github.io/save-the-world/other/my-waking-up/crisis-of-faith/","publishdate":"2022-07-04T09:26:15Z","title":"Crisis of Faith"},{"content":"In my thirties I ended up in a lot of pain. I longed for a release from this pain, and on a subconscious level suicide might even have been starting to look attractive. At least it all would be over then. I tried talk therapy, but was deeply unimpressed with that method, although it seems to have worked for others. Then I stumbled onto some mildly radical personal growth seminars. I absolutely loved them. It turned out that I had some work to do - my mental machinery needed some fixing. The classes revealed to me how much I feared others. I had on a deep level just assumed everyone was out to hurt me. So I experimented with giving myself permission to connect to others on a deeper level and found pure joy! I also found out that many people\u0026amp;rsquo;s struggles were in fact mine as well. And then I started on the hard work of changing the beliefs and assumptions that were getting in the way. I gradually became aware of a voice that was constantly tearing me down and even punishing me. I battled to love myself instead of hate myself. One practice I used was to look in the mirror at my acne-scarred face and say from the heart, \u0026amp;ldquo;I love you\u0026amp;rdquo;. To this day, every time I have a painful, negative thought about myself I habitually remind myself, \u0026amp;ldquo;I have value\u0026amp;rdquo;, and touch my hand to my heart. This may not sound like much, but it has been of enormous help to me. An acquaintance that knew me both before and after I had done this work said that, \u0026amp;ldquo;You look a lot more comfortable in your skin now\u0026amp;rdquo; - that describes it nicely.\nThe work of mental healing was fascinating, and I delved even deeper into it. The more I explored the more I came to realize that the very heart of healing is centered on spirituality. Even worse, I started to recognize and cherish my spiritual self. Oops. As a devout atheist (of course I was!), this was deeply surprising and not a little troubling. Note that I am not talking about \u0026amp;ldquo;God\u0026amp;rdquo;, which is something I still …","date":1656926775,"description":"","lastmod":"2022-07-04T09:26:15Z","objectID":"854fb959a738242d65ec798c8b1fdede","permalink":"https://cosmosgame.github.io/save-the-world/other/my-waking-up/deeper/","publishdate":"2022-07-04T09:26:15Z","title":"Deeper"},{"content":"But I didn\u0026amp;rsquo;t know all this when I was sitting back there on that picnic bench at U. of C. It took a long personal journey before I learned to trust other sources of knowledge other than pure reason. To most people this is hardly a discovery - my wife laughs that I was ever in doubt about it. But, I wish someone would have explained this to me when I was younger. Up until this crisis of faith I had been a strict rationalist; Spock was my role model. In short, I was a nerd. I could literally spend all day wrapped up in abstract though, and I loved every second of it. This wasn’t, unfortunately, something I could share with most people. My high school was an inner-city, working class school. Intellectuals were not well tolerated, and I kept my love of ideas fairly well hidden. But I also lived in another world as well, the world of sports. Once, while I was on the football team, I got tired of waiting for the bus. It seemed like we were always waiting in the pseudo military that was football. One day, throwing caution to the wind, I pulled out a trashy sci-fi book (for some reason I thought it would help that the book was trashy) to read. Friends on the team came over to check in with me sincerely worried that there might be something wrong - they were really, touchingly concerned. The next day the coach accosted my father in the hallway (my father worked as the music supervisor for the district), and said in the bluff joking jock style \u0026amp;ldquo;Do you know what the hell your son was doing the other day?!? He was reading!!, That\u0026amp;rsquo;s what. What the hell has gotten into him!!?\u0026amp;rdquo;. He was half serious. My worst fears were confirmed.\nIt was remarkably like being gay and in the closet. I was too scared to openly declare myself an intellectual, so I kept it hidden. So of course, I took that as my central identity. I longed to be an openly flaming intellectual, and looked for my version of San Francisco. The University of Chicago seemed to fit the bill nicely. The …","date":1656926775,"description":"","lastmod":"2022-07-04T09:26:15Z","objectID":"14cc01126474f053645de8906472139f","permalink":"https://cosmosgame.github.io/save-the-world/other/my-waking-up/flaming-intellectual/","publishdate":"2022-07-04T09:26:15Z","title":"Flaming Intellectual"},{"content":"In class we studied how formal reasoning works. It turns out that any formal reasoning system starts out with basic assumptions (called axioms) and works up from there. No useful logical system can be built without these assumptions, but these assumptions have to be taken on faith - they are outside of the system. So many arguments are pointless because the participants are starting with radically different assumptions. Given how enormously important our assumptions are, it is shocking how unaware we typically are of them. When I talk about our mental machinery this is a major component.\nTraditionally, rationalists start with the assumption that only their rational mind can be trusted as a source of truth. Everything else is fallible. Descartes “Meditations” is a great example of this mindset. The legend is that the philosopher Descartes had a bad cold, and was cooped up in a rustic cabin. His thoughts started to turn a little weird and he came up with this little essay titled “Meditations”. Descartes points out in this essay that when you think carefully about it, you start to realize that there really is no way to know that anything is actually as it seems. You don’t even know what you are seeing is real because just like in the Matrix movie it might turn out that everything is getting fed to you by some malevolent power.\nThe problem, though, as Descartes himself points out is that given this mindset you start to doubt that anything up to and possibly including even yourself is real. Descartes concludes that the only thing he can know for sure is that he is thinking – hence the famous \u0026amp;ldquo;I think therefore I am\u0026amp;rdquo; quote. Note that this is a very different mindset from \u0026amp;ldquo;I have a body therefore I am\u0026amp;rdquo;. Doubting that anything at all in the world except your own mind is real is a pretty weird view on life, and I don\u0026amp;rsquo;t particularly recommend it. But many followers of pure reason find themselves sliding here. Without realizing it they get caught …","date":1656926775,"description":"","lastmod":"2022-07-04T09:26:15Z","objectID":"63d9868504d9e7a7701ff668da2701a4","permalink":"https://cosmosgame.github.io/save-the-world/other/my-waking-up/limits-of-reason/","publishdate":"2022-07-04T09:26:15Z","title":"Limits of Reason"},{"content":"Life is a rich and varied banquet. Rationalists that stay safe in only their rational minds are missing out on the full richness of being human. When I try to talk about this with my rationalist friends it is somewhat frustrating - I end up basically saying, yes, pizza is one of my favorite foods too, but there is so much else out there as well, why not do a little more exploring?\nSo what do I know now that I didn\u0026amp;rsquo;t back on that picnic bench at University of Chicago?\nI have learned how to bring up other parts of myself to deal with such a deep crisis as that young lady faced \u0026amp;ndash; this is one case where my rational mind would take a back seat. Simply being alive, even in pain is a good thing that needs celebrating. But almost certainly the core of her problem was self-hate and serious depression. I now know a lot about self-hate, and suicide is the ultimate expression of self-hate. The path back from suicide is learning to love oneself, and that almost inevitably touches upon what I call spirituality. I also know about crushing depression, and the solution is to recognize that it is a whole body problem, and needs a whole body treatment that includes exercise, diet, mood enhancers (like St. John\u0026amp;rsquo;s Wort or even possibly prescription drugs), a change in thinking, and of course spiritual work. It wasn\u0026amp;rsquo;t so much a case that Kant, the genius rationalist philosopher, was wrong, but simply that what he had to say wasn\u0026amp;rsquo;t terribly useful in this case.\nThe reason I felt so conflicted during our conversation was that I had been following a jealous God. Strict rationalists, along with many Christians, believe that they are following the one True faith, and everyone else is just a deluded infidel. But what I didn\u0026amp;rsquo;t know at the time is that it is possible to make deep use of reason without being such a narrow, intolerant fundamentalist. It turns out that there are many paths to Truth, and rationality is just one of them. I\u0026amp;rsquo;ve learned to …","date":1656926775,"description":"","lastmod":"2022-07-04T09:26:15Z","objectID":"30389bea9fcdf63b6214938b33380c04","permalink":"https://cosmosgame.github.io/save-the-world/other/my-waking-up/now/","publishdate":"2022-07-04T09:26:15Z","title":"Limits of Reason"},{"content":"Before I talked about Descartes\u0026#39; (and my) assumption that the rational mind is the center and everything else, including our bodies, revolves around it. I now believe just the opposite - it is our bodies that are the center and everything else, including our rational minds, revolves around the body. The proof for this statement is not in thinking about it rationally, but to instead introspect and remember the states that you have been to, and to at least be open to the possibility of finding other states. But what are these other states that I keep on talking about? Ultimately this is something that you will have to discover in yourself. Here are some of the states that I have directly experienced:\nRunner\u0026amp;rsquo;s High\nI love to run. Our bodies love and need to work. When I run, I quickly slip into a semi-trance and my body just takes over. I typically have wonderful conversations with myself as I run - it is when I\u0026amp;rsquo;m at my strongest. I make my most courageous decisions while I\u0026amp;rsquo;m running - I feel powerful and capable. When I need to make a big decision, I like to go running on it. People who don\u0026amp;rsquo;t believe that this state exists, or doubt that they can achieve it themselves are, by their very disbelief, keeping themselves from achieving this state. Isn\u0026amp;rsquo;t that strange?.\nBerserker rage\nI discovered this state in high school football. I found that if I prepared myself mentally all of the day before a game I could go into a very, very powerful rage/trance during the game. This crazy rage made me a kind of star during my sophomore season. It turns out that we have a war-like, berserker state where we can do incredibly physical feats. The Vikings knew about these states - it is where we get the word \u0026amp;ldquo;berserk\u0026amp;rdquo;. The rage/trance let me perform way beyond my normal athletic limits. On the down side I also smashed through people without being conscious of what harm I was doing to them. From a rational point of view I can\u0026amp;rsquo;t say much to …","date":1656926775,"description":"","lastmod":"2022-07-04T09:26:15Z","objectID":"d7454d1792aabd410d5ac8fd0ab0092f","permalink":"https://cosmosgame.github.io/save-the-world/other/my-waking-up/other-states/","publishdate":"2022-07-04T09:26:15Z","title":"Other States"},{"content":"Gödel Escher Bach By Douglas R. Hofstadter\nIf you feel like exploring your rational mind, this is definitely the book for you. This is the best book I\u0026amp;rsquo;ve seen for explaining the rational method. Amongst his other themes Hofstadter does a great job of explaining Goedel\u0026amp;rsquo;s theorem.   The Multi Orgasmic Couple By Mantak Chia and Maneen Chia, Douglas Abrams and Rachel Abrams.\nIn very down to earth practical terms shows how both men and women can focus their minds and bodies to achieve multiple orgasms. Then goes on to show how partners can share that energy. If you have your doubts about sex being a spiritual exercise, try this book.   All I Really Need to Know I Learned in Kindergarten By Robert Fulghum\nActually I would recommend any of Fulghum\u0026amp;rsquo;s books. He does a great job of talking in a very practical way about spiritual matters without resorting to the \u0026amp;ldquo;God\u0026amp;rdquo; word or invoking religion.   ","date":1656926775,"description":"","lastmod":"2022-07-04T09:26:15Z","objectID":"f0b8b017b1aab206acf220f10fcb29ce","permalink":"https://cosmosgame.github.io/save-the-world/other/my-waking-up/resources/","publishdate":"2022-07-04T09:26:15Z","title":"Resources"},{"content":"How do I know what is true and what is false? This is a surprisingly deep question, and surprisingly few people ever think much about it. Or then again, perhaps it isn\u0026amp;rsquo;t surprising. Whether we are aware of it or not we all have mental machinery humming along that helps us make the countless choices we need to make. Most of us instinctually recognize that messing with this machinery might cause a person\u0026amp;rsquo;s life to break down. Indeed, I have seen it happen \u0026amp;ndash; people can literally think themselves into craziness. But on the other hand not understanding how we make decisions leaves us helpless to our own machinery. Your unconscious machinery might have problems, and sometimes, like in the case of the young woman choosing to live or die this makes a great deal of difference. If we want to lead a deep, rich fulfilling life it is necessary to make sure that our underlying assumptions (our mechanism) is sound. And one of the key assumptions that we need to examine is how we sort data into knowledge - how do we decide if we believe something is true or not?\nThink about what is going on when you argue with someone. Presumably, we argue with people to get them to see our point of view, and hopefully convert them. Amazingly, it occasionally works, but why? How are they persuaded to change their mind? It turns out we all have an innate sense of logic. This is the basis for our reasoning. You can make a logical argument to me, and if I happen to be in a rational mood I might recognize the truth of your words.\nYou find this truth by turning inward and thinking about it. Some rational part of us just recognizes truth. This is a very powerful faculty – it is how we conquered the planet. Possibly the purest expression of pure reason is mathematics. That discipline is based on proofs. For convenience most of us in school just skipped over the proofs and went straight to using the results, but, in principle, learning Mathematics is a process of self-discovery. …","date":1656926775,"description":"","lastmod":"2022-07-04T09:26:15Z","objectID":"ad32ea9e4573cc744806e0f1ac09daa6","permalink":"https://cosmosgame.github.io/save-the-world/other/my-waking-up/truth/","publishdate":"2022-07-04T09:26:15Z","title":"Truth"},{"content":" “We cannot solve our problems with the same thinking we used when we created them.”\nAlbert Einstein.\n Welcome! Thank you so much for visiting this web site! Your support and feedback is precious to me \u0026amp;ndash; it will help me create something of value. I won\u0026amp;rsquo;t get there without you. Seriously.\nI want a plan to save the world. A plan that might actually work. It is my deepest desire. When I tell people this they tend to recoil back \u0026amp;ndash; whoah! way too big! Is this your reaction too? But doesn\u0026amp;rsquo;t the world need saving? Yes, of course it does. Why not spend some time thinking about this? Why isn\u0026amp;rsquo;t this conversation more common?\nMy teenage daughter is learning about how bad the situation is. Our children understand the reality much better than we do. She asked me if it is OK to have children. She was talking specifically about climate change, but she was asking how safe it will be for her children. Ouch. Truly ouch. I had to really think about it. Getting to the truth is really important here, but it is so hard. Maybe her children will be OK? But then she asked what about her children\u0026amp;rsquo;s children? And what about all future children? What kind of world are we passing on to them?\nThis is the future my daughter has to face and for thirty years I have done nothing. Back in the 90\u0026amp;rsquo;s environmentalists knew a disaster was coming. The science was clear. And I did nothing. Each decade the scientists kept on coming back to report that it was even worse than we feared. And I did nothing. The reports got so bad I could not make myself read them. It hurt too much. If you read them carefully, you could hear the scientists screaming in anguish. And I still did nothing.\nNo longer.\nI will not do nothing for another thirty years. The world needs someone even as ordinary as me. No matter how hard it gets I can not imagine anything more painful than confessing to my grandchildren thirty years from now that yet again I stood by and did nothing. With all my …","date":1608218775,"description":"","lastmod":"2020-12-17T15:26:15Z","objectID":"3976528693a0108357f4928017600865","permalink":"https://cosmosgame.github.io/save-the-world/","publishdate":"2020-12-17T15:26:15Z","title":"Welcome!"},{"content":" Welcome  Welcome and thanks Saving the world  We know we have a problem, well documented We are on a deadline  Cascade. Syria   Jaiya\u0026amp;rsquo;s question   There is hope  Acknowledge hopelessness theory advances psychological advances medicine advances spiritual advances     The Dream  what do I really want? we already know let the children guide us Generational trauma  protect the children stop the cycle (or at least dampen it)   Same goal  Widen circle of compassion  What is blocking this?  world view wounds and trauma spiritual poverty         Who Am I?  Purpose? Software engineer, personal growth, spiritual awakening  mind,body, and heart [TODO] environmentalist many paths all of me, all of you, all of us lead by example learnings (briefly mention, link to other page) comfortable bringing together theories simplify focus on practical, measurable results [TODO] humble is hopeful Open source leading the way     Open Source  Surprising success Harness all of us  place where we   Feedback  comments bugs PR\u0026amp;rsquo;s   Community Promises  Simplicity  Value your time simplify   Practical, solution based  No more theory than strictly needed do the reading for you   Kaizen  Japan no ego feedback   Based in the heart, but no magic     The Plan for the Plan  Growing Up Cleaning Up  Healing up Wising Up   Waking Up Showing Up Growing Up  Spiral dynamics New groups, new ways of organizing   Cleaning Up  Getting back to out authentic selves Healing Up  Healing our collective traumas  groups and individuals     Wising Up  Personal growth mindset     Waking Up  reclaiming spirituality  ok if you don\u0026amp;rsquo;t yet feel comfortable with that   Not saints \u0026amp;ndash; a practice [TODO] word Integral joy!   Showing Up  Recognize the pain Step fully into the pain Awaken to something bigger   [TODO] Deadline  Global warming In denial of Can be a benefit Love for planet and future generations   Definition of success  Child focused Integral  Expand circle of compassion All of me, all of you, all …","date":1605724591,"description":"","lastmod":"2020-11-18T11:36:31-07:00","objectID":"b7d38220e85982123c5ca841015e3f6b","permalink":"https://cosmosgame.github.io/save-the-world/articles/","publishdate":"2020-11-18T11:36:31-07:00","title":"Index"},{"content":"If you haven\u0026amp;rsquo;t watched the stink spirit video from Spirited Away yet please consider watching it now. It is such a good metaphor for this work.\nWe all have a lifetime of accumulated junk that is keeping us from our true shining nature. Notice how much courage and fortitude is needed just to get started. It feels kind of hopeless. I\u0026amp;rsquo;m not worth the effort! But the pain keeps driving us forward. I love how the whole community rallied to help with cleaning up the stink spirit. I\u0026amp;rsquo;ve had a community stand up for me too. I could not get there all on my own. We can\u0026amp;rsquo;t get there all on our own.\nBack at a time when I was in an incredible amount of pain, I signed up for an intensive set of personal growth workshops. The first weekend was designed to open us up to the work and the second, longer retreat was where we did the real work. That retreat was called \u0026amp;ldquo;The Wall\u0026amp;rdquo; and it was named after the \u0026amp;ldquo;wall\u0026amp;rdquo; of exhaustion that runners hit and then keep on going. It was described as a chasm mountain climbers might find on their path. Giving them no real choice other than to leap over the chasm. And in that moment when they are in the air new possibilities open up.\nWe met at Sea-Tac airport to take a bus to a remote camp somewhere in Washington state. We didn\u0026amp;rsquo;t really know where we were going exactly. Just somewhere deep into the woods. We slept in bunkbeds and were woken up at 6am to the shrill whistle of our facilitator dressed as a coach and set out on our daily run. Which was timed. And the times were posted. Fairly early in the retreat the facilitator asked us to commit to our life purpose. If we didn\u0026amp;rsquo;t already know our life purpose he suggested we take on the purpose of living a deep, rich, fulfilling life. He asked us to take a solitary walk out into nature to really think about this. When we came back the facilitator said, \u0026amp;ldquo;Everyone who is willing to commit to their life purpose please stand.\u0026amp;rdquo; Everyone …","date":1643693175,"description":"","lastmod":"2022-02-01T05:26:15Z","objectID":"156eb169f6e2c3f36cd9fe96e60907cd","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/","publishdate":"2022-02-01T05:26:15Z","title":"Cleaning Up"},{"content":" Non violence Mindfulness Mind/Body Truth Change Organicity Unity Loving Presence  These principles are a foundation we can build on. They can be our North star to help guide us when we get lost. They work together. All of them are necessary. If a Hakomi session didn\u0026amp;rsquo;t go well, students are taught to look to the principles to see what was missing. This brings us back to systems thinking. Asking \u0026amp;ldquo;why?\u0026amp;rdquo; to go deeper and deeper so that we can embrace all parts of the system.\nHakomi started with five founding principles. Loving Presence was added here. Truth and Change were added here. This brings us to eight principles which seems like the right number to me.\nThese principles guide a therapist when working with a client. But they also can guide our lives. We can use them to guide us on how to do our ongoing Healing Up work. We also can use them as a foundation for the life practices of Wising Up. We can even use them for inspiration when finding our way to spirt and soul in our Waking Up work.\nTruth \u0026amp;ldquo;Get curious about that\u0026amp;rdquo;, is a standard Hakomi invitation. Hakomi helps clients find their way to their core truth; their core story. This truth is usually too hard or scary to get to all on our own so we need help. And that is the place where healing can happen. We have to get to the deeper truth of things before we can make a change. We have to know our story before we can change it. Trying to play it safe and stay at the surface does not really work.\nWe should always be on a quest for the deeper truth. Sometimes we need help getting there, sometimes we can get there on our own, but there is always a deeper truth remaining to be found.\nNon violence \u0026amp;ldquo;I welcome that strong protector \u0026amp;ndash; it has kept you safe\u0026amp;rdquo;. Hakomi doesn\u0026amp;rsquo;t shame people for their defenses instead it celebrates what good work that defense has done for them.\nAs I mentioned earlier, getting to our core truth is delicate sensitive work and the slightest hint …","date":1651901175,"description":"","lastmod":"2022-05-07T05:26:15Z","objectID":"f55b3203f58791e7c7141bcd5b538e19","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/hakomi/","publishdate":"2022-05-07T05:26:15Z","title":"Hakomi Principles"},{"content":"I have a practical problem here. I want to chart a path to Turquoise, but as far as I can tell that has never been done. This is something new. I do know the healing/wisdom paths that I found. They worked for me. And I saw them work for others. So let\u0026amp;rsquo;s start there.\nIn the sections to come I am going to tell my healing and growth stories. Here I introduce the schools where I did much of this work. Each of these schools has an experiential (Beige) side that has people heal and grow simply by experiencing what the school has to offer. But each school also has a group (Purple) side where you join the community and offer service to the world.\nHakomi Hakomi is a beautiful form of body centered, talk therapy. The question asked over and over again in different ways is \u0026amp;ldquo;Where are you feeling this in your body?\u0026amp;rdquo;. And then you are invited to deepen into that. It is the only form of talk therapy that has ever worked for me. A typical Hakomi sessions takes the client way, way deep into themselves. They enter a liminal state of here and now. Here in their body, deep into all their hidden parts. To get there the client has to know how safe and welcomed all parts of them are. How even those pesky defenses they have are welcomed and celebrated. And it is at these deeper layers that we find where we formed our core beliefs, our core stories, and now we have the choice to choose a new story.\nAfter you have done some healing work, some people feel called to service. To learn how to provide this amazing healing service to others. The Hakomi Institute offers many classes and they are open to everyone. They range from one day workshops to a two year program. I did the two year program. Each year we had ten three day weekends. Those weekends felt like a personal growth weekend to me. They taught us the Hakomi principles, and kept on coming back to them throughout. These principles are a sound foundation to build a life on. And it turns out that they are shared by the …","date":1655803575,"description":"","lastmod":"2022-06-21T09:26:15Z","objectID":"71f3edbf3c3923405da2dec3c1e50072","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/healing-paths/","publishdate":"2022-06-21T09:26:15Z","title":"Healing Paths"},{"content":"Let\u0026amp;rsquo;s start with Aaron Stark\u0026amp;rsquo;s story.\n  Do you see why it has to start here? There are so many, many children that could tell similar stories. This has to stop! These kids need our love and support. But instead just like in Aaron\u0026amp;rsquo;s story the social worker buys into his mom\u0026amp;rsquo;s well practiced lies and steps back and does nothing. Making the situation even worse than it was before. It is almost as if children are their parent\u0026amp;rsquo;s property to do with as they see fit. That is so obviously wrong, and yet I think it is our reality. We, just like that social worker, want to believe the comforting lie that a child is always better off with their mother. But unfortunately quite often that mother was also raised by deeply traumatized parents and so she too is acting out of pain. Not truly wanting to but nevertheless deeply wounding her child. One generation passing its trauma on to the next generation over and over. We need to stop this cycle.\nChildren need advocates outside there families. Every child should have at least one functioning, heart-based adult who advocates for them. At least one, more would be even better. Childcare workers traditionally have been some of the least respected in our society. Notice how little they get paid (if they get paid at all). We have that exactly backwards. The revolutionary vanguard must include preschool and kindergarden teachers. Any council of power has to have them seated at the table.\nThere are, of course, many groups doing great work. They just need a lot more attention and backing. For example, Thread in Baltimore is doing amazing work but most people have never heard of them. Do not know the amazing changes they are bringing into kid\u0026amp;rsquo;s lives. The basic idea is that five volunteers are brought together with a 9th grade student who is struggling. The group commits to the process for ten years. The student has to agree to all of this. Then it is up to those five volunteers to support that student in …","date":1646112375,"description":"","lastmod":"2022-03-01T05:26:15Z","objectID":"0ed9e1159f8562353eae83b58746219a","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/healing-up/","title":"Healing Up"},{"content":"","date":-62135596800,"description":"","objectID":"3d83c1f152ac63cb37ae2d42c51a7b54","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/healing-up/change/","title":"Change"},{"content":" “People will only protect what they love.” Jacques Coustea\n Love is the base. Everything has to be built on top of this. In Hakomi we were taught to build a loving \u0026amp;ldquo;bubble\u0026amp;rdquo; between ourselves and our client. In HAI it comes from the deep love from the facilitators and the team. They are all there because they are deeply committed to love and together they create the same \u0026amp;ldquo;bubble\u0026amp;rdquo; but for an entire room. The very first thing the facilitators do is to model loving, tender connection with each other. So people can experience what it looks like.\nWe explicitly encourage people to be loving both towards themselves and towards others. We model loving people no matter what comes up for them. No one is made wrong. Facilitators (and hopefully team) model always speaking from their heart. Simply declaring from the heart that this is the Room of Love opens it up as a possibility.\n","date":-62135596800,"description":"","objectID":"c42cd6742704ee7c69c0be1501d4b86e","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/healing-up/love/","title":"Loving Presence"},{"content":"We have this weird illusion that somehow our body is separate from our mind. As if they are separate things. What a strange story we tell ourselves. It is so not true. What happens in our body affects our Mind. What happens in our Mind affects our body. It is all one. When we suffer a traumatic event we store that trauma somewhere in our body. In his book The body keeps the score, the psychiatrist Bessel van der Kolk talks about how when he first started out as a therapist working with traumatized people, his profession didn\u0026amp;rsquo;t have much to offer. They didn\u0026amp;rsquo;t even really recognize that PTSD was a real thing. That has changed. In the second half of his book he talks about the many, many different, promising therapy options for traumatized people we have now. This is huge. Maybe for the first time since the start of Red empire we have the chance to finally stop the cycle of one generation passing it\u0026amp;rsquo;s trauma on to the next. And as different as these therapy options are they do share one thing \u0026amp;ndash; they help people connect their bodies back into the world.\nI worked with a very, very traumatized young woman struggling to recover from extreme childhood PTSD. When she told me her history I would weep with horror \u0026amp;ndash; it was just too much. How could anyone possibly recover from that!? And she suspected that her crippling illnesses were all that trauma still living on inside her body. We used MDMA as sacred medicine and she had an amazingly rich journey. She discovered a nurturing, holy connection with her body and her face glowed with joy. Up until then her body had only been a source of pain, something she had to learn to manage and hold off. For as long as she could remember her body never had enough heat and was always cold. Now she had plenty. For over a year after that journey we simply did Hakomi to help her find her way back to her body. Simply remembering her sacred journey was all that it usually took. This discovery changed her life. She …","date":-62135596800,"description":"","objectID":"a9a15e40056c3cc6a166b106860fbe0b","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/healing-up/mind-body/","title":"Mind/Body"},{"content":"There is a lot of truly great writing about mindfulness. For example, Mark Manson has an excellent article here. He writes in his vivid way of all the amazing benefits both health-wise and mental. But in that article he lightly touches upon something that is often overlooked. We tend to think of meditation as the only way to cultivate mindfulness. It is not. Meditation is not the answer to all our problems. In fact, too much meditation can lead to spiritual emergencies that can crush someone or even lead them to suicide. Don\u0026amp;rsquo;t get me wrong \u0026amp;ndash; I love meditation. I meditate daily in front of my beloved altar and it has helped me a lot. It is just that I have seen too many people take up meditation as The One True Way, when it is just one of the ways, and not even a complete way at that.\nHakomi\u0026amp;rsquo;s way is to simply bring more awareness to what is going on. Clients are constantly coached to pay attention to the moment. To really notice what is going on with their bodies and to just get curious. To recognize that internal voice that is always talking and to realize it is just one voice telling a story that is no longer necessarily true. The therapist acts as a support to help them lean into the things that are hurting. The therapist first checks to see if it is OK to proceed (non-violence principle) and then maybe asks them to breathe into the pain. Asks the client in different ways to get curious about whatever is happening in the moment (truth principle). And just like yoga starts off awkward and stumbling but eventually becomes much more smooth, if you do this kind of inquiry enough you start to develop the habit of mindfulness. You start to notice what is happening even without the therapist directing you.\nBuddhists refer to this process as RAIN. I particularly like Tara Brach\u0026amp;rsquo;s version of it. If you have not read any of her books please do \u0026amp;ndash; she is one of our most important leaders. Tara teaches RAIN as \u0026amp;ndash; Recognize, Accept, …","date":-62135596800,"description":"","objectID":"10659121270fc6c229b28cb7d6878794","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/healing-up/mindfulness/","title":"Mindfulness"},{"content":"As I write this bombs are falling on Ukranian homes. Families are huddled in subways just trying to survive, and millions upon millions of people have fled the country. We cheer as we watch the Ukranians bravely fight back against what seem hopeless odds. Sometimes there is no choice but to meet violence with violence. In World War II most of the world had collapsed into authoritarian Red. The only thing that saved us was armed conflict; nothing else would do against Hitler and Tojo. Unbelievable numbers of people died in the resistance but it was sadly necessary. What we forget is that most of the people we were fighting, the Germans, the Japanese, believed that they too were doing the hard but necessary thing. They also were dying for something they believed in. When it gets this bad we have no choice but to fight. But our goal is to create a world where it doesn\u0026amp;rsquo;t get that bad. How do we do that? Again, we need systems thinking. We need to go deep enough to really get to the root of the problem. And as always that leads us right back to ourselves.\nThis war mentality is not just something that lives out there disconnected from everything else. We also have wars in our own minds. Of course we do! This is where war springs from \u0026amp;ndash; where else would it come from? And just like those determined Germans thinking they were doing the hard but necessary work of fixing the world, we sometimes declare war on ourselves thinking it is the only way. I know because I did myself. I declared war on myself in high school, and I am still recovering from it. In my Junior year I started to develop huge cystic acne cysts. They would swell so big that they stretched the skin of my face and made it painful to smile. They grew almost to the size of ping pong balls \u0026amp;ndash; I am not exaggerating. I went from one of the cuter boys to one of the ugliest just like that. And in my bewildered pain I made a choice to protect myself. My ugliness made me vulnerable so I decided to do a …","date":1646112375,"description":"","lastmod":"2022-03-01T05:26:15Z","objectID":"09de30968c8db64e36056f8746681fad","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/healing-up/non-violence/","publishdate":"2022-03-01T05:26:15Z","title":"Nonviolence"},{"content":" I don’t think people are seeking the meaning of life as much as they are seeking the experience of being alive.” Joseph Campbell\n \u0026amp;ldquo;Organicity\u0026amp;rdquo; is an unfamiliar, awkward word, and I have to confess I initially resisted it. But that resistance was mostly because it is awkward to learn something truly new. Ignore what the dictionary might say, in this sense the word combines \u0026amp;ldquo;organism\u0026amp;rdquo; with \u0026amp;ldquo;icity\u0026amp;rdquo; to mean the nature of an organism. It focuses us on the living, natural organisms that we all are. We tend to skip right past that, but this principle brings us back over and over to the miracle of life. Brings us back to noticing what our living body is feeling and longing for. Living things are always healing. Always. Isn\u0026amp;rsquo;t that amazing? A doctor might set a broken bone, but then it is up to the body to do the healing. A Hakomi therapist might help a client discover that a story they are telling themselves no longer serves, but then it is (mostly) up to the client to find the new story that does serve.\nWhen a 17 year old girl who I was very close to died I was devasted. A wise grief counselor told me that we are never the same after our losses, but to know that we are always on a path towards healing. Always. I found that incredibly comforting and true. There might be something blocking it, but health is where things naturally want to go. Hakomi teaches us to step back and let that healing happen. We create a loving, safe learning environment and then have faith that people will find their own way. For the therapist this is quite humbling. We are not the healers. We are merely facilitating a healing environment. We have to surrender control \u0026amp;ndash; it is a leap of faith. We trust that people know their own way to healing, and we are just helping them find it. I struggled with this. It was surprisingly hard to simply ask my client \u0026amp;ldquo;What wants to happen next?\u0026amp;rdquo;, and to trust that something may come to them or not and …","date":-62135596800,"description":"","objectID":"60cabf80f7f43e390543d11ded5429dd","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/healing-up/organicity/","title":"Organicity"},{"content":"We need to find our truth before we can heal. Hakomi gently guides clients deeper and deeper into a non ordinary state of consciousness that helps them get all the way down to their core beliefs. These are the (mostly) unconscious beliefs people have about how the world works. What is and is not safe. These beliefs are usually created by a child desperately trying to survive against unfair odds. So we honor the genius of that child for finding something that worked, but then help them see how that solution also has come with a price. A price that now maybe is not worth it. We then have them notice that they as adults have many more resources now and can now find other solutions. But first maybe they just need to spend some time soothing that hurt child within and reassuring that child they are safe now.\nHAI workshops revolve around group shares. People stand up in front of the group (usually stark naked) and are lovingly encouraged to share from the most vulnerable, authentic place they can find within themselves. Quite often people are inspired to stand up after having a breakthough during one of the exercises. Or maybe they are moved to share their most painful secret. There is something incredibly beautiful about sharing your deepest, naked Truth in front of a circle of sacred witnesses. A circle that holds all of you in love. This group support helped me to get to my deeper places. Helped me get clearer about what was really going on for me. When I stood up sometimes it was like something was speaking through me. Afterwards I would sit down and run through what I just said because it was what I most needed to hear.\nGetting to the truth of the matter can be hard and scary. We tend to resist. And there are good reasons we conspire within ourselves to not know the full truth. This work if done incorrectly is not safe. Unless we can be compassionate and non-violent with all that we discover it actually might be a good idea to not let ourselves consciously know. But …","date":-62135596800,"description":"","objectID":"4b5409a80b80ccfb6bc6a007dbcd8430","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/healing-up/truth/","title":"Truth"},{"content":"There is a certain connection magic that always comes up for a group that goes through something intense together. People connect and become one. It is part of being human. We are a deeply social animal and we are meant to form groups both large and small. We even have mirror neurons dedicated to this task. If someone is grieving I grieve too. If someone is in pain I hurt also. When someone does some work for themselves they are doing work for me as well. This is one reason why HAI creates so much space for sharing, because we can learn so much from each other. The other reason is that when we are in a safe, deeply connected group like this, people become our sacred witness. When I state that I am committed to loving the hurt little boy inside myself to the group, that becomes a sacred vow. There is something incredibly healing to be witnessed in this way.\n","date":-62135596800,"description":"","objectID":"08808efaf61c786541f9ab2f090569bf","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/healing-up/unity/","title":"Unity"},{"content":" Wising Up  Personal growth mindset Mindful Self Compassion  second level of three What you don\u0026amp;rsquo;t love in others..  mirror work with others   Loving others as self (mirror work) Preparation for Truth   Hakomi Principles  Hakomi intro RAINING  recognize acceptance investigate nurture/needed experience integrate not-me greet/grow   Love  should be included preparation for Truth   Non violence  different schools of personal growth; \u0026amp;ldquo;pop-it\u0026amp;rdquo;   Truth  Coyote Accountability  Victim stories     Mindfulness Mind/Body Organicity Unity Change  Accept that change is possible Accept that change is inevitable Creativity     Accountability  Victim mindset Empowered victim   Intraverts vs. Extraverts  Not an either or Healing individual Healing with groups Our society needs much more empahsis on the group  cohousing        ","date":1659417975,"description":"","lastmod":"2022-08-02T05:26:15Z","objectID":"9b496f755aa757f26ac2ac0597f8667c","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/wising-up/","title":"Wising Up"},{"content":"As I write this bombs are still falling on Ukrainian homes. Millions of people have fled the country, and the people still there have to deal with senseless death falling from the sky. We cheer as we watch the Ukrainians bravely fight back against what at first seemed hopeless odds. Sometimes there is no choice but to meet violence with violence. In World War II most of the world had collapsed into authoritarian Red. The only thing that saved us was armed conflict; nothing else would do against Hitler and Tojo. Unbelievable numbers of people died in the resistance but it was sadly necessary. What we forget is that most of the people we were fighting, the Germans, the Japanese, believed that they too were doing the hard but necessary thing. They also were dying for something they believed in. When it gets this bad we have no choice but to fight. But our goal is to create a world where it doesn\u0026amp;rsquo;t get that bad. How do we do that? Again, we need systems thinking. We need to go deep enough to really get to the root of the problem. And as always that leads us right back to ourselves.\nThis war mentality is not just something that lives out there disconnected from everything else. We also have wars in our own minds. Of course we do! This is where war springs from \u0026amp;ndash; where else would it come from? And just like those determined Germans thinking they were doing the hard but necessary work of fixing the world, we sometimes declare war on ourselves thinking it is the only way. I know because I did myself. I declared war on myself in high school, and I am still recovering from it. In my Junior year I started to develop huge cystic acne cysts. They would swell so big that they stretched the skin of my face and made it painful to smile. They grew almost to the size of ping pong balls \u0026amp;ndash; I am not exaggerating. I went from one of the cuter boys to one of the ugliest just like that. And in my bewildered pain I made a choice to protect myself. My ugliness made me …","date":1659417975,"description":"","lastmod":"2022-08-02T05:26:15Z","objectID":"c861c4f05d3aeaf5b741f8709f396e7e","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/wising-up/non-violence/","publishdate":"2022-08-02T05:26:15Z","title":"Nonviolence"},{"content":"In this section I am going to tell a story. A story of where we have been and where we are right now. A story that is unfinished but with strong hints of what wants to happen next.\nI know a bit about the power of finding the right story because I named myself based on one (The Odyssey). Finding the right story transforms and strengthens. Makes things clearer. Gives courage and a direction. We all need to find our own story. The reason why we came to earth. But we also need to find our shared story. What is it that we are meant to do together?\nSpiral Dynamics can provide this shared story. Although it was originally conceived as a scientific theory I think it is better seen as an explaining story. A story that helps us make sense of things.\nIn the first sub-section I am going to introduce the theory and then tell the story. In the next sub-sections I offer some thoughts on how to put it to practical use.\n","date":1654061175,"description":"","lastmod":"2022-06-01T05:26:15Z","objectID":"4b66445df18952052788b7e5b9a9ecec","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/","title":"Growing Up"},{"content":"Before I continue let me first address some questions or concerns I suspect people might have.\nSpiral Dynamics is not established science As far as I can tell Spiral Dynamics has not yet been subjected to serious, sustained scientific review. The theory is just now gaining attention, so I think getting that review is just a matter of time, but in the meantime we need to be very careful in the claims we make. That is why I am so careful to tie the major stages to well recognized historical periods. That seems like a solid foundation to build on. I have done a lot of historical research to make sure what I say is accurate and I will correct any errors people find. But more than a theory I think we need a story that explains how we got here. Spiral Dynamics does that well.\nThere are different interpretations If you listen to people talk about Spiral Dynamics you will hear important differences in interpretation. Again my approach is to focus on what history teaches us. I don\u0026amp;rsquo;t claim to be a historian, but I have an amateur\u0026amp;rsquo;s passion for the subject. That focus leads me to, for example, a different interpretation of Red and Blue than you might hear from others. It is clear to me that Red coincides with the advent of empire, and that Blue was a reaction to that ruthless empire. Others might not have even thought about whether the Roman empire was a Red or Blue stage, but I think the difference is crucial.\nIt is a better explanation of groups than individuals People are complicated and contain many layers at once. Perhaps at work someone is a dedicated scientist (Orange), but at home they find deep solace in their simple, unquestioning Catholicism (Blue). And maybe their passion is camping (Beige). How do you put that person into just one Spiral stage? I find it seems to work better to focus on group behaviors. Those seem to average out to one stage or another. So a science organization is Orange and the Catholic church is Blue.\nAnd countries contain a mix of …","date":1628918775,"description":"","lastmod":"2021-08-14T05:26:15Z","objectID":"59b272dc594ff5f05a1817b2a381fff2","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/practical-spiral-dynamics/","publishdate":"2021-08-14T05:26:15Z","title":"Practical Spiral Dynamics"},{"content":"Everyone has blind spots. Except me. I don\u0026amp;rsquo;t have any. This deeply amuses me because it is so obviously false, and yet there is a part of me that really believes it. After all I can\u0026amp;rsquo;t see my own blind spots so obviously I don\u0026amp;rsquo;t have any, right? In other words, I don\u0026amp;rsquo;t know what I don\u0026amp;rsquo;t know. But this is true for everyone. We all can not see our own blind spots by definition! Other people can know things, can be so more advanced than us on something that we don\u0026amp;rsquo;t recognize how much further ahead they are. So when we reach an impasse with someone, it is important to stop and hold open the possibility that maybe, just maybe this might be our blindspot not theirs. Maybe they can see something that we don\u0026amp;rsquo;t even know we don\u0026amp;rsquo;t know.\nThere are many different kinds of blindspots, but let\u0026amp;rsquo;s focus on where one stage sees something that another stage just misses.\nScience blindspot On January 28, 1986 millions of children sitting in their classrooms watched the launch of the Challenger shuttle. For the first time in history there was a school teacher onboard, Christa McAuliffe. The networks were televising a special classroom set up for her students watching the launch. 73 seconds after launch the shuttle blew up and her students watched her die on national TV. It was a horrible, painful death. It did not have to happen. NASA engineers the day before the launch literally begged for the launch to be cancelled. But the launch had already been postponed numerous times, and if it were postponed yet again it could not be included in Reagan\u0026amp;rsquo;s state of the union address. So the engineers were overruled. But they knew. One of the engineers, Bob Ebeling, told his wife the night before, \u0026amp;ldquo;It is going to blow up\u0026amp;rdquo;\nWhat happened here? Bob Ebeling was working at the Orange stage, but the NASA administration was operating at most likely Red or at best Blue. Either way the adminstrators clearly did not have a …","date":1635830775,"description":"","lastmod":"2021-11-02T05:26:15Z","objectID":"03a8d130df7e788d4b0ccbfc2d23203c","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/practical-spiral-dynamics/blindspots/","publishdate":"2021-11-02T05:26:15Z","title":"Blindspots"},{"content":"How do we know what color level someone or a group is at? To figure this out there are some questions we need to answer:\n Are they more individual focused (tick) or group focused (tock)? What do they know to be True? What are they willing to die for?  Let\u0026amp;rsquo;s go through the color levels again, but this time asking those questions.\nBeige (FirstAwakening) At Beige focus is on the individual family (tick). You know to be true what is right in front of you. You are willing to die for your family. There are a surprisingly large number of people buying missile silos to convert them into survival shelters. That is very Beige level thinking. By the way, I don\u0026amp;rsquo;t think they are necessarily wrong. If I had a lot of excess money, I would seriously consider doing something like that too. Family is where we start.\nThe whole point of backpacking is to get to this level. That is why people do it for extended periods of time. It takes a while to get back into this easy communion with nature. After you have gone a few days on the trail, the city mentality starts to finally fade away and we can finally just let ourselves be one with the world. It is a very beautiful mental place to get to. So if you find a backpacker on a long hike they are in that moment probably at Beige. The energy field of these people feels very clean and whole.\nThis is also the stage people collapse back to if they have a lot of unresolved trauma and/or pain. All they can manage is just to survive day to day. We all go here when we have a bad flu. Unfortunately some people spend most of their lives in so much pain that they spend much of their life at this stage. They can\u0026amp;rsquo;t rally to care too much about others because they are hurting so badly.\nPurple (KinSpirits) At purple focus swings over to tribe and community (tock). You know to be true what the tribe knows to be true. You revere the local spirits of the land. You are willing to die to protect your tribe. Many indigenous people live their …","date":-62135596800,"description":"","objectID":"1bb39e7a7bc0e1d35b2ca5ed1b4eafb1","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/practical-spiral-dynamics/field-guide/","title":"Field Guide"},{"content":"Each stage brings a crucial gift. But we can have blindspots here too. For example, Green hates Red and can see nothing useful in the Red mindset whatsoever. And similarily Red hates Green. To be sure, Green is not wrong. We are in fact living in a world of systemic racism and sexism. But what Green (and I have to admit I too) struggle with is to realize there actually is a gift that Red brings. And that gift is crucial. This is too big a project \u0026amp;ndash; we need all the gifts.\nBeige If you read other writer\u0026amp;rsquo;s descriptions of Beige you will find them dismissing this stage as impossibly primitive and best quickly skipped over. They are making a huge mistake. For most of us this is going to be the most important stage. Healing has to start here.\nImagine you have been hiking mostly alone in the wilderness for months. You are carrying a heavy pack and it hurts. You have lost most of your toenails. And yet day in and day out you keep on going. Why? Because you have a desperate need for healing. A healing that only nature can provide. And day by day you start to find yourself. This is where it has to start. Nature helps us find our feet. Cheryl Strayed tells an inspirational story of healing herself by hiking 1100 miles of the PCT in her book Wild: From Lost to Found on the Pacific Crest Trail. This clip is the final scene from the movie adaptation. I think people find her memoir so compelling because on some level they recognize the healing power of simply walking in nature.\nWild Ending Scene\nI am going to come back to this stage over and over. It is the base everything else is built on.\nGifts  Profound connection with nature Right diet (eating what works best for your particular body) Exercise Sexual vibrancy Touch Nurturing family Internal knowing  Purple We have forgotten what Purple knows. It is now just too weird and harsh for most of us. Whether it is the Australian aboriginal Dreaming or a Lakota Eagle Dance where dancers pierce their chests with a rawhide …","date":1637213175,"description":"","lastmod":"2021-11-18T05:26:15Z","objectID":"e5ba005af4a4c5f9545a9ecab886dd3c","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/practical-spiral-dynamics/gifts/","publishdate":"2021-11-18T05:26:15Z","title":"Gifts"},{"content":"Hopefully I have convinced you that Spiral Dynamics is a useful story. But how does it help us? How do we work more skillfully with all the stages? Let\u0026amp;rsquo;s take one more spin through all the stages to consider what needs to be done.\nBeige So many people are collapsed down to the survival level. They are leading quiet lives of desperation. Just barely able to make it each day. Sometimes this is because they are brutally poor. Sometimes because they are refugees of famine or war. And in the U.S an unbelievably high number of people are trauma victims. People are so traumatized that they can barely lead their lives. This is common! We have to stop this. We should spend at least as much money on defense of our children as we do on military defense. We are all wounded and this collective pain is holding us back. We must heal first. And we do that by finding our way back to our bodies and the land.\nPurple Very few people are at authentic Purple. We have done much too good a job of conquering the world to let them survive. So our goal here is to simply learn. Purple has a lot to teach us. In fact it already has. Native American (Purple) intellectuals had a huge affect on American society. Feeling skeptical about that? Please read this book: The Dawn of Everything. An anthropologist and archaeologist teamed up to do the careful, painstaking scholarship needed to completely upend the existing myths about early societies. It turns out that Purple societies lived in large egalitarian cities for thousands of years. They used clever, sustainable agriculture that did not require excessive amounts of labor. And they knew all about Red, and consciously chose systems of government to prevent the empire of Red from arising. They had learned from hard experience what was necessary to lead free and full lives. This is what the Native American intellectuals had to teach the settlers. But the settlers only took part of the message. We all have much more to learn.\nRed I think the main …","date":1637213175,"description":"","lastmod":"2021-11-18T05:26:15Z","objectID":"dbec519f1b1c1cbd6944203ef3e1de42","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/practical-spiral-dynamics/next/","publishdate":"2021-11-18T05:26:15Z","title":"Putting Spiral Dynamics to work"},{"content":"All of the stages come with both gifts and shadows. I will touch on the shadow side first. The part that is hurting and not working well. The part that is causing harm in the world.\nBeige The shadow version of this stage is what happens when we collapse down to survival mode. Only me and mine matter. Just like one of those Zombie apocalypse everyone else is just a monster to be dealt with. It doesn\u0026amp;rsquo;t matter what happens to those other because they are not really human. Given a chance they would suck out our brains so we have to fight back with everything we have.\nThere is an enormous selfishness that can show up at this level. An incredible indifference to the pain of others. A lot of the world spends at least part of the time here. It doesn\u0026amp;rsquo;t matter how much money you have, if you spend your life in constant fear you are living in survival mode. Unless and until we get people out of this hurt and lack we can\u0026amp;rsquo;t expect them to do anything else.\nShadows  Only out for themself Stuck in survival mode  Purple People are desperately hungry for tribe. This is a driving need. If people can\u0026amp;rsquo;t find a healthy way to express this need they will make do with an unhealthy way. Somehow, some way this need must be met. We are seeing a world wide resurgence of ethnic nationalism \u0026amp;ndash; which is an unhealthy expression of this tribal hunger. It explains some (but not all) of the attraction to Trump. His rallies were a potent drug. People felt part of a tribal whole and they were desperately missing that. How do we counter this? I will talk about deeper solutions in later sections, but possibly the simplest intervention is to get people to switch to a healthier tribe. The most successful way to get people to leave a white nationalist groups is to find a different group for them to join. The thing they really are looking for is that sense of group pride, belonging and togetherness.\nShadows  violent, ethnic nationalism (eg. white supremacy) only concerned about …","date":1637213175,"description":"","lastmod":"2021-11-18T05:26:15Z","objectID":"348d8c8f0a3f3d81da003cd59c652f83","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/practical-spiral-dynamics/shadows/","publishdate":"2021-11-18T05:26:15Z","title":"Shadows"},{"content":"When I first started telling people the Spiral Dynamics story I hoped it would wake them up to Turquoise all by it self. But nope. Most people are not quite ready yet. I feel like a popcorn kernel that has popped a little earlier than the rest. I hope and pray that it is just a matter of time before the rest of the kernels start popping so I can nestle in with them, but in the meantime it looks like I have some work to do.\nDo you remember the initial plan?\n Growing Up Cleaning Up  Healing up Wising Up   Waking Up Showing Up  We have been working on Growing Up. I started here because without a coherent story we are stumbling around blind. Blue religions tell us to just trust God and everything will be fine. It won\u0026amp;rsquo;t be. Orange scientists understand global warming but not people. Green activists understand the deep injustices of the world, but not how to fix it. Not really. Yellow seekers see no alternative but to watch the world burn. It doesn\u0026amp;rsquo;t occur to them to join with others. So we have to waken Turquoise but even that is not enough. The Spiral Dynamic stages are just one relatively small part of who we are. We are much bigger than that. We are bigger than our story, bigger than our fears. If we can get people out of survival mode and into the vast place of self-actualization we will change the world.\nSo how do we do that? Cleaning Up, Waking Up, and Showing Up.\nCleaning Up gives us a deep rich fulfilling life. Beige and Purple will lead us there. Beige guides us back to our bodies. Guides us to our connection with nature and our sexuality. Here we work with our trauma and wounds. This is the Healing Up part of Cleaning Up. Purple puts us in a healing community that supports and inspires us to grow. It provides a culture that encourages us to take on healthier, wiser life practices. We are never done with this growth work. This is the Wising Up part of Cleaning Up. It seems to work best to mix the two. We do a little healing work which then inspires …","date":1654061175,"description":"","lastmod":"2022-06-01T05:26:15Z","objectID":"a2ae17c2a5beae027195f66db7eb291b","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/practical-spiral-dynamics/towards-turqoise/","publishdate":"2022-06-01T05:26:15Z","title":"Towards Turqoise"},{"content":" Color Nickname Social construct Cause worth dying for  Beige FirstAwakening Family and Kin My family  Purple KinSpirits Tribe The sacred ground  Red PowerGods Kingdoms, Empire My king. Honor  Blue TrueBlue Church, Schools The Truth  Orange StriveDrive Capitalism, Democracy, and Science Give me liberty or give me death  Green HumanBond unions, environmentalism, feminism, racial justice, LGBTQ, et. al For my brothers and sisters  Yellow SecondAwakening Integral Theory, personal growth movement, medicine movement A life worth living  Turqoise PromisedLand Just starting to emerge Save the world   Spiral Dynamics is based on the research of the psychologist Clare Graves who was a contemporary of Abraham Maslov. Both were exploring all the stages of human development from the highest and lowest. Clare Graves\u0026amp;rsquo;s health started to fail before he could fully develop his theory but his work was carried on by his younger colleagues Don Beck and Chris Cowan. They took Grave\u0026amp;rsquo;s original theory and made it more accessible by adding things like color mnemonics. Ken Wilber took the theory and added it to his Integral Theory. He later on modified it to reflect his focus on individual, spiritual growth which is a different focus. I don\u0026amp;rsquo;t cover his variations because my focus is more on the group than the indvidual. That was Don Beck\u0026amp;rsquo;s focus as well. He made many trips to South Africa to try and put Spiral Dynamics to practical use during the transition from Apartheid. Later on he tried the same thing with Israel and Palestine. He saw how this theory could transform the world. It is that focus that I am most interested in here.\nThis is what I love about Spiral Dynamics:\n  It is a practical tool. It is meant to be of use. Please judge it by its practical benefits. It suggests concrete actions to deal with the world.\n  It helps us understand why \u0026amp;ldquo;those\u0026amp;rdquo; people act as they do. Depending on what stage you are at, the world looks very different. To …","date":-62135596800,"description":"","objectID":"d28d4d28f1c0b72a8c7d5fe79f85da67","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/spiral-dynamics/","title":"Spiral Dynamics"},{"content":"Beige  Color Nickname Social construct Cause worth dying for  Beige FirstAwakening Family and Kin My family   In the very beginning, our ancestors somehow had the first awakening. We stepped into a higher stage of consciousness. Imagine a caveman dad sitting on a rock with his son looking up at the full moon. The son says \u0026amp;ldquo;Dad, what is that?\u0026amp;rdquo;, And the dad says, \u0026amp;ldquo;I don\u0026amp;rsquo;t know. We call it the moon\u0026amp;rdquo; And both feel the awe and wonder of the world. This is where it all started. We have been using fire and primitive tools for maybe a million years. We don\u0026amp;rsquo;t know when we started to use language and when we first awoke to I, You, and Us. But awaken we did. We now had a higher vantage point of consciousness. Using imagination we could now travel into the future and the past.\nThis is my favorite stage. It is a reminder that we at our core are animals. Thinking animals, yes, but always and forever animals. Here we revel in the delights of our bodies and feel at one with our world. This is what I strive to return to when I go backpacking. We are meant to be part of nature not separate from it. There is a powerful spirituality in simply letting in the full beauty of the world. This is the stage with the best sex \u0026amp;ndash; primal and in the moment. This is where we go when we sit in front of a fire in the dark with friends and family and tell stories. This is the place we return to when we fully surrender to sweaty ecstatic dance.\nThe deep work of healing our traumas has to start here. In the body. The body keeps the score. Animals like deers, instinctively know that when something traumatic happens, like getting chased by a mountain lion, they have to take a moment and shake it off. The body has a deep wisdom of its own. But what a miracle to find a conscious mind inside our bodies. What a delicious thing it is to look out at the world and be a part of it yet separate.\nThis stage is the satisfying itch people scratch when they watch a Zombie …","date":-62135596800,"description":"","objectID":"8eee7d25ef28e166468f1dae66c35f36","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/spiral-dynamics/beige/","title":"Beige"},{"content":" table tr#Blue td {background-color:#00BFFF !important;}   Color Nickname Social construct Cause worth dying for  Blue TrueBlue Church,Schools The Truth   There is a Truth that is eternal and greater than us. This is what we wake up to in the Blue stage. We surrender to something bigger than us. And that surrender brings a profound, sweet purpose and meaning to life. Before this, Truth was localized. Whoever had the most power and authority determined what Truth was. Now Truth is recognized as eternal and one.\nGod is one path to this Truth, but not the only way. Buddha woke up under a Bodhi tree just as himself, not a god. He taught a practical path to enlightenment that anyone willing to do the work can follow. Plato based his work on the very Blue notion that the world is just a shadowy reflection of the ideal. The Greeks had no shortage of eloquent smart thinkers, but when those thinkers only focused on selfish, individual ends they just ended up with sophistry. Nothing useful could be built on that. Plato and Aristotle gave the world a glimpse of what is possible when you base your ideas on the foundation of Truth. Science needs this stage first before it can flourish.\nAnd then there was Christ. Imagine his time. Rome was confidently in charge of its brutal slave empire. And the people suffered. Christianity has a lot to answer for, but consider what happened at the very, very beginning of this religion. Some how, some way this man inspired a revolution that spread throughout the Western world. Women and slaves were recognized as beloved of God. Might makes right was no longer the highest truth. The cross which was a torture device used to keep people in line now became a defiant symbol of redemption. What an incredibly sneaky way to revolt against the empire! No armies were needed. Instead people were ready and willing to die for a belief. And the world was changed.\nMohammed is a similar story. Just like Christ he went into the wilderness to find himself and …","date":-62135596800,"description":"","objectID":"7e546f40af22a08c0f2cb7b55d19e6f2","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/spiral-dynamics/blue/","title":"Blue"},{"content":" table tr#Green td {background-color:#228B22;}   Color Nickname Social construct Cause worth dying for  Green HumanBond unions, environmentalism, feminism, racial justice, LGBTQ, et. al For my brothers and sisters   The genius of Martin Luther King\u0026amp;rsquo;s I have a dream speech is that it builds on the (Orange) words of the Declaration of Independence and brings us forward into a new stage, Green.\n \u0026amp;ldquo;I have a dream that one day this nation will rise up and live out the true meaning of its creed - we hold these truths to be self-evident: that all men are created equal.\nI have a dream that one day on the red hills of Georgia the sons of former slaves and the sons of former slave-owners will be able to sit down together at a table of brotherhood.\n  \u0026amp;hellip;\n  And when this happens, when we allow freedom to ring, when we let it ring from every village and every hamlet, from every state and every city, we will be able to speed up that day when all of God\u0026amp;rsquo;s children, black men and white men, Jews and Gentiles, Protestants and Catholics, will be able to join hands and sing in the words of the old Negro spiritual: \u0026amp;ldquo;Free at last! Free at last! thank God Almighty, we are free at last!\u0026amp;rdquo;\n Notice how he bring us back together to our shared humanity. Our deeper freedom arises from coming together not splitting apart. This realization was the start of so many important awakenings. The environmental awakening. We commit to cherish, honor, and protect our mother earth. The feminist awakening. Time to stop oppressing women and break free of our sexist stereotypes and limits. The peace awakening. No more mindless wars. The race awakening. We recognize how deeply racist our society is and we commit to healing this broken mindset. Later on \u0026amp;ndash; this one took much longer sadly \u0026amp;ndash; we started to embrace the LGBTQ community and the full continuum of our sexuality.\nAt this stage we start to realize that the rational mind is not the only source of Truth. Just …","date":-62135596800,"description":"","objectID":"84a2cac9f14a910494402338d7b5eb0b","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/spiral-dynamics/green/","title":"Green"},{"content":" Color Nickname Social construct Cause worth dying for  Orange StriveDrive Capitalism, Democracy, and Science Give me liberty or give me death   The Japanese were confronting the technological results of The Age of Enlightenment. This was a turn away from the church and God towards looking for the Truth within. From this stage emerged modern science, capitalism, and democracy. America\u0026amp;rsquo;s Declaration of Independence is a quintessential expression of Orange:\n \u0026amp;ldquo;We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness\u0026amp;rdquo;\n Self-evident means that when you introspect on it, it becomes clear that it is true. Math proofs are meant to be self-evident. This was the age of Reason. Notice how this puts the source of Truth back in the individual. The purpose of life is now not focused on God but instead the pursuit of happiness. And we need our liberty (freedom) to go and do that. Both free market capitalism and democracy trust the wisdom of the crowd to get us to the best answers. This was a very radical idea at the time, and yet it has worked out surprisingly well. Markets do seem to be a much better mechanism than command economies and democracy is a much better governing system than all the alternatives.\nSo when those American Black ships steamed into Tokyo, Japan was faced with a stark choice. Stay Blue and inevitably become some western (Orange) country\u0026amp;rsquo;s helpless colony, or make the switch to Orange. Japan chose to make the switch. This was a remarkable period of time called the Meiji era. Japan is the only non-western country that I am aware of that made this leap during this time. It was maybe a century behind technologically, but because of all those years of peace and prosperity it had a strong cohesive base to build on. Remember up till now almost no Japanese had ever left the country (or if they …","date":-62135596800,"description":"","objectID":"7c5d3734043f62eb65b15e353f28454f","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/spiral-dynamics/orange/","title":"Orange"},{"content":" Color Nickname Social construct Cause worth dying for  Purple KinSpirits Tribe The sacred ground   Something amazing happened about 40,000 to 50,000 years ago. We see it in the cave paintings of the time. When we stop and really look at this powerful art we can not help but be moved. These people were just like us. This was clearly the next step up in consciousness. From smallish bands we formed bigger tribes and we became bad-asses. Human population numbers started to grow and we spread out across all of the planet. And where ever we spread, populations of bigger animals like Mastodons crashed. Presumably because we hunted them to death.\nSpirit became the center of our lives. Spirit of place, animal, and ancestors. Deep magic lives in the sacred places. Animal spirits and our ancestors are here to guide us, if only we can get quiet enough and reverent enough to hear them. We fast and pray for days. Then head off alone into the wilderness to do our sacred initiation rite and face our internal demons. Then we return to the wild celebration of the tribe. You are back! We are so glad you are back! We are one. Tell us of your visions so that we may all learn from the spirits. You are home. You are loved. So deeply loved.\nPurple throws the best parties. It was a big part of the draw of the hippies in the 60\u0026amp;rsquo;s. From all accounts Woodstock was very Purple. We tend to idolize this stage, but movies like Dances With Wolves do catch an important historical point. Colonists \u0026amp;ldquo;kidnapped\u0026amp;rdquo; by Native Americans never wanted to return when given the opportunity. The Native Americans living mostly at Purple were living a much richer, more satisfying life.\nThis is the stage when art and religion really took off. We started to awaken to a higher purpose than just the day to day cycle of survival. We turned to each other and found we share an even bigger mystery than individual consciousness \u0026amp;ndash; shared consciousness. We are tribal animals. The cruelest punishment …","date":-62135596800,"description":"","objectID":"f404b71c2a9d42b3ededce0db4bc0344","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/spiral-dynamics/purple/","title":"Purple"},{"content":" Color Nickname Social construct Cause worth dying for  Red PowerGods Kingdoms, Empire My king. Honor   This is the stage of empire. The strong ruled over the weak. We are taught to venerate Rome, but by today\u0026amp;rsquo;s standards it was a hopelessly evil slave empire. It was very Red. Rulers the world over declared themself as God. The Pharoahs built their pyramids and other rulers demanded that their followers commit suicide when they died. And people willingly followed them into death. This is the stage of the Alexander The Great and Genghis Khan. Alexander is remembered as a \u0026amp;ldquo;great\u0026amp;rdquo; man, but by today\u0026amp;rsquo;s standards he would be considered a murdering lunatic. He probably killed his father to gain power. He killed a lot of other people just for the glory of it. Genghis Khan by all accounts was a self-actualized guy who achieved his biggest dreams. Too bad about all those millions his troops killed. But here is the most important point. Genghis and Alexander (and their legions of followers) did not consider themselves evil. They considered themselves the good guys. And you have to kind of marvel at their martial excellence.\nThere is a real darkness here. Brutal wars of conquest swept across the world. The worship of the Goddess was suppressed and women became property. Slavery took root and flourished. Wealth and power went to the very top. People were forced into a brutal form of agriculture that put them into early graves. Much of the suffering of the world still comes from this stage of thinking. This is not how we want to live, but there is no turning back. Much as we might like to go back to Purple we have no choice. We have way too many people on this planet now to sustain a traditional Purple lifestyle. It is like when Cortes landed on the shores of Mexico determined to conquer the Aztec empire. He scouted the coasts for a bit then determined he had to head inland. So he did something very Red; he scuttled his ships. Can you imagine what it must …","date":-62135596800,"description":"","objectID":"698daa540c84f45e142d0608a8f8dc10","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/spiral-dynamics/red/","title":"Red"},{"content":" Color Nickname Social construct Cause worth dying for  Turqoise PromisedLand Just starting to emerge Save the world   After finding our vast strength in Yellow we start to really open up to all that is. And it hurts. Really hurts. The world is suffering in so many needless ways. We have met this pain before and run away, but this time we suddenly realize how truly big we are. We are more than just our narrow individual ego. We are part of something so so much bigger. Big enough even to face that scary tidal wave of world pain. We are all one. When you suffer, I suffer too. We now start to really get that. And it is so not OK what is happening. The deeper joy is the joy of all not just the one. From our place of strength we look up and out. And a wild, crazy hope emerges. On our own there is relatively little we can do. But together? Together we can change the world.\nTurquoise as a societal construct is not yet here. There is no history I can point to. So we don\u0026amp;rsquo;t really know yet exactly what Turquoise is going to look like. But we do have the pattern of what has happened up to now to give us some important clues. We know that this stage will be the (tock) return to community. And just like Yellow revisits Beige at a higher stage, Turquoise revisits Purple. We will know Turquoise has arrived by its awesome, legendary parties. Burning Man might be an early yearning towards this. Just like Purple was the start of religion, Turquoise almost certainly will see the rebirth of an enlightened form of religion. It will be a practice of spirit that deeply nourishes and strengthens. And we will become bad-asses once more.\nTurquoise is like a prophecy in a story. It is a dream of what we hope and pray will come. And it can be our intention. Our guide of what needs to happen in order for the world to flourish. But even though Turquoiseis not yet fully here I do see some signs of it starting to emerge. Valerie Kaur\u0026amp;rsquo;s Revolutionary Love Project is one example.\nPlease …","date":-62135596800,"description":"","objectID":"eb4d38110ef904919048849c78321580","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/spiral-dynamics/turquoise/","title":"Turquoise"},{"content":" Color Nickname Social construct Cause worth dying for  Yellow SecondAwakening Integral Theory, personal growth movement, medicine movement A life worth living   At some point we need to turn back to ourselves to find the Truth of things. We have absorbed the lessons of Green, and yet we are not at peace with ourselves. Green by itself won\u0026amp;rsquo;t get us to the healing we need. Green by itself won\u0026amp;rsquo;t heal the world. People insist on going their own selfish ways no matter how patiently we explain to them how stupid and evil they are. Then we try a little louder and slower, like you might to someone who does not speak English well. You. are. stupid. And. Evil! Huh. How can they not understand that?!? Why don\u0026amp;rsquo;t they understand how stupid and evil they are?!? Maybe we are missing something? Perhaps there is a deeper stage to go here? Maybe just maybe there is something more workable than dividing the world up into good and evil? But to convince you of that I need for you to go very deeply into yourself. Kind of like an odyssey of the soul. It can be a bit scary and painful, but there is also wonder and joy. It feels like Odysseus tied to his ship finally surrendering, cutting his ropes, and jumping off to join the Sirens. Giving up this life so that he can know what worlds come after.\nAnd after we come up for air we are awakening all over again. We are right back to Beige staring in awe at the moon. It is exactly the same and yet different because this time we have the lived experience of so many previous generations. At Green we might dabble with Native American traditions, but it is at this Yellow stage where we truly get how much we can learn from these ancient cultures. And we find an incredible longing to go back to that way of life. But we can\u0026amp;rsquo;t go back. We scuttled our ships on the beach and the only way now is forward. Or die. The first step is to find our own strength and truth. It has to start here. Stop, breathe, spend time in nature and …","date":-62135596800,"description":"","objectID":"b6096f1c81d751b24b8da2522c45f959","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/spiral-dynamics/yellow/","title":"Yellow"},{"content":"Why is eight a magic number?\nValence shells Eight is a magic number in chemistry. Molecules want to have exactly eight electrons in their outermost valence shell. Chemistry is based on this. It defines what atoms can join with what other atoms. So for example carbon atoms have 4 electrons in their outer valence shell. So a simple combination is to put two carbon atoms together to form a total of eight. I\u0026amp;rsquo;m simplifying a bit, it turns out that two in the outer valence shell works as well, but is much less common.\nUpper limit to short term memory Our short term memory seems to only hold 5 to 9 things at a time. So if we are coming up with a list that we want people to hold in their heads, eight (or at the very most nine) is the maximum.\nLucky number in China The Chinese hold eight as the luckiest number. They traditionally tended to group all of their important things in eights. So they have eight astrology signs, eight imperial ministers, eight cardinal points, etc. Our western minds are quick to scoff at this, but China has a long, rich lived history that deserves respect.\nNotes in a scale A musical scale has eight notes. When you go up or down by eight notes, the notes somehow sound exactly the same, just at a different octave.\nSweet spot for sleep Eight hours seems to be the sweet spot for hours of sleep\nEight Hakomi Principles Hakomi started with 5 principles, but now (depending on who you ask) is up to 8. I think adding the extra 3 principles really made the list complete. I am very happy about this \u0026amp;ndash; I always thought there were a few missing principles (eg. Loving presence) and now it feels just right to me.\nSpiral Dynamics Spiral Dynamics has 8 levels. Note that just like in chemistry the levels we most want to go to are 2 (Purple) and 8 (Turqoise).\nSo what does all this mean? Nothing really \u0026amp;ndash; I just find it amusing.\n","date":1645629975,"description":"","lastmod":"2022-02-23T15:26:15Z","objectID":"16dd545c4aba191563f17d54ed0540fb","permalink":"https://cosmosgame.github.io/save-the-world/posts/eight/","publishdate":"2022-02-23T15:26:15Z","title":"Eight is a magic number (tangent)"},{"content":"Everything is God (the Universe) and God (the Universe) is love\u0026amp;quot;\nDoes this ring true to you? It is the core belief of the various New Thought religions such as the Centers for Spiritual Living (CSL) . The truth of these words live in my full body not just my head. Back when I was still an atheist I spent many Sundays in CSL church standing and crying as I awoke to this deeper truth. The words started me on the journey but the music they played at church is what got me there. Everything is God. Including me. Including you. Seriously, no-kidding everything.\nEverything means everything I\u0026amp;rsquo;m always a little surprised when I tell people this belief and they just nod and don\u0026amp;rsquo;t push back. There is an awful lot packed into just this one sentence! Following it fully can be quite challenging. Let me give you some examples\nLove your ego I see people arguing earnestly about how important it is to get rid of your ego. I find that alarming. Our ego is an important part of us and it serves us. It is there for a reason. They key is to notice how attached we can get to it and the suffering that can happen when we do. As an aside I confess it is deeply amusing to see people attack the ego in what (at least to me) seems like such an ego-full way.\nLove all the faces of God. Whether you spend two years in a forest monastery or spend two years learning Quantum dynamics in both cases you are devoting yourself to loving one of the faces of God. There are many paths. The way I found my way to spirit was to reassure my rational mind I would never forsake it. It too had an honored path to Truth. It is hard sometimes because I live in two worlds. I live with the Rationalists who don\u0026amp;rsquo;t fully get Spirit. And I live with the Spirit people who quite often don\u0026amp;rsquo;t get Reason and science and don\u0026amp;rsquo;t seem to respect them. There are so many paths to Truth! So many faces of God that I/we don\u0026amp;rsquo;t know yet.\nLove our darkness. Time for confession. During this latest …","date":1656957871,"description":"","lastmod":"2022-07-04T10:04:31-08:00","objectID":"bbc448defde4793bb03854d1fe55cf0a","permalink":"https://cosmosgame.github.io/save-the-world/posts/everything-is-god/","publishdate":"2022-07-04T10:04:31-08:00","title":"Everything is God"},{"content":"Backpack without a backpack on the Pacific Crest Trail (PCT). Join us for our first \u0026amp;ldquo;comfy\u0026amp;rdquo; backpacking trip. Experience the magical connection with nature that backpackers get without the need to actually carry a backpack and provisions.\nHow is this possible??\nEach day you get to hike from one campground to the next. Our truck and trailer will transport the gear. At the next camp site your tent and hot meals await you. The hikes each day will last about 6 hours if you are hiking at a moderate pace including time for lunch. On flat stretches they will average 10 miles. On days with elevation gain they are no longer than 6 miles (but you can go longer if you want). On most days there are options for shorter hikes, and you can always ride in the truck if your body is ready for a day off.\nWe have planned a seven day journey into nature starting at the southern tip of the PCT (at the Mexican border). We have found it takes a few days to disconnect from the everyday world and to let yourself really immerse in nature. To accomplish this, we ask that you plan to stay with the group for the whole week. We also ask that you minimize use of cell phones to help keep you in the backpacker\u0026amp;rsquo;s mindset.\nEach afternoon Odysseus will also lead a walk to experience “forest bathing”. This custom originated in Japan and encourages us to use all our senses on a slow walk with stops to appreciate our surroundings.\nYour cost is only the actual cost for camping, supplies and gas. Cost: ~$200 (depending on number of people, max 10) plus your cost to get to and from San Diego. We will provide airport pickup as needed.\nBackpacking without carrying a backpack? Why not!\nDates Saturday, April 16th 2022 - Sunday April 24th 2022\nContact us! Interested but have questions? Ready to sign up? Send one of us an email:\n odysseus.levy@gmail.com rhonda@cayford.org  Itinerary We have reserved the campground at Lake Morena starting Saturday (4/16) and you are welcome to join us. Our trip …","date":1641050775,"description":"","lastmod":"2022-01-01T15:26:15Z","objectID":"094113679270a57d7de82acc7e203c72","permalink":"https://cosmosgame.github.io/save-the-world/posts/pct-trip/","publishdate":"2022-01-01T15:26:15Z","title":"Hike the Pacific Crest Trail"},{"content":"I\u0026amp;rsquo;m curious to know if there is interest in this. It is kind of an amusing thing to think about. How could engineers have anything to contribute to the conversation of waking up to a bigger consciousness? And yet I think we do.\nPost a message if you might be interested in me writing this up. Right now I am focused on the main path and this is definitely not that.\nHere is the outline of what I would want to cover:\n Software engineer path  Radical truth  Running in debug mode Embrace when you are wrong Measuring   Learning to be wrong  It is a practice Needs to be supported OK to aspire to excellence anyways   Check your assumptions  debugging leads to this examine sources of truth   Dealing with complexity  simplify layers scrum  negotiating complexity not everyone has to be a software expert     Deep dive  Five whys Failure without blame Factoring in that humans are failable   Flow  Cure for sensitivity -hiding out in the crystalline, beautiful forests of reason Teaches possibility of joy  joy based life     Request For Comments (RFC)  Courageous asks that can change the world   Models Open source  Shared libraries Forking Not all opinions are equal      Five Whys ","date":1599434191,"description":"","lastmod":"2020-09-06T16:16:31-07:00","objectID":"ee67c5fa00ce0b4e1f6035527720bb59","permalink":"https://cosmosgame.github.io/save-the-world/posts/programmers-path/","publishdate":"2020-09-06T16:16:31-07:00","title":"Programmers Path"},{"content":"Actualized.org\nThe Great Work, our way into the future https://thomasberry.org/quote/the-great-work-our-way-into-the-future/\n recommended by Forest Bathing organization  ","date":1626045391,"description":"","lastmod":"2021-07-11T16:16:31-07:00","objectID":"5e1b35d57b14a805ac5f9cc2b81cc5d4","permalink":"https://cosmosgame.github.io/save-the-world/posts/resources/","publishdate":"2021-07-11T16:16:31-07:00","title":"Resources"},{"content":"collection of snippets Hakomi Body-Centered Psychotherapy\n   Old paradigm New paradigm     fundamental separateness unbroken wholeness\nfundamental connectedness   absolute certitude\nonly matter is real (materialism) uncertainty, relativity\nconsciosness is real (dualistm, monism)   the mind/body split mind/body integration   biology is destingy we create our own destiny    Goal My goal is to first save the world, because it needs saving. If we don\u0026amp;rsquo;t stop carbon dioxide emissions soon, billions will die. But we have to go way beyond just that because in some ways it already is too late. Climate change is now irreversible. There is no going back. We are going to have to learn to share a very different, challenging world. Simply to survive we now have no choice but to learn to care for all. Some will live in areas that benefit from climate change and many will not. We will have to learn to share everything. But this urgent necessity is also an opportunity. We can chose to create a world of our dreams. It really is possible. In fact it is our best hope of survival. I hope to convince you to join me. I need allies. This world needs allies.\nThis site is meant for people who are excited by the bigger dream of what we are all collectively waking up to. Waking up to finding their bigger purpose of service. Service coming not from a place of self-sacrifice but instead from listening to the call for the deeper joy that is struggling to be born but needs some midwives. Please join me. I can\u0026amp;rsquo;t do this alone.\nSo many people are already working on saving the world. But often they are only bringing just a part of themselves to the work. Many people are doing great science (Mind) based work and wondering why people are not moved by what they have discovered. They are not meeting people where they are. Many people are doing the intense healing (Body) work that is so needed, but are not aware of how they fit into the bigger picture. We need people to step into a larger …","date":-62135596800,"description":"","objectID":"0081eeab87f442e647e37a30ddb3d321","permalink":"https://cosmosgame.github.io/save-the-world/posts/snippets/","title":""},{"content":"Save The World Books This is a list of the books that have a plan to save the world. There are surprisingly few of them. Most are not well known.\nCommunity Peter Block works with communities to help them find their voice and power. This book is a guide to what seems to work the best. Val Hammel is using this as a guide to how she can revitalize HAI and make it flourish. She thinks the way to save the world is to rebuild our communities. I strongly agree with her.\nThe book is a little heavy on theory early on. Val recommends skipping ahead to where Peter gets into concrete examples first to better understand what he is saying. It probably would have worked better if Peter had flipped the order of the book. First give the examples of communities he has worked with and then later on talk about theory.\n","date":-62135596800,"description":"","objectID":"b19066f515b030ede8b37d7a9ead8692","permalink":"https://cosmosgame.github.io/save-the-world/resources/","title":"Resources"},{"content":" Showing Up  Why it is now possible  better model reclaiming spirituality healing and growth   Boddhisatva vow Goals  Healing  Focus on what works Generational trauma \u0026amp;ndash; stop hurting children   Working with all the colors  add the missing blue helping people to find Turqoise     Church of personal growth  Establish practices (like karate does)   Bring up our own leaders  Build in feedback  Address fear of doing harm   Leader as servant mentality   What is working  HAI  CSL   MSC NVC Hakomi  RAIN   Cohousing  Very green! better ways to raise our children consensus as a personal growth mechanism   Medicine   Need to scale quickly Governance  Need for new governance. Sociocracy? Accountable Evangelical      ","date":-62135596800,"description":"","objectID":"2e3528445fbc83fc4d895b04b75617f7","permalink":"https://cosmosgame.github.io/save-the-world/showing-up/","title":"Showing Up"},{"content":"Let\u0026amp;rsquo;s start. May I have your permission to dream with me? Dream way, way, way bigger than you maybe normally do? OK? Here is my question: What do you really want. I mean really. Yes, yes you can have a billion dollars \u0026amp;ndash; boom \u0026amp;ndash; now keep on going deeper. This is a dream after all so you can have anything. What do you want beyond just the superficial stuff? Maybe deep happiness for yourself? Yes, please hold on to that part of the dream, but try going even a little further. Maybe dream of happiness for others? Certainly you can dream of happiness for your loved ones, but how about living in a world of joy for all? Wait, you can imagine a billion dollars but not that? Stay with me here. Let\u0026amp;rsquo;s try again. Stop and breathe. Settle down into your body. Notice where you are and everything you are feeling in this moment right now. And then ask yourself the question again, but this time from your heart. What is the biggest dream you can dream? How big can you open your heart? Notice if resistance comes up. That is very normal. Try to really get in touch with what that resistance is about. Know that it is very valuable to get in touch with this \u0026amp;ndash; it is going to guide us on the work that needs to happen. Just about all of us are working on expanding our hearts past this resistance. I don\u0026amp;rsquo;t think we ever are done with this work. And we all can use teachers.\nMy first great teacher was my son. It happened in an unexpected way. After graduating from college I flew to Japan to teach English. My third week in Tokyo the Japanese woman I was seeing became pregnant with my child. She was fifteen years older than me, and we had been having a fling. No love between us at all really. She told me to go, she could handle this. But I had a waking vision \u0026amp;ndash; I never have waking visions \u0026amp;ndash; of a 18 year old stranger knocking on my door saying, \u0026amp;ldquo;Dad?\u0026amp;rdquo;. I had no idea of \u0026amp;ldquo;what\u0026amp;rdquo; needed to happen, but I was so very, very clear …","date":-62135596800,"description":"","objectID":"82a3c96cf09a4b36c283afafa5de8c55","permalink":"https://cosmosgame.github.io/save-the-world/the-dream/","title":"The Dream"},{"content":"If you walk into a bookstore you will find books on saving yourself, but not on saving the world. You will find books addressing specific problems, but not on how all these problems relate together as a whole. There are a few books like that of course. I have made a point of finding them. But they are not well known and definitely not best sellers. Why is that? Why don\u0026amp;rsquo;t we have even one well known plan to save the world? Partly because it is just too overwhelming. We are all stuck in the trance of helplessness. Our shared story is still way too small. But another part is that most of us don\u0026amp;rsquo;t have much experience working with complex systems. Some people do though \u0026amp;ndash; programmers. We have to. No one every formally taught me how to manage complex systems, but out of necessity I learned it over time. I learned that any problem at its heart is because people are far from perfect and you have to figure out how to compensate for our human weaknesses. It turns out that is true of all our problems, not just computer ones. Later on I discovered there is a name for this kind of thinking. It is called Systems Thinking. It recognizes that when you are dealing with the \u0026amp;ldquo;wicked problems\u0026amp;rdquo; of the world you first have to understand the whole system. The temptation is to just pick a part of the problem and get to work because the need is so urgent, but that ultimately has limits. It can help, but it will not get us all the way where we want. We need to go deeper. We need to teach people this style of thinking. It is the only thing that works. So how do does this method work? Let me give some examples.\nFind the root cause I truly hate getting woken up at 3am to solve a service outage. I especially don\u0026amp;rsquo;t like having to report to senior management why I personally cost the company many hundreds of thousands of dollars in lost revenue. And yet this has happened to me. So I am highly motivated after each incident to learn from it what we can do to …","date":-62135596800,"description":"","objectID":"410bef4c18a282cdfa9ab8c258817f0c","permalink":"https://cosmosgame.github.io/save-the-world/the-dream/going-deeper/","title":"Systems Thinking"},{"content":"I suggest we run this site the way open source projects usually run. Programmers kind of just know how it works but let me try and make the underlying principles clear here. The goal is to come up with guidelines that we can fall back on when we are trying to decide what goes in and what stays out. Something that guides us as we write and review. If you find that some part of this site does not match these guidelines please let me know - it is a bug that needs to be fixed.\nSimplicity I deeply value your time. I promise not to waste it. There is a lot to cover here, but I will only bring in the most important points. There are lots of fun tangents that can be visited as side topics, but the goal is to focus on finding the simplest thing that can work. Every idea will be expressed as simply and clearly as possible. If you don\u0026amp;rsquo;t understand a concept it is my fault not yours. Let me know. If you think I\u0026amp;rsquo;m wasting time on something, then you might have found an important bug (or at the very least I am not explaining well enough why it is essential).\nPractical The goal is to create something practical. Something that can actually change the world. Getting the theory right is incredibly important, but on the main path we don\u0026amp;rsquo;t want to bring in any more theory than is strictly necessary. People like myself can go off and do the readings, but then we need to come back here ready to share the useful nuggets that can be put to work.\nWe will know this project is working when we see it inspire actual healing and growth in the world.\nKaizen Kaizen means constant on-going improvement. It is always possible to grow and learn. You should be a bit skeptical of initial versions of this site, but over time as more people contribute and comment the site will grow and mature. Kaizen is a very open source concept. It is also very Japanese. You are never done with the work \u0026amp;ndash; there is always more to be done. And there is a deep joy in that.\nSelf evident Nothing …","date":-62135596800,"description":"","objectID":"e4b01eb809e6b3097214fd714a10fbfd","permalink":"https://cosmosgame.github.io/save-the-world/the-dream/guidelines/","title":"Guidelines"},{"content":"More people should be aware of the open source movement. It is kind of a big deal. I\u0026amp;rsquo;ve been watching it with fascination from the beginning. In the 1990\u0026amp;rsquo;s it was not at all clear that it would end up completely conquering the world, but it did. Much of the software that you are using at this very moment is open source. It is built into the very foundations of the internet. Open Source out competed fierce capitalistic companies because it is a better way of collaborating. It is the only instance that I know of where communism won. No one owns open source software; people freely donate their time to it as a gift to the world. Ideas work best when they are free. And frameworks work best when many people have taken a serious look at them and offered improvements. But despite this idealism open source exists to be of use. Not all contributions are accepted. It is not like the wikipedia where there are endless, wasteful edit wars over controversial topics. Open source tends to avoid all that and stays focused on delivering value. And if it doesn\u0026amp;rsquo;t, some other open source project comes along to replace it.\nOpen source does not have to be just for software. I propose that this plan to save the world should be an open source project. So how does that work? This website is hosted on Github, which is where many open source projects live. Every aspect of this site is open to inspection and review. Github supports this kind of collaboration through an intuitive interface. The Github UI is meant to be accessible even to people who are not strongly technical.\nThere are three main ways to interact with this site\nComments Please, please leave a comment below. Even just to say Hi. You have to create an account to do this, but that is to prevent bots from spamming the comments. My apologies for making you do that, but it is necessary. Unprotected websites get horribly spammed. And I hope you do register because I so want to hear your thoughts. This is the easiest …","date":-62135596800,"description":"","objectID":"7ee9af246a839b7da61bb68e6bf63389","permalink":"https://cosmosgame.github.io/save-the-world/the-dream/open-source/","title":"Open Source"},{"content":"So how are we going to do this? What does the plan look like?\nThe Goal First we need to be clear on where we are going. What do we truly want for this world? What would light us up all the way? I suggested earlier that we don\u0026amp;rsquo;t have to over think this. Let our love for our children guide us. Let our inner child guide us. We already know what we dream for the world, we just have to dare to believe it is possible. On some beautiful day the world is going to wake up in love and joy. But we can\u0026amp;rsquo;t just jump straight there from where we are now. This is where the work is.\nIntegral Theory The first step is getting our stories straight. The stories we have been telling ourself up to now have not been serving us. They have been keeping us helpless and isolated. We need to find a bigger story that brings us together. A story that gives us solid ground to stand on. Fortunately, I think much of this work has already been done. Ken Wilber is a brilliant philosopher who had the insight that it is more than past time to integrate all the different worlds of human experience into one integrated theory. Western philosophy, Eastern philosophy, Empiricism, Spirituality, Buddhism, and everything else all brought together as one. This theory is called Integral Theory. I find that it is a great foundation to build upon. It explains a lot of things well.\nThis is his beautifully succinct summary of the work we all need to do:\n Growing Up Cleaning Up Waking Up Showing Up  There are two different (but related) things happening with Cleaning Up so I break that into two more parts:\n Healing Up Wising Up  Growing Up Before we can change the world we have to really understand and model the vastly different ways people look at the world. We are missing a map to help us chart our way. We need to go deeper than just assuming that everyone thinks about things pretty much like we do. They don\u0026amp;rsquo;t. Not even close in fact. And yet some how, some way we need to convince people to open …","date":-62135596800,"description":"","objectID":"e2fe3311b96f8e275871b3078a5754bc","permalink":"https://cosmosgame.github.io/save-the-world/the-dream/overview/","title":"Overview"},{"content":"Who am I to save the world? I am just this nobody on the internet. I don\u0026amp;rsquo;t have any particular expertise or credentials. There is no particular reason you should listen to me other than maybe I can get you to think. But in some ways this ordinariness is actually an advantage. It is so obvious I can\u0026amp;rsquo;t do this alone. We are going to have to do this together\nTo give this any chance of working I can\u0026amp;rsquo;t hold anything back. I need to bring in everything that I am. Not just the shiny parts I want to show to you, but all of my rage, sorrow and pain too. Not just the gifts that I have, but the broken hurting places too. All of me is sacred and holy. All is welcome and loved. And all by myself I am nothing. I have to somehow inspire you to bring in all of yourself. All of your joy and all of your pain. All of you is sacred and holy. All of you is welcome and loved. And together as we look out at the world we need to find a way to bring everyone, yes truly everyone into it. How could it be otherwise? We need all of us.\nWe all have our unique stories. The stories that have shaped us. The stories that are our gift to the world. Let\u0026amp;rsquo;s start with mine.\nExplorer My driving trait seems to be curiosity. I always, always want to dig deeper into the Truth of things. Especially if it is hard. The greatest gift you can give me is to help me see a truth I have been hiding from myself. This is where I started. This drive to explore has taken me to many amazing places, most of them internal.\nMy purpose is to climb tall mountains and leap into worlds unknown to chart the course for others to follow. Let me unpack that a little. I\u0026amp;rsquo;m attracted to things that are challenging and hard. The hard work of climbing a mountain is more than worth it for the view. And again I\u0026amp;rsquo;m talking mostly about internal challenges. Then when you finally get to the top of the mountain you now have a choice. You can go back to your familiar world or you can jump off into the unknown …","date":-62135596800,"description":"","objectID":"324530fd5670d698059fd97e970ae89f","permalink":"https://cosmosgame.github.io/save-the-world/the-dream/who-am-i/","title":"Who Am I?"},{"content":"(Not Started)\n Waking Up  Soulwork vs. Spirit work What has worked in the past?  Gandhi Martin Luther King Christian awakening Moslem awakening Sikh awakening   Mindful Self Compassion  Final level Unity consciousness Everything is God (or the Universe)   Spirituality at all color levels How do we know what is true?  Spirituality does not have to be in conflict with science Magical thinking Need again for a model   Quadrants  UR UL LR LL Quadrant myopia  UL UR LR LL   Embrace all quadrants  Tale of two churches  CSL Unitarian       Integral Spirituality  Embrace all colors Embrace all quadrants      ","date":1659590775,"description":"","lastmod":"2022-08-04T05:26:15Z","objectID":"f7a5a8a9f721702b11dd3651bf1d7b7c","permalink":"https://cosmosgame.github.io/save-the-world/waking-up/","title":"Waking Up"},{"content":" “People will only protect what they love.” Jacques Coustea\n ","date":1659590775,"description":"","lastmod":"2022-08-04T05:26:15Z","objectID":"657e6a8dc4c5b8fd0fa64b4752665f17","permalink":"https://cosmosgame.github.io/save-the-world/waking-up/love/","publishdate":"2022-08-04T05:26:15Z","title":"Love"}]