[{"content":"Welcome! Thank you so much visiting this web site!\nI am at the very beginning of this creation so it was a bit hard for me to ask you to review something so unfinished. I am deeply grateful that you did! Your feedback is precious to me \u0026amp;ndash; it will help me create something of value. I won\u0026amp;rsquo;t get there without your help. Don\u0026amp;rsquo;t worry about hurting my ego, this is about something much bigger than that.\nMy goal is to save the world. I want to create a plan that could possibly work. I don\u0026amp;rsquo;t particularly care if it is my plan or not \u0026amp;ndash; I just want something that we can coalesce around. The fact that me, a random person on the internet, is creating this plan gives me hope that I am not alone. I suspect there are many of us working on this, we just need to find each other.\nWith all my heart I hope to create something that actually serves the world. My hope is that this site becomes a place for dreamers like me to plan their grand plans. Please notice that this is an open source website. By its very structure this website is centered around welcoming other people\u0026amp;rsquo;s contributions. Things like this work best when lots and lots of people review it honestly. So please let me know what you truly think, both good and bad.\nIt is a pretty wild ambition to save the world. To even have a chance it will require many, many different voices speaking from a place of deep Truth. We all have our own paths to Truth, let\u0026amp;rsquo;s first start with mine.\nSave the World There is so much suffering and pain in the world. When I let my heart open wider into the vastness of all that is, I go to an aching sadness. So. much. pain! Can you feel it also? At least a little? The sensitives among us certainly do. Here take this pill so you can function, as if shock and horror were not the most appropriate reaction to the world. As if everything is fine, just keep on going don\u0026amp;rsquo;t pay attention to that poor, suffering, homeless person in the corner there. And our history! …","date":1608218775,"description":"","lastmod":"2020-12-17T15:26:15Z","objectID":"3976528693a0108357f4928017600865","permalink":"https://cosmosgame.github.io/save-the-world/","publishdate":"2020-12-17T15:26:15Z","title":"Welcome!"},{"content":"  Welcome\n Welcome and thanks Saving the world  Pain of the world   There is hope  Acknowledge hopelessness theory advances psychological advances medicine advances spiritual advances      The Dream\n what do I really want? we already know let the children guide us Generational trauma  protect the children stop the cycle (or at least dampen it)   Same goal  Widen circle of compassion  What is blocking this?  world view wounds and trauma spiritual poverty          Who Am I?\n Purpose? Software engineer, personal growth, spiritual awakening  mind,body, and heart [TODO] environmentalist many paths all of me, all of you, all of us lead by example learnings (briefly mention, link to other page) comfortable bringing together theories simplify focus on practical, measurable results [TODO] humble is hopeful Open source leading the way      [TODO\u0026amp;ndash;move] Open Source\n Surprising success Harness all of us  place where we   Feedback  comments bugs PR\u0026amp;rsquo;s   Community Promises  Simplicity  Value your time simplify   Practical, solution based  No more theory than strictly needed do the reading for you   Kaizen  Japan no ego feedback   Based in the heart, but no magic      The Plan for the Plan\n Growing Up Cleaning Up Waking Up Showing Up Growing Up  Spiral dynamics New groups, new ways of organizing   Cleaning Up  Growth and healing mindset Healing our collective traumas  groups and individuals     Waking Up  reclaiming spirituality  ok if you don\u0026amp;rsquo;t yet feel comfortable with that   Not saints \u0026amp;ndash; a practice [TODO] word Integral joy!   Showing Up  Recognize the pain Step fully into the pain Awaken to something bigger   [TODO] Deadline  Global warming In denial of Can be a benefit Love for planet and future generations   Definition of success  Child focused Integral  Expand circle of compassion All of me, all of you, all of us   Joy  The deeper job  waking up early for a ski trip          Growing Up\n History  Ken Wilber, Integral theory Using original model My take …","date":1605724591,"description":"","lastmod":"2020-11-18T11:36:31-07:00","objectID":"b7d38220e85982123c5ca841015e3f6b","permalink":"https://cosmosgame.github.io/save-the-world/articles/","publishdate":"2020-11-18T11:36:31-07:00","title":"Index"},{"content":"More people should be aware of the open source movement. It is kind of a big deal. I\u0026amp;rsquo;ve been watching it with fascination from the beginning. In the 1990\u0026amp;rsquo;s it was not at all clear that it would end up completely conquering the world. But it did. Much of the software that you are using at this very moment is open source. It is built into the very foundations of the internet. Open Source out competed fierce capitalistic companies because it is a better way of collaborating. It is the only instance that I know of where communism won. No one owns open source software; people freely donate their time to it as a gift to the world. Ideas work best when they are free. And frameworks work best when many people have taken a serious look at them and offered improvements. But despite this idealism open source exists to be of use. Not all contributions are accepted. It is not like the wikipedia where there are endless, wasteful edit wars over controversial topics. Open source tends to avoid all that and stays focused on delivering value. And if it doesn\u0026amp;rsquo;t, some other open source project comes to replace it.\nOpen source does not have to be just for software. I propose that this plan to save the world should be an open source project. So how does that work? This website is hosted on Github, which is where many open source projects live. Every aspect of this site is open to inspection and review. Github supports this kind of collaboration through an intuitive interface. The Github UI is meant to be accessible even to people who are not strongly technical.\nThere are three main ways to interact with this site\nComments Please, please leave a comment below. Even just to say Hi. You have to create an account to do this, but that is to prevent bots from spamming the comments. My apologies for making you do that, but it is necessary. Unprotected websites get horribly spammed. And I hope you do register because I so want to hear your thoughts. This is the easiest level …","date":-62135596800,"description":"","objectID":"c1b931447957d82ff863106e4e4ff76a","permalink":"https://cosmosgame.github.io/save-the-world/open-source/","title":"Open Source"},{"content":"Let me start with a simple question. Why do we think the Civil War actually solved anything? Did that war really change hearts and minds? I don\u0026amp;rsquo;t think so. Not really. Imagine the end of the U.S. Civil War. The North has just crushed the South using brutal, total war: Sherman\u0026amp;rsquo;s March to the Sea. The South surrenders with the bitter realization that the North will stop at absolutely no unspeakable atrocity in order to totally crush them. And that truly may have been the only way to end the war. Imagine though that you are a slave owner that now has to free their slaves. Do you really awaken to your evil wickedness and acknowledge that the North was right all along? Of course you don\u0026amp;rsquo;t. I don\u0026amp;rsquo;t expect you to have sympathy at this point for the slave owner, but what about their children? Maybe you can find sympathy for them? They are growing up in a culture that teaches them a certain mindset. Why do we think that mindset would magically change? It didn\u0026amp;rsquo;t of course. Within twenty years after the war, Southern whites had regrouped and replaced the old system of slavery with a new form of economic slavery called share cropping. Yes, still better than actual slavery, but Blacks could not vote and still lived in oppression. This is the Authoritarian mindset. Why do we think that somehow this changes? How does that even work? So of course there is ongoing, systemic racism in the U.S.\nThose people proudly waving confederate flags carry almost the exact mindset of their ancestors. They are not stupid, they know exactly what they are celebrating, but they also don\u0026amp;rsquo;t consider themselves evil. We do of course, but they definitely don\u0026amp;rsquo;t. Interesting. OK, let\u0026amp;rsquo;s take one more step back. How did slavery even become a thing? It turns out that throughout history slavery was pretty common. Greece and Rome were slave empires. In a very real way the Authoritarian mindset of the Roman empire is still very much alive. Just look at all those …","date":-62135596800,"description":"","objectID":"38491ccace848b62e2bc16ae0d47a824","permalink":"https://cosmosgame.github.io/save-the-world/posts/civil-war/","title":""},{"content":"Orange to Green Crying Indian Commercial\n","date":-62135596800,"description":"","objectID":"23ba32c909e7ba49f57ccebd3668650f","permalink":"https://cosmosgame.github.io/save-the-world/posts/examples/","title":""},{"content":"Body-Centered Psychotherapy\n   Old paradigm New paradigm     fundamental separateness unbroken wholeness\nfundamental connectedness   absolute certitude\nonly matter is real (materialism) uncertainty, relativity\nconsciosness is real (dualistm, monism)   the mind/body split mind/body integration   biology is destingy we create our own destiny    ","date":-62135596800,"description":"","objectID":"aba5f3838288b8371ef5a9c7ab62c6fc","permalink":"https://cosmosgame.github.io/save-the-world/posts/hakomi/","title":""},{"content":"This is not done yet. Here is the outline of what I want to cover:\n Software engineer path  Radical truth  Running in debug mode Embrace when you are wrong Measuring   Learning to be wrong  It is a practice Needs to be supported OK to aspire to excellence anyways   Check your assumptions  debugging leads to this examine sources of truth   Dealing with complexity  simplify layers scrum  negotiating complexity not everyone has to be a software expert     Deep dive  Five whys Failure without blame Factoring in that humans are failable   Flow  Cure for sensitivity -hiding out in crystalline forests Teaches possibility of joy  joy based life     Request For Comments (RFC) Models Open source  Shared libraries Forking Not all opinions are equal      ","date":1599434191,"description":"","lastmod":"2020-09-06T16:16:31-07:00","objectID":"ee67c5fa00ce0b4e1f6035527720bb59","permalink":"https://cosmosgame.github.io/save-the-world/posts/programmers-path/","publishdate":"2020-09-06T16:16:31-07:00","title":"Programmers Path"},{"content":"I love movies where the reluctant heroes are desperately trying to save the world against what seem impossible odds. First they overcome their fears and limitations, and then they commit. Then they work through their bitter squabbles and commit to each other. I want to be like them. I\u0026amp;rsquo;m hoping you do too, because the world is in desperate need of heroes right now.\nPolice kill black men seemingly at will. Large parts of the population seem to be indifferent to the needless deaths and suffering of a million people. And it gets worse. Global warming is here and we are burning. Species are dying in numbers we can barely comprehend. In our children\u0026amp;rsquo;s lifetimes it is possible large parts of the planet might become uninhabitable. If we don\u0026amp;rsquo;t make drastic changes, it is possible that billions of people will die. Seriously.\nStill with me? I don\u0026amp;rsquo;t blame you if your first instinct is to stop reading. If you let yourself really consider how bad things could get it is just too overwhelming. Billions of people dying? Surely that is hysterical hyperbole? It is just too much. Sadly it is a real possibility.\nThere is Hope But please know this. There is hope. Really and truly. It is not going to be easy of course. It never is in dire situations like this. And unlike the movies there is no guarantee that everything will work out in the end. But I wouldn\u0026amp;rsquo;t be writing this if I did not truly believe there is hope.\nAgain it is not going to be easy. No heroic journey ever is. Are you willing to at least start? The very first step is to embrace the pain. Really let yourself feel how awful this is. Yuck! Why would you want to do that? Because with pain comes a precious gift \u0026amp;ndash; the energy to do whatever it takes to get out of that pain. The bigger the pain the bigger the gift that comes with it. Think about times in your life when something hurt so bad that you just had to make a drastic change. That pain gave you the energy to make a change you might not …","date":1599434191,"description":"","lastmod":"2020-09-06T16:16:31-07:00","objectID":"6d2f71d94c1faa6e60c4af21ce1d33ef","permalink":"https://cosmosgame.github.io/save-the-world/posts/save-the-world/","publishdate":"2020-09-06T16:16:31-07:00","title":"Save the World"},{"content":"This site is meant for people who are excited by the bigger dream of what we are all collectively waking up to. Waking up to finding their bigger purpose of service. Service coming not from a place of self-sacrifice but instead from listening to the call for the deeper joy that is struggling to be born but needs some midwives. Please join me. I can\u0026amp;rsquo;t do this alone.\n","date":-62135596800,"description":"","objectID":"0081eeab87f442e647e37a30ddb3d321","permalink":"https://cosmosgame.github.io/save-the-world/posts/snippets/","title":""},{"content":"Stone Soup \u0026amp;ndash; stone soup text goes here \u0026amp;mdash; edited\n","date":1606327471,"description":"","lastmod":"2020-11-25T10:04:31-08:00","objectID":"2fd043563f0da3a242fd1a778591cba4","permalink":"https://cosmosgame.github.io/save-the-world/posts/stone-soup/","publishdate":"2020-11-25T10:04:31-08:00","title":"Stone Soup1"},{"content":"During the Trump presidency it felt like political commentators were crashing around their bedroom at night trying to get to the bathroom. Not really recognizing what they were bumping into. For example many focused too much on Trump without realizing he just represented the yearning of a huge number of Americans. Many others viewed him as a uniquely American problem, and failed to see that there has been an absolute plague of Authoritarian governments in the world recently. Others only focused on recent events without realizing that this is an age old problem. It turns out that it is rare for a democracy to not succumb to Authoritarianism collapse at some point. And even more failed to recognize that this authoritarian mindset has been with us from the very beginnings of recorded history.\nWe need to stop and take the time to turn on the light and see where we are. What exactly are we bumping into? We see this Authoritarian mindset, are there other mindsets that are also driving the world? We need a map. If we truly want to succeed in winning hearts and minds we need to meet people where they actually are not where we think they should be. In my experience telling people that they are stupid and evil just has not been an effective way to get them to change. Have you had a different experience? This is where theory and models can help. We need a better understanding of why people do what they do. We need to bring our thinking minds in and go much deeper than we have.\nLater on I\u0026amp;rsquo;m going to introduce a theory called Spiral Dynamics which has a very powerful explanation for much that we see in the world. It lets us understand people without resorting to just calling them stupid and evil. But right here I want to focus on the need for some theory period. Here are a few examples of questions any theory we adopt would have to help us answer:\n","date":-62135596800,"description":"","objectID":"ddf346486995e816f1970d42e8533860","permalink":"https://cosmosgame.github.io/save-the-world/posts/trump/","title":""},{"content":"But first we need a plan. Our current approach is not working. There are many things not working, but let me focus on climate change because it is a huge problem. Emissions keep on going up. World wide agreements are made, but never for enough and emissions keep on going up. Environmentalists pin their hope on elections but then the other party gets elected and dismantles previous work. And emissions keep on going up.\nWhy don\u0026amp;rsquo;t they get the importance of climate change? How can they not understand how important this is? Or if they do understand why is it not more of a priority? What can be more important than saving the world? If a meteor was on a collision course with the earth surely that would capture people\u0026amp;rsquo;s attention, so why not this?\nI have an explanation, but first let\u0026amp;rsquo;s start with an experiment. Take a moment to get settled and become aware of what is going on for you. Maybe take a breath, relax and pause for a moment here. Then when you are ready read the next sentence, and pay really close attention to what happens for you.\nThe very worst part of the climate change disaster is probably eighty or more years away.\nNow be honest with yourself. Doesn\u0026amp;rsquo;t that ease your concern at least a little? Eighty years is an awfully long time away, and most of us won\u0026amp;rsquo;t be alive then. But then you might argue that even right now we are suffering the effects of climate change. True the danger of billions of people dying is a long way off, but there is plenty of suffering to worry about in our immediate future. Yes, but now notice again how it feels when I reframe the above statement and say that billions might die in our children\u0026amp;rsquo;s life time. Notice how that feels different. It feels different because I have brought the issue closer into your sphere of compassion.\nWe all have spheres of compassion. The things in our inner sphere are the things we care most about and will protect. Typically your family is in this inner sphere. Then there …","date":1599434191,"description":"","lastmod":"2020-09-06T16:16:31-07:00","objectID":"516d4f7369653d2fe1cbecbefc66d823","permalink":"https://cosmosgame.github.io/save-the-world/posts/we-need-a-plan/","publishdate":"2020-09-06T16:16:31-07:00","title":"Spheres of compassion"},{"content":" Color Nickname Social construct Cause worth dying for  Beige FirstAwakening Family and Kin My family  Purple KinSpirits Tribe The sacred ground  Red PowerGods Kingdoms, Empire My king. Honor  Blue TrueBlue Church, Schools The Truth  Orange StriveDrive Capitalism, Democracy, and Science Give me liberty or give me death  Green HumanBond unions, environmentalism, feminism, racial justice, LGBTQ, et. al For my brothers and sisters  Yellow Second Awakening Integral Theory, personal growth movement, medicine movement A life worth living  Turqoise PromisedLand Just starting to emerge Save the world   Spiral Dynamics is based on the research of the psychologist Clare Graves who was a contemporary of Abraham Maslov. Both of whom were exploring all the stages of human development from the highest and lowest. Clare Graves\u0026amp;rsquo;s health started to fail before he could fully develop his theory but his work was carried on by his younger colleagues Don Beck and Chris Cowan. They took Grave\u0026amp;rsquo;s original theory and made it more accessible by adding things like color mnemonics. Ken Wilber took the theory and added it to his Integral Theory. He later on modified it to reflect his focus on individual, spiritual growth which is a different focus. I don\u0026amp;rsquo;t cover his variations on the theory here because I am more interested in focusing on the social applications. Although Spiral Dynamics is about individual developmental levels, from the very beginning it also has been applied to groups and organizations. Don Beck made many trips to South Africa to try and put Spiral Dynamics to practical use during the transition from Apartheid. He saw how this theory could transform the world. It is that focus that I am most interested in here.\nHere is what I love about Spiral Dynamics:\n  It helps us understand why \u0026amp;ldquo;those\u0026amp;rdquo; people act as they do. Depending on what developmental level you are on, the world looks very different. To \u0026amp;ldquo;those\u0026amp;rdquo; people\u0026amp;rsquo;s point of view …","date":-62135596800,"description":"","objectID":"0705ea017d4013b0b826a613c19f3ccd","permalink":"https://cosmosgame.github.io/save-the-world/spiral-dynamics/","title":"Spiral Dynamics"},{"content":" Color Nickname Social construct Cause worth dying for  Beige FirstAwakening Family and Kin My family   In the very beginning, our ancestors somehow had the first awakening. We stepped into a level of consciousness higher than other animals. Imagine a caveman dad sitting on a rock with his son looking up at the full moon. The son says \u0026amp;ldquo;Dad, what is that?\u0026amp;rdquo;, And the dad says, \u0026amp;ldquo;I don\u0026amp;rsquo;t know. We call it the moon\u0026amp;rdquo; And both feel the awe and wonder of the world and their place in it. This is where it all started. We have been using fire and primitive tools for maybe a million years. We don\u0026amp;rsquo;t know when we started to use language and when we first awoke to I, You, and Us. But awaken we did. We now had a higher vantage point of consciousness. Something different than other animals.\nThis is my favorite stage. It is a reminder that we at our core are animals. Thinking animals, yes, but always and forever animals. Here we revel in the delights of our bodies and feel at one with our world. This is what I strive to return to when I go backpacking. We are meant to be part of nature not separate from it. There is a powerful spirituality in simply fully letting in the beauty of the world. This is the level with the best sex \u0026amp;ndash; primal and in the moment. This is where we go when we sit in front of a fire in the dark with friends and family and tell stories. This is the place we return to when we fully surrender to sweaty ecstatic dance.\nWe find that when doing the deep work of healing our traumas that it has to start here. In the body. The body keeps the score. Animals like deers, instinctively know that when something traumatic happens, like getting chased by a mountain lion, they have to take a moment and shake it off. The body has a deep wisdom of its own. But what a miracle to find a conscious mind inside our bodies. What a delicious thing it is to look out at the world and be a part of it yet separate.\nThere seems to be a longing in modern …","date":-62135596800,"description":"","objectID":"91e662368030406a93d69c48272d2ade","permalink":"https://cosmosgame.github.io/save-the-world/spiral-dynamics/beige/","title":"Beige"},{"content":" table tr#Blue td {background-color:#00BFFF !important;}   Color Nickname Social construct Cause worth dying for  Blue TrueBlue Church,Schools The Truth   There is a Truth that is eternal and greater than us. This is what we wake up to in the Blue level. We surrender to something bigger than us. And that surrender brings a profound, sweet purpose and meaning to life. Before this, Truth was localized. Whoever had the most power and authority determined what Truth was. Now Truth is recognized as eternal and one.\nGod is one path to this Truth, but not the only way. Buddha woke up under a Bodhi tree just as himself, not a god. He taught a practical path to enlightenment that anyone willing to do the work can follow. Plato based his work on the very Blue notion that the world is just a shadowy reflection of the ideal. The Greeks had no shortage of eloquent smart thinkers, but when those thinkers only focused on selfish, individual ends they just ended up with sophistry. Nothing useful could be built on that. Plato and Aristotle gave the world a glimpse of what is possible when you base your ideas on the foundation of Truth. Science needs this level first before it can flourish.\nAnd then there was Christ. Imagine his time. Rome was confidently in charge of its brutal slave empire. And the people suffered. Christianity has a lot to answer for, but consider what happened at the very, very beginning of this religion. Some how, some way this man inspired a revolution that spread throughout the Western world. Women and slaves were recognized as beloved of God. Might makes right was no longer the highest truth. The cross which was a torture device used to keep people in line instead became a defiant symbol of redemption. What an incredibly sneaky but powerful way to revolt against the empire! No armies were needed. Instead people were ready and willing to die for a belief. And the world was changed.\nMohammed is a similar story. Just like Christ he went into the wilderness to …","date":-62135596800,"description":"","objectID":"f9fc38ffcba6f2f890974b281bb69c58","permalink":"https://cosmosgame.github.io/save-the-world/spiral-dynamics/blue/","title":"Blue"},{"content":" table tr#Green td {background-color:#228B22;}   Color Nickname Social construct Cause worth dying for  Green HumanBond unions, environmentalism, feminism, racial justice, LGBTQ, et. al For my brothers and sisters   The genius of Martin Luther King\u0026amp;rsquo;s I have a dream speech is that it builds on the (Orange) words of the Declaration of Independence and brings us forward into a new stage, Green.\n \u0026amp;ldquo;I have a dream that one day this nation will rise up and live out the true meaning of its creed - we hold these truths to be self-evident: that all men are created equal.\nI have a dream that one day on the red hills of Georgia the sons of former slaves and the sons of former slave-owners will be able to sit down together at a table of brotherhood.\n  \u0026amp;hellip;\n  And when this happens, when we allow freedom to ring, when we let it ring from every village and every hamlet, from every state and every city, we will be able to speed up that day when all of God\u0026amp;rsquo;s children, black men and white men, Jews and Gentiles, Protestants and Catholics, will be able to join hands and sing in the words of the old Negro spiritual: \u0026amp;ldquo;Free at last! Free at last! thank God Almighty, we are free at last!\u0026amp;rdquo;\n Notice how he bring us back together to our shared humanity. Our deeper freedom arises from coming together not splitting apart. This realization was the start of so many important awakenings. The environmental awakening. We commit to cherish, honor, and protect our mother earth. The feminist awakening. Time to break free of our sexist stereotypes and limits. The peace awakening. No more mindless wars. The race awakening. We recognize how deeply racist our society is and we commit to healing this broken mindset. Later on \u0026amp;ndash; this one took much longer \u0026amp;ndash; we started to embrace the LGBTQ community and the full continuum of our sexuality.\nAt this stage we start to realize that the Rational mind is not the sum total of Truth. Just because the detached observer mode …","date":-62135596800,"description":"","objectID":"568aefc2d1e9dd480e69e8ab81f8f646","permalink":"https://cosmosgame.github.io/save-the-world/spiral-dynamics/green/","title":"Green"},{"content":" Color Nickname Social construct Cause worth dying for  Orange StriveDrive Capitalism, Democracy, and Science Give me liberty or give me death   The Japanese were confronting the technological results of The Age of Englightenment. This was a turn away from the church and God towards looking for the Truth within. From this stage emerged modern science, capitalism, and democracy. America\u0026amp;rsquo;s Declaration of Independence is a quintessential expression of Orange:\n \u0026amp;ldquo;We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness\u0026amp;rdquo;\n Self-evident means that when you introspect on it, it becomes clear that it is true. Math proofs are meant to be self-evident. This was the age of Reason. Notice how this puts the source of Truth back in the individual. The purpose of life is now not focused on God but instead the pursuit of happiness. And we need our liberty (freedom) to go and do that. Both free market capitalism and democracy trust the wisdom of the crowd to get us to the best answers. This was a very radical idea at the time, and yet it has worked out surprisingly well. Markets do seem to be a much better mechanism than command economies and democracy is a much better governing system than all the alternatives.\nSo when those American Black ships steamed into Tokyo, Japan was faced with a stark choice. Stay Blue and inevitably become some western (Orange) country\u0026amp;rsquo;s helpless colony, or make the switch to Orange. Japan chose to make the switch. This was a remarkable period of time called the Meiji era. Japan is the only non-western country that I am aware of that avoided colonization. It was maybe a century behind technologically, but because of all those years of peace and prosperity it had a strong cohesive base to build on. Remember up till now almost no Japanese had ever left the country (or if they had, they …","date":-62135596800,"description":"","objectID":"efce0707ebc0a2c0e285e818f129cbb1","permalink":"https://cosmosgame.github.io/save-the-world/spiral-dynamics/orange/","title":"Orange"},{"content":"Theory is a great place to start, but how do we put this one to use? I think Valerie Kaur\u0026amp;rsquo;s Revolutionary Love Project is a great example of Spiral Dynamics can be put into practice.\nI would appreciate it if you would take the time to watch her Ted talk. It is a great review of everything I have talked about so far. She probably is unaware of Spiral Dynamics simply because it is still not a well known theory, but that doesn\u0026amp;rsquo;t matter because she definitely makes skillful use of all the color levels.\nSee if you can recognize all the different color levels that come out in her talk:\n  She starts out with the pain of giving birth. And her family is there with her; primal, intense Beige. She has a vision of all the mothers who gave birth before, supporting her in a long line; perfect Purple. Her Grandfather admonishes her to be a warrior. \u0026amp;ldquo;You will not abandon the fight. Don\u0026amp;rsquo;t abandon your post\u0026amp;rdquo;; healthy Red. She talks about how her Sikh religion has guided her; beautiful Blue. She talks a little about how the lawyer part of herself is a little uncomfortable with all this love talk; classic Orange She talks about her social justice work; amazing vibrant Green She talks about her inner work of learning to love herself; awakening Yellow And then she looks up and out to call all of us to join her; triumphant Turqoise\n","date":-62135596800,"description":"","objectID":"663dc3ccda37782527400dddf3b9dd30","permalink":"https://cosmosgame.github.io/save-the-world/spiral-dynamics/practical/","title":"Spiral Dynamics in Practice"},{"content":" Color Nickname Social construct Cause worth dying for  Purple KinSpirits Tribe The sacred ground   Something amazing happened about 30,000 to 40,000 years ago. We see it in the cave paintings of the time. When we stop and really look at this powerful art we can not help but be moved. These people were just like us. This was clearly the next step up in consciousness. From smallish bands we formed bigger tribes and we became bad-asses. Human population numbers started to grow and we spread out across pretty much all of the planet. Starting from this time the populations of bigger animals like Mastodons crashed. Presumably because we hunted them to death.\nAnd spirit became the center of our lives. Spirit of place, animal, and ancestors. Deep magic lives in the sacred places. Animal spirits and our ancestors are here to guide us, if only we can get quiet enough and reverent to hear them. We fast and pray for days. Then head off alone into the wilderness to do our sacred initiation rite and face our internal demons. Then we return to the wild celebration of the tribe. You are back! We are so glad you are back! We are one. Tell us of your visions so that we may all learn from the spirits. You are home. You are loved. So deeply loved.\nPurple throws the best parties. It is a big part of the draw of the hippies in the 60\u0026amp;rsquo;s. From all accounts Woodstock was very Purple. We tend to idolize this stage, but movies like [Dances With Wolves[(https://www.imdb.com/title/tt0099348/)] do catch an important historical point. Colonists \u0026amp;ldquo;kidnapped\u0026amp;rdquo; by Native Americans almost never wanted to return when given the opportunity. The Native Americans living mostly at Purple were living a much richer, more satisfying life.\nThis is the stage when art and religion really took off. We started to awaken to a higher purpose than just the day to day cycle of survival. We turned to each other and found we share an even bigger mystery than individual consciousness \u0026amp;ndash; shared …","date":-62135596800,"description":"","objectID":"94ea096d8ba84f9926c8f702fa1530b6","permalink":"https://cosmosgame.github.io/save-the-world/spiral-dynamics/purple/","title":"Purple"},{"content":" Color Nickname Social construct Cause worth dying for  Red PowerGods Kingdoms,Empire My king. Honor   Archeological records show that the first agricultural communities continued the egalitarian traditions of hunter gatherers. Everyone was (mostly) equal still. But populations shot up at this point and things started to get much more complicated. We stratified into layers of society. And then a new thing arose. We chose to become as Gods.\nThis is the stage of empire. This is the stage of Alexander the Great, Genghis Khan, and Columbus. Rome was a very Red empire. It is important to realize that this is all we knew at the time. Our modern morality was not yet formed \u0026amp;ndash; it was natural and right that the strong governed the weak. Alexander is remembered as a \u0026amp;ldquo;great\u0026amp;rdquo; man, but by today\u0026amp;rsquo;s standards he would be considered a murdering lunatic. The Roman empire by today\u0026amp;rsquo;s standards was a hopelessly evil slave empire. Genghis Khan by all accounts was a self-actualized guy who achieved his biggest dreams. Too bad about all those millions his troops killed. But here is the most important point. Genghis and his tribe did not consider themselves evil. They were just doing better what other people (like the Crusaders for example) would have done if only they had the martial excellence. They considered themselves the good guys.\nThere is of course a real darkness here. Pharaohs mercilessly drove countless suffering slaves to build the towering pyramids in order to celebrate their godhood. Brutal wars of conquest swept across the known world. Wealth and power went to the very top and if you were in the vast bottom your average life span went way down. Much of the suffering of the world still comes from this stage of thinking. And yet. We would become as Gods! Without this stage we would not have gone from from looking up in wonder at the moon, to landing on it and driving around in a go-kart. Think of what we are most proud of as a species \u0026amp;ndash; …","date":-62135596800,"description":"","objectID":"6db841b04e627b76f902f08a47aa9445","permalink":"https://cosmosgame.github.io/save-the-world/spiral-dynamics/red/","title":"Red"},{"content":" Color Nickname Social construct Cause worth dying for  Turqoise PromisedLand Just starting to emerge Save the world   We have not been in Yellow that long and yet I find myself already longing for the next level, Turqoise. After finding our vast strength in Yellow we start to really open up to all that is. And it hurts. Really hurts. The world is suffering in so many needless ways. My deepest desire is to help the world out of that suffering. As someone who is stepping into the Grandfather stage of his life, I am committed to leaving a safer world for all the grandchildren. I can\u0026amp;rsquo;t do it alone. I will need the help of many, many others. My wild hope is that after people have found their individual strength in Yellow they will then find they are up for the challenge of healing this world. And next they will look up and out to others and realize that we need a really big tribe to make this happen.\nWe don\u0026amp;rsquo;t really know yet exactly what Turquoise is going to look like. But we do have the pattern of what has happened up to now to give us some important clues. We know that this level will be the (tock) return to community. And just like Yellow is a hectave above Beige and revisits that level, Turquoise is a hectave above Purple. We will know Turquoise is here when people start to hold awesome, amazing parties. Burning Man might be an early example of that. Just like Purple was the start of religion, Turquoise almost certainly will see the rebirth of a new enlightened form of religion. It will be a practice of spirit that deeply nourishes and strengthens us. And we will become bad-asses once more.\nI find it incredibly hopeful that this level is awakening exactly at the critical point where humanity chooses to either flourish or collapse. We have a choice. We already have enough food to feed the world, but we choose not to. We already have enough medicine to heal all the world\u0026amp;rsquo;s sick, but we choose not to. We already have the technology to completely stop …","date":-62135596800,"description":"","objectID":"d25f6e4c265da834efc2d225b6f876d8","permalink":"https://cosmosgame.github.io/save-the-world/spiral-dynamics/turquoise/","title":"Turquoise"},{"content":" Color Nickname Social construct Cause worth dying for  Yellow SecondAwakening Integral Theory, personal growth movement, medicine movement A life worth living   At some point we need to turn back to ourselves to find the Truth of things. We have absorbed the lessons of Green, and yet we need more. Green by itself won\u0026amp;rsquo;t get us to the healing we need. Green by itself won\u0026amp;rsquo;t heal the world. People insist on going their own selfish ways no matter how patiently we explain to them how stupid and evil they are. Then we try a little louder and slower, like you might to someone who does not speak English well. You. are. stupid. And. Evil! Huh. Still not working. YOU. ARE. STUPID. AND. EVIL!! How can they not understand that?!? Why don\u0026amp;rsquo;t they understand how stupid and evil they are?!? Maybe we are missing something? Perhaps there is a deeper level to go here? Maybe just maybe there is something more workable than dividing the world up into good and evil? But to convince you of that I need for you to go very deeply into yourself. Kind of like an odyssey of the soul. It can be a bit scary and painful, but there is also wonder and joy here. It feels like Odysseus cutting his ropes and jumping off the ship to join the Sirens, curious to know if maybe there is another world that comes after dying in this one.\nAnd after we come up for air we are awakening all over again. Just like at the very beginning when we were staring in awe at the moon (Beige level) and looking around at a world both separate and part of us, in this Yellow stage we awaken to that very same thing but this time at an even deeper level. Because this time we have the lived experience of so many previous generations. There are so many ways to be human. And we welcome all of ourselves. Not just the bright pretty parts but the scary dangerous parts as well. Not just the perfect (and yes we welcome our own perfection!) but also the broken and hurting parts as well. All of us. The mother, shaman, …","date":-62135596800,"description":"","objectID":"60cb701408ca78ca2b424923f5ea2e89","permalink":"https://cosmosgame.github.io/save-the-world/spiral-dynamics/yellow/","title":"Yellow"},{"content":"Mr. Roger\u0026amp;rsquo;s Neighborhood Let\u0026amp;rsquo;s start. May I have your permission to dream with me? Dream way, way, way bigger than we normally do? OK? Here is my question: What do you really want. I mean really. Yes, yes you can have a billion dollars \u0026amp;ndash; boom \u0026amp;ndash; now keep on going deeper. This is a dream after all so you can have anything. What do you want beyond just the personal stuff? Maybe happiness for others? How about living in a world of joy for all? Wait, you can imagine a billion dollars but not that? Stay with me here.\nI\u0026amp;rsquo;m very clear on what I want. As I awaken spiritually my heart keeps wanting to expand yet ever a little bigger and as it expands I start to really feel the suffering of the world. And I weep. I long for the world to heal. It is what I want very most. Truly. But I confess it can feel so impossible. As if I\u0026amp;rsquo;m asking for too much. It initially was hard for me to even visualize exactly what a healed world would look like. What to do? I very much want this. It is starting to be the basis of everything for me, and yet I find myself holding back.\nWait. I really do know the answer and I bet you do too. Here is a hint \u0026amp;ndash; look to the children. I love my children with all my heart and want the world for them. And in fact I want the world for all children. Even if you don\u0026amp;rsquo;t have children, hopefully you can feel that too. So for them? yes, with all my heart I can ask for a better world. I want an amazing, vibrant world for them. It is hard to ask for this myself, but so simple to ask on their behalf. So maybe it really is that simple. Just let our children guide us. What kind of world works best for raising children? Focus on that. What horrible secrets are we keeping from our children? Get rid of that. And better yet, someone has already created a concrete vision of this world, so I don\u0026amp;rsquo;t have to. It is called Mr. Roger\u0026amp;rsquo;s neighborhood. Sesame Street also works, but recently a great documentary and movie about …","date":-62135596800,"description":"","objectID":"82a3c96cf09a4b36c283afafa5de8c55","permalink":"https://cosmosgame.github.io/save-the-world/the-dream/","title":"The Dream"},{"content":"Before diving into the specifics of the plan, let me briefly go over an overview of what I am proposing.\nThe Goal First we need to be clear on where we are going. What do we truly want for this world? What would light us up all the way? I suggested earlier that we don\u0026amp;rsquo;t have to overthink this. Let the children guide us. And in particular, let our inner child guide us. We already know what we dream for the world, we just have to dare to believe it is possible. On some beautiful day the world is going to wake up in love and joy. But we can\u0026amp;rsquo;t just jump straight there from where we are now. This is where the work is.\nThe Five Whys I don\u0026amp;rsquo;t think that we can get to the world we want by continuing to do what we are doing now. Some major shifts are going to have to happen. How do you solve a difficult, challenging problem? Look deeper. This is where my engineer self comes into play. Engineers are trained to look at problems in a deeper way. Let me give you an example.\nSoftware engineers truly hate getting woken up at 3am to solve a service outage. So we are highly motivated to do whatever it takes to make sure that does not happen again. At my company whenever a bad outage happens we initiate an inquiry process called \u0026amp;ldquo;The Five Whys\u0026amp;rdquo;. This process simply asks \u0026amp;ldquo;why\u0026amp;rdquo; five times, but each time the \u0026amp;ldquo;why\u0026amp;rdquo; is at a deeper level. We first look at the very topmost \u0026amp;ldquo;why\u0026amp;rdquo;. Why did we have the outage? Maybe a specific sub-system stopped working. OK, simple enough, but then we ask \u0026amp;ldquo;why\u0026amp;rdquo; again. Maybe a node in that sub-system went down. Getting a little deeper now, but again we ask \u0026amp;ldquo;why\u0026amp;rdquo;. Why did just one node going down bring down the sub-system? Maybe it turns out no one thought to test what happens when a node goes down. Now we are deeper yet, but again we ask \u0026amp;ldquo;why\u0026amp;rdquo;. Maybe we did not have a properly thought out testing plan. Getting close now, but there is still another …","date":-62135596800,"description":"","objectID":"ebc09cbc7708a57e5096e728f9313ed9","permalink":"https://cosmosgame.github.io/save-the-world/the-plan/","title":"The Plan"},{"content":"Before I go into my proposed plan, I think it is useful maybe even necessary to talk a little about myself first. Who is this person dreaming such a big dream? What particular viewpoint am I coming from?\nI\u0026amp;rsquo;m a 58 year old white male living in the Bay Area. I have two kids (Ulysses and Jaiya) from separate marriages and they are the world to me. I\u0026amp;rsquo;ve been a software programmer most of my life, and I love programming. I\u0026amp;rsquo;m book smart so I did well academically. I am a seeker of Truth. When I was younger I was in a lot of pain. The way I found myself out of that pain was doing intensive personal growth workshops. It was the only thing that seemed to work. I tried a few Freudian psychiatrists but their approach seemed (and still does frankly) like mostly nonsense. So personal growth workshops it was. And I did a lot of them. The month of my 50th birthday I did a particularly powerful workshop and I stepped into a lot of joy. I finally committed to fully loving myself and others. It was big step deeper into an ongoing spiritual awakening, and brought me into a new phase of my life. Suddenly it was easy to lose weight because that was the most loving thing to do for myself. And then a few years later I did psychedelic Medicine work and went into even deeper joy. Now that I am mostly out of pain, my focus has shifted to service. I want to help people not just find their way out of pain, but into their own joy. It is right there waiting for all of us. Just begging to be let in. Somehow, someway I want to help that happen. After taking a number of trainings I am just now embarking on a side practice as Medicine guide. I am also deepening my meditation practice and after some more trainings I would like to teach Mindful Self Compassion.\nAnd then there is my spiritual awakening. People who really know me describe me as very love based. I find that description astonishing. It is true, but it is kind of like saying I am very oxygen based. Of course I am oxygen …","date":-62135596800,"description":"","objectID":"54c190213315e14dc83a78c5414e2552","permalink":"https://cosmosgame.github.io/save-the-world/who-am-i/","title":"Who Am I?"}]