[{"content":"Welcome! ","date":1606510504,"description":"","lastmod":"2020-11-27T12:55:04-08:00","objectID":"3976528693a0108357f4928017600865","permalink":"https://example.com/","publishdate":"2020-11-27T12:55:04-08:00","title":"Welcome"},{"content":" Home  Welcome and thanks there is hope  theory advances psychological advances medicine advances spiritual advances     The dream  Mr. Roger\u0026amp;rsquo;s neighborhood  we already know let the children guide us   Big dream  New groups Not saints \u0026amp;ndash; a practice Spiritual awakening  joy!     Same goal Deadline Generational trauma  protect the children   All of us  Integral Love     Who am I  All of me Software engineer path (very brief version)  Radical truth  Running in debug mode Embrace when you are wrong   Deep dive  Five whys   Models Open source   Personal growth Spirit   Stone soup  Stone soup story First steps  Believe it is possible Believe we are worthy of a bigger dream Practical plan   I need your help RFC Open Source  Shared libraries Forking Copyright     The Plan  Definition of success  All of Us Joy   Need for models  Challenger disaster  Sneaky switch   Beyond stupid and evil   Overview  Patterns of history: What wants to happen next Reclaiming spirituality     Patterns of history  Spiral Dynamics  History  My take \u0026amp;ndash; social constructs Beige Purple  Spirit   Red  Empire  Alexander the Great, Attilla the Hun Columbus   Olympics  personal excellence     Blue  Jesus and Mohammed Neo Confucianism  Attilla goes from red to blue   Martin Luther King and Gandhi   Orange  Enlightenment Black ships   Green  Reaction to Reason Hakomi principles Difference between Blue   Yellow  Hakomi HAI Medicine  How to change your mind  Michael Pollan needed green to get here     Maps example   Turquoise  Showing up     Tick-Tock  Oscillation America doesn\u0026amp;rsquo;t get group focus  My Japan experience (?)       The Hope of Turquoise  What wants to happen next Embrace all colors Come together Spirit transcends     Reclaiming Spirituality  What has worked in the past?  Gandhi Martin Luther King Christian awakening Moslem awakening   Spiritual impoverishment How do we know what is true? Quadrants  UR UL LR LL Quadrant myopia  UL UR LR LL   Embrace all quadrants  Tale of two …","date":1605724591,"description":"","lastmod":"2020-11-18T11:36:31-07:00","objectID":"b7d38220e85982123c5ca841015e3f6b","permalink":"https://example.com/articles/","publishdate":"2020-11-18T11:36:31-07:00","title":"Index"},{"content":"I love movies where the reluctant heroes are desperately trying to save the world against what seem impossible odds. First they overcome their fears and limitations, and then they commit. Then they work through their bitter squabbles and commit to each other. I want to be like them. I\u0026amp;rsquo;m hoping you do too, because the world is in desperate need of heroes right now.\nPolice kill black men seemingly at will. Large parts of the population seem to be indifferent to the needless deaths and suffering of a million people. And it gets worse. Global warming is here and we are burning. Species are dying in numbers we can barely comprehend. In our children\u0026amp;rsquo;s lifetimes it is possible large parts of the planet might become uninhabitable. If we don\u0026amp;rsquo;t make drastic changes, it is possible that billions of people will die. Seriously.\nStill with me? I don\u0026amp;rsquo;t blame you if your first instinct is to stop reading. If you let yourself really consider how bad things could get it is just too overwhelming. Billions of people dying? Surely that is hysterical hyperbole? It is just too much. Sadly it is a real possibility.\nThere is Hope But please know this. There is hope. Really and truly. It is not going to be easy of course. It never is in dire situations like this. And unlike the movies there is no guarantee that everything will work out in the end. But I wouldn\u0026amp;rsquo;t be writing this if I did not truly believe there is hope.\nAgain it is not going to be easy. No heroic journey ever is. Are you willing to at least start? The very first step is to embrace the pain. Really let yourself feel how awful this is. Yuck! Why would you want to do that? Because with pain comes a precious gift \u0026amp;ndash; the energy to do whatever it takes to get out of that pain. The bigger the pain the bigger the gift that comes with it. Think about times in your life when something hurt so bad that you just had to make a drastic change. That pain gave you the energy to make a change you might not …","date":1599434191,"description":"","lastmod":"2020-09-06T16:16:31-07:00","objectID":"6d2f71d94c1faa6e60c4af21ce1d33ef","permalink":"https://example.com/posts/save-the-world/","publishdate":"2020-09-06T16:16:31-07:00","title":"Save the World"},{"content":"But first we need a plan. Our current approach is not working. There are many things not working, but let me focus on climate change because it is a huge problem. Emissions keep on going up. World wide agreements are made, but never for enough and emissions keep on going up. Environmentalists pin their hope on elections but then the other party gets elected and dismantles previous work. And emissions keep on going up.\nWhy don\u0026amp;rsquo;t they get the importance of climate change? How can they not understand how important this is? Or if they do understand why is it not more of a priority? What can be more important than saving the world? If a meteor was on a collision course with the earth surely that would capture people\u0026amp;rsquo;s attention, so why not this?\nI have an explanation, but first let\u0026amp;rsquo;s start with an experiment. Take a moment to get settled and become aware of what is going on for you. Maybe take a breath, relax and pause for a moment here. Then when you are ready read the next sentence, and pay really close attention to what happens for you.\nThe very worst part of the climate change disaster is probably eighty or more years away.\nNow be honest with yourself. Doesn\u0026amp;rsquo;t that ease your concern at least a little? Eighty years is an awfully long time away, and most of us won\u0026amp;rsquo;t be alive then. But then you might argue that even right now we are suffering the effects of climate change. True the danger of billions of people dying is a long way off, but there is plenty of suffering to worry about in our immediate future. Yes, but now notice again how it feels when I reframe the above statement and say that billions might die in our children\u0026amp;rsquo;s life time. Notice how that feels different. It feels different because I have brought the issue closer into your sphere of compassion.\nWe all have spheres of compassion. The things in our inner sphere are the things we care most about and will protect. Typically your family is in this inner sphere. Then there …","date":1599434191,"description":"","lastmod":"2020-09-06T16:16:31-07:00","objectID":"516d4f7369653d2fe1cbecbefc66d823","permalink":"https://example.com/posts/we-need-a-plan/","publishdate":"2020-09-06T16:16:31-07:00","title":"Spheres of compassion"},{"content":"index page stuff here\n","date":1508253975,"description":"","lastmod":"2017-10-17T15:26:15Z","objectID":"439680883c1b56d1b134767b123ba4a4","permalink":"https://example.com/stone-soup/","publishdate":"2017-10-17T15:26:15Z","title":"Stone soup"},{"content":"Stone Soup \u0026amp;ndash; stone soup text goes here \u0026amp;mdash; edited\n","date":1606327471,"description":"","lastmod":"2020-11-25T10:04:31-08:00","objectID":"a23185fd886f057940397cf65cc6f0c6","permalink":"https://example.com/stone-soup/stone-soup/","publishdate":"2020-11-25T10:04:31-08:00","title":"Stone Soup1"},{"content":"welcome index page stuff here\n","date":1508253975,"description":"","lastmod":"2017-10-17T15:26:15Z","objectID":"13078024304187af879d3faeabcc8cae","permalink":"https://example.com/welcome/","publishdate":"2017-10-17T15:26:15Z","title":"Welcome"},{"content":"Welcome! 2 ","date":1606327471,"description":"","lastmod":"2020-11-25T10:04:31-08:00","objectID":"11a8f9be7d8c38f16f9381114394dea9","permalink":"https://example.com/welcome/welcome/","publishdate":"2020-11-25T10:04:31-08:00","title":"Welcome"}]