[{"content":" “We cannot solve our problems with the same thinking we used when we created them.”\nAlbert Einstein.\n Welcome! Thank you so much visiting this web site! I am deeply grateful that you did! Your support and feedback is precious to me \u0026amp;ndash; it will help me create something of value. I won\u0026amp;rsquo;t get there without you. Seriously.\nI want a plan to save the world. A plan that might actually work. It is my deepest desire. When I tell people this they tend to recoil back \u0026amp;ndash; whoah! way too big! Is this you reaction too? Maybe take a minute and get curious about that reaction. Why don\u0026amp;rsquo;t we have a plan to save the world? Doesn\u0026amp;rsquo;t the world need saving? Yes, of course it does. Why not spend some time thinking about this? Why isn\u0026amp;rsquo;t this conversation more common?\nFor thirty years I have watched global warming. Back in the 90\u0026amp;rsquo;s environmentalists like myself knew a disaster was coming. The science was clear. And I did nothing. Each decade the scientific reports kept on coming back consistently reporting that it was even worse than we feared. And I did nothing. The scientific reports were so bad I could not make myself read them. It hurt too much. If you read them carefully, you could hear the scientists screaming in anguish. And I did nothing.\nNo longer.\nMy daughter is learning about how bad the situation is at school. Our children understand the reality of our situation better than we do. She asked me if it is OK to have children. And I had to really think about it. I found myself bargaining with God. Maybe her children will be OK? But then she asked me what about her children\u0026amp;rsquo;s children? And what about all future children? And the answer is I do not know.\nWhat I do know is that I will not do nothing for another thirty years. The world needs even someone as ordinary as me. No matter how hard it gets I can not imagine anything more painful than to confess to my grandchildren thirty years from now that yet again I stood by and did nothing. …","date":1608218775,"description":"","lastmod":"2020-12-17T15:26:15Z","objectID":"3976528693a0108357f4928017600865","permalink":"https://cosmosgame.github.io/save-the-world/","publishdate":"2020-12-17T15:26:15Z","title":"Welcome!"},{"content":" Welcome  Welcome and thanks Saving the world  We know we have a problem, well documented We are on a deadline  Cascade. Syria   Jaiya\u0026amp;rsquo;s question   There is hope  Acknowledge hopelessness theory advances psychological advances medicine advances spiritual advances     The Dream  what do I really want? we already know let the children guide us Generational trauma  protect the children stop the cycle (or at least dampen it)   Same goal  Widen circle of compassion  What is blocking this?  world view wounds and trauma spiritual poverty         Who Am I?  Purpose? Software engineer, personal growth, spiritual awakening  mind,body, and heart [TODO] environmentalist many paths all of me, all of you, all of us lead by example learnings (briefly mention, link to other page) comfortable bringing together theories simplify focus on practical, measurable results [TODO] humble is hopeful Open source leading the way     [TODO\u0026amp;ndash;move] Open Source  Surprising success Harness all of us  place where we   Feedback  comments bugs PR\u0026amp;rsquo;s   Community Promises  Simplicity  Value your time simplify   Practical, solution based  No more theory than strictly needed do the reading for you   Kaizen  Japan no ego feedback   Based in the heart, but no magic     The Plan for the Plan  Growing Up Cleaning Up Waking Up Showing Up Growing Up  Spiral dynamics New groups, new ways of organizing   Cleaning Up  Growth and healing mindset Healing our collective traumas  groups and individuals     Waking Up  reclaiming spirituality  ok if you don\u0026amp;rsquo;t yet feel comfortable with that   Not saints \u0026amp;ndash; a practice [TODO] word Integral joy!   Showing Up  Recognize the pain Step fully into the pain Awaken to something bigger   [TODO] Deadline  Global warming In denial of Can be a benefit Love for planet and future generations   Definition of success  Child focused Integral  Expand circle of compassion All of me, all of you, all of us   Joy  The deeper job  waking up early for a ski trip …","date":1605724591,"description":"","lastmod":"2020-11-18T11:36:31-07:00","objectID":"b7d38220e85982123c5ca841015e3f6b","permalink":"https://cosmosgame.github.io/save-the-world/articles/","publishdate":"2020-11-18T11:36:31-07:00","title":"Index"},{"content":"Now that we have found our bigger story, the story that gives us a sense of purpose and clarity, we next turn our attention to what needs to be done. And what jumps out is the unbelievably high number of people who are in pain. So much pain that they can not function very well. We have to start here. How do we help people out of this overwhelming pain? How do we prevent it in the first place?\n","date":1643693175,"description":"","lastmod":"2022-02-01T05:26:15Z","objectID":"156eb169f6e2c3f36cd9fe96e60907cd","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/","publishdate":"2022-02-01T05:26:15Z","title":"Cleaning Up"},{"content":"Outline  Body  It all starts in the body Every emotion has a place in the body  the body keeps the score   Every organism is striving towards healing. Always.  organicity   Diet Exercise Healing our sexuality  HAI      ","date":-62135596800,"description":"","objectID":"0322f9c7b78e8e56ab94fdda10ef473d","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/body/","title":"Body"},{"content":" Stopping the cycle  Revolutionary vanguard Thread project   Structures for healing  ","date":-62135596800,"description":"","objectID":"3898f9feb6f495f671cf14384b4240d3","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/cycle/","title":"Stop the Cycle"},{"content":"Outline  Hakomi Principles (for healing)  Hakomi intro Love  should be included preparation for Truth   Non violence  different schools of personal growth; \u0026amp;ldquo;pop-it\u0026amp;rdquo;   Truth  Coyote Accountability  Victim stories     Mindfulness Mind/Body Organicity Unity Change  Accept that change is possible Accept that change is inevitable Creativity   Body    ","date":-62135596800,"description":"","objectID":"f55b3203f58791e7c7141bcd5b538e19","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/hakomi/","title":"Hakomi Principles"},{"content":"Outline  Mindful Self Compassion  Dhali lhama anecdote First of three levels  Doesn\u0026amp;rsquo;t have to be narcissm   Three levels  mirror work What you don\u0026amp;rsquo;t love in others.. Everything is God (or the Universe   Stop the self hate storms mirror work    ","date":-62135596800,"description":"","objectID":"bc238e9d03af4dfef1da68b3f9ac5401","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/msc/","title":"Mindful Self Compassion"},{"content":" Nature  We are zoo animals The book \u0026amp;ldquo;Wild\u0026amp;rdquo; Forest therapy    ","date":-62135596800,"description":"","objectID":"83b42524bc1271e511afd8cf3dbab1ae","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/nature/","title":"Nature"},{"content":"Outline  Treatments that I personally know work  Backpacking  Wild (?)   Thread story (about support for a junior high student) Mdma HAI   Healing practices  RAIN Trust organicity Trauma work    ","date":-62135596800,"description":"","objectID":"30182ce9e53065c2b4dfe3ab2451181f","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/treatment/","title":"Treatment"},{"content":"All of me, All of you, All of us. If I\u0026amp;rsquo;m going to propose something so audacious as a plan to radically transform the world, it is going to require all of me. I can\u0026amp;rsquo;t hold anything back. I need to bring in everything that I am. Not just the shiny parts I want to show to you, but all of my rage, sorrow and pain too. Not just the gifts that I have, but the broken hurting places too. All of me is sacred and holy. All is welcome and loved. And all by myself I am nothing. If this has any chance of working I have to somehow inspire you to bring in all of yourself. All of your joy and all of your pain. All of you is sacred and holy. All of you is welcome and loved. And together as we look out at the world we need to find a way to bring everyone, yes truly everyone into it. How could it be otherwise? We need all of us.\nWe are so large and full of possibilities. And yet we tend to stay with just the parts we know. We must embrace all of ourselves. And then recognize that same vastness in others. How do we do that? Let\u0026amp;rsquo;s start with Mind, Body, and Heart. That is not all that we are but it is a good way to start. The Mind is incredibly helpful in letting us see the big picture. It lets us see the patterns that led us to this spot and helps us map out what we want to do next. We need an active mind. Then there is the body where we do this urgent thing called life. This is where we need to return for our deeper healing. This is where much of our joy comes from. We need to ground ourselves in our body. And finally we need the heart that gives life meaning. This is the path that leads to love and ultimately the most important Truth is found here. We need the heart to guide us.\nSpoiler alert \u0026amp;ndash; if I knew some way to jump everyone to the place of deep heart awakening I would have us skip straight there. Our ultimate goal is to collectively widen the circle of compassion so wide that it includes all people and even all species. Even to those that are not born …","date":-62135596800,"description":"","objectID":"636ab1ed64eb72d3570bd73a07aae71e","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/we-need-a-plan2/","title":"We need a plan"},{"content":"Let\u0026amp;rsquo;s start with Aaron Stark\u0026amp;rsquo;s story.\n  Outline  Why  Getting people out of pain first Getting people into joy Stopping the cycle  Epidemic of trauma: https://en.wikipedia.org/wiki/Adverse_childhood_experiences   It is child abuse!    ","date":-62135596800,"description":"","objectID":"5f2467b966838e8175f587697b53c68f","permalink":"https://cosmosgame.github.io/save-the-world/cleaning-up/why/","title":"Why"},{"content":"In this section I am going to tell a story. A story of where we have been and where we are right now. A story that is unfinished but with strong hints of what wants to happen next.\nI know a bit about the power of finding the right story because I named myself based on one (The Odyssey). Finding the right story transforms and strengthens. Makes things clearer. Gives courage and a direction. We all need to find our own story. The reason why we came to earth. But we also need to find our shared story. What is it that we are meant to do together?\nSpiral Dynamics can provide this shared story. Although it was originally conceived as a scientific theory I think it is better seen as an explaining story. A story that helps us make sense of things.\nIn the first sub-section I am going to introduce the theory and then tell the story. In the next sub-section I offer some thoughts on how to put it to practical use.\n","date":1637213175,"description":"","lastmod":"2021-11-18T05:26:15Z","objectID":"4b66445df18952052788b7e5b9a9ecec","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/","title":"Growing Up"},{"content":"Before I continue let me first address some questions or concerns I suspect people might have.\nSpiral Dynamics is not established science As far as I can tell Spiral Dynamics has not yet been subjected to serious, sustained scientific review. The theory is just now gaining attention, so I think getting that review is just a matter of time, but in the meantime we need to be very careful in the claims we make. That is why I am so careful to tie the major stages to well recognized historical periods. That seems like a solid foundation to build on. I have done a lot of historical research to make sure what I say is accurate and I will correct whenever someone points out an error. But more than a theory I think we need a story that explains how we got here. Spiral Dynamics does that well.\nThere are different interpretations If you listen to people talk about Spiral Dynamics you will hear important differences in interpretation. Again my approach is to focus on what history teaches us. I don\u0026amp;rsquo;t claim to be a historian, but I have an amateur\u0026amp;rsquo;s passion for the subject. That focus leads me to, for example, a different interpretation of Red and Blue than you might hear from others. It is clear to me that Red coincides with the advent of empire, and that Blue was a reaction to that ruthless empire. Others might not have even thought about whether the Roman empire was a Red or Blue stage, but I think the difference is crucial.\nIt is a better explanation of groups than individuals People are complicated and contain many layers at once. Perhaps at work someone is a dedicated scientist (Orange), but at home they find deep solace in their simple, unquestioning Catholicism (Blue). And maybe their passion is camping (Beige). How do you put that person into just one Spiral stage? I find it seems to work better to focus on group behaviors. Those seem to average out to one stage or another. So a science organization is Orange and the Catholic church is Blue.\nAnd countries …","date":1628918775,"description":"","lastmod":"2021-08-14T05:26:15Z","objectID":"59b272dc594ff5f05a1817b2a381fff2","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/practical-spiral-dynamics/","publishdate":"2021-08-14T05:26:15Z","title":"Practical Spiral Dynamics"},{"content":"Everyone has blind spots. Except me. I don\u0026amp;rsquo;t have any. This is so obviously, amusingly false, and yet there is a part of me that really believes it. After all I can\u0026amp;rsquo;t see my own blind spots so obviously I don\u0026amp;rsquo;t have any, right? In other words, I don\u0026amp;rsquo;t know what I don\u0026amp;rsquo;t know. But this is true for everyone. We all can not see our own blind spots by definition! Other people can know things, can be so more advanced than us on something that we don\u0026amp;rsquo;t recognize how much further ahead they are. So when we reach an impasse with someone, it is important to stop and hold open the possibility that maybe, just maybe this might be our blindspot not theirs. Maybe they can see something that we don\u0026amp;rsquo;t even know we don\u0026amp;rsquo;t know.\nThere are many different kinds of blindspots, but let\u0026amp;rsquo;s focus on where one stage sees something that another stage just misses.\nScience blindspot On January 28, 1986 millions of children sitting in their classrooms watched the launch of the Challenger shuttle. For the first time in history there was a school teacher onboard, Christa McAuliffe. The networks were televising a special classroom set up for her students watching the launch. 73 seconds after launch the shuttle blew up and her students watched her die on national TV. It was a horrible, painful death. It did not have to happen. NASA engineers the day before the launch literally begged for the launch to be cancelled. But the launch had already been postponed numerous times, and if it were postponed yet again it could not be included in Reagan\u0026amp;rsquo;s state of the union address. So the engineers were overruled. But they knew. One of the engineers, Bob Ebeling, told his wife the night before, \u0026amp;ldquo;It is going to blow up\u0026amp;rdquo;\nWhat happened here? Bob Ebeling was working at the Orange stage, but the NASA administration was operating at most likely Red or at best Blue. Either way the adminstrators clearly did not have a science/engineering mindset. …","date":1635830775,"description":"","lastmod":"2021-11-02T05:26:15Z","objectID":"03a8d130df7e788d4b0ccbfc2d23203c","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/practical-spiral-dynamics/blindspots/","publishdate":"2021-11-02T05:26:15Z","title":"Blindspots"},{"content":"How do we know what color level someone or a group is at? To figure this out there are some questions we need to answer:\n Are they more individual focused (tick) or group focused (tock)? What do they know to be True? What are they willing to die for?  Let\u0026amp;rsquo;s go through the color levels again, but this time asking those questions.\nBeige (FirstAwakening) At Beige focus is on the individual family (tick). You know to be true what is right in front of you. You are willing to die for your family. There are a surprisingly large number of people buying missile silos to convert them into survival shelters. That is very Beige level thinking. By the way, I don\u0026amp;rsquo;t think they are necessarily wrong. If I had a lot of excess money, I would seriously consider doing something like that too. Family is where we start.\nThe whole point of backpacking is to get to this level. That is why people do it for extended periods of time. It takes a while to get back into this easy communion with nature. After you have gone a few days on the trail, the city mentality starts to finally fade away and we can finally just let ourselves be one with the world. It is a very beautiful mental place to get to. So if you find a backpacker on a long hike they are in that moment probably at Beige. The energy field of these people feels very clean and whole.\nThis is also the stage people collapse back to if they have a lot of unresolved trauma and/or pain. All they can manage is just to survive day to day. We all go here when we have a bad flu. Unfortunately some people spend most of their lives in so much pain that spend much of their life at this stage. They can\u0026amp;rsquo;t rally to care too much about others because they are hurting so badly.\nPurple (KinSpirits) At purple focus swings over to tribe and community (tock). You know to be true what the tribe knows to be true. You revere the local spirits of the land. You are willing to die to protect your tribe. Many indigenous people live their lives at …","date":-62135596800,"description":"","objectID":"1bb39e7a7bc0e1d35b2ca5ed1b4eafb1","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/practical-spiral-dynamics/field-guide/","title":"Field Guide"},{"content":"Each stage brings a crucial gift. But we can have blindspots here too. For example, Green hates Red and can see nothing useful in the Red mindset whatsoever. And similarily Red hates Green. To be sure, Green is not wrong. We are in fact living in a world of systemic racism and sexism. But what Green (and I have to admit I too) struggle with is to realize there actually is a gift that Red brings. And that gift is crucial. This is too big a project \u0026amp;ndash; we need all the gifts.\nBeige If you read other writer\u0026amp;rsquo;s descriptions of Beige you will find them dismissing this stage as impossibly primitive and best quickly skipped over. They are making a huge mistake. For most of us this is going to be the most important stage. Healing has to start here.\nImagine you have been hiking mostly alone in the wilderness for months. You are carrying a heavy pack and it hurts. You have lost most of your toenails. And yet day in and day out you keep on going. Why? Because you have a desparate need for healing. A healing that only nature can provide. And day by day you start to find yourself. This is where it has to start. Nature helps us find our feet. Cheryl Strayed tells an inspirational story of healing herself by hiking 1100 miles of the PCT in her book Wild: From Lost to Found on the Pacific Crest Trail. This clip is the final scene from the movie adaptation. I think people find her memoir so compelling because on some stage they recognize the healing power of simply walking in nature.\nWild Ending Scene\nI am going to come back to this stage over and over. It is the base everything else is built on.\nGifts  Profound connection with nature Right diet (eating what works best for your particular body) Exercise Sexual vibrancy Touch Nurturing family Internal knowing  Purple We have forgotten what Purple knows. It is now just too weird and harsh for most of us. Whether it is the Australian aboriginal Dreaming or a Lakota Eagle Dance where dancers pierce their chests with a rawhide …","date":1637213175,"description":"","lastmod":"2021-11-18T05:26:15Z","objectID":"e5ba005af4a4c5f9545a9ecab886dd3c","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/practical-spiral-dynamics/gifts/","publishdate":"2021-11-18T05:26:15Z","title":"Gifts"},{"content":"Spiral Dynamics gives us a better story. It helps us put into context all that has happened. We can step out of helpless victim and into problem solving mode. We see all the stages and recognize both their shadows and gifts. It breaks down the problem for us into more manageable chunks. It offers us a path to follow. How do we save the world? One way is to help people move into higher and higher stages. How do we help people move into higher stages? That is what I am going to talk about next. Let\u0026amp;rsquo;s take one more spin through all the stages to consider what needs to be done.\nBeige So many people are collapsed down to the survival level. They are leading quiet lives of desperation. Just barely able to make it each day. Sometimes this is because they are brutally poor. Sometimes because they are refugees of famine or war. And in the U.S an unbelievably high number of people are trauma victims. People are so traumatized that they can barely lead their lives. This is common! We have to stop this. If it were up to me I would direct at least the amount of money that we spend on military defense towards defense of our children. We have to start here. We can not move forward with so, so many hurting people. This is the work of Healing Up. I will start on that in the next section.\nPurple Very few people are at authentic Purple. We have done much too good a job of conquering the world to let them survive. And that is too our vast loss. Purple has a lot to teach us. Why am I so confident of this? Because it already has. America is a democracy partly (maybe even largely?) because of the impact Native American (Purple) intellectuals had on our society. Feeling skeptical about that? Please read this book: The Dawn of Everything. An anthropologist and archaeologist teamed up to do the careful, painstaking scholarship needed to completely upend the existing myths about early societies. It turns out that Purple societies lived in large egalitarian cities for thousands of years. …","date":1637213175,"description":"","lastmod":"2021-11-18T05:26:15Z","objectID":"dbec519f1b1c1cbd6944203ef3e1de42","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/practical-spiral-dynamics/next/","publishdate":"2021-11-18T05:26:15Z","title":"Putting Spiral Dynamics to work"},{"content":"All of the stages come with both gifts and shadows. I will touch on the shadow side first. The part that is hurting and not working well. The part that is causing harm in the world.\nBeige The shadow version of this stage is what happens when we collapse down to survival mode. Only me and mine matter. Just like one of those Zombie apocalypse everyone else is just a monster to be dealt with. It doesn\u0026amp;rsquo;t matter what happens to those other because they are not really human. Given a chance they would suck out our brains so we have to fight back with everything we have.\nThere is an enormous selfishness that can show up at this level. An incredible indifference to the pain of others. A lot of the world spends at least part of the time here. It doesn\u0026amp;rsquo;t matter how much money you have, if you spend your life in constant fear you are living in survival mode. Unless and until we get people out of this hurt and lack we can\u0026amp;rsquo;t expect them to do anything else.\nShadows  Only out for themself Stuck in survival mode  Purple People are desperately hungry for tribe. This is a driving need. If people can\u0026amp;rsquo;t find a healthy way to express this need they will make do with an unhealthy way. Somehow, some way this need must be met. We are seeing a world wide resurgence of ethnic nationalism \u0026amp;ndash; which is an unhealthy expression of this tribal hunger. It explains some (but not all) of the attraction to Trump. His rallies were a potent drug. People felt part of a tribal whole and they were desperately missing that. How do we counter this? I will talk about deeper solutions in later sections, but possibly the simplest intervention is to get people to switch to a healthier tribe. The most successful way to get people to leave a white nationalist groups is to find a different group for them to join. The thing they really are looking for is that sense of group pride, belonging and togetherness.\nShadows  violent, ethnic nationalism (eg. white supremacy) only concerned about …","date":1637213175,"description":"","lastmod":"2021-11-18T05:26:15Z","objectID":"348d8c8f0a3f3d81da003cd59c652f83","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/practical-spiral-dynamics/shadows/","publishdate":"2021-11-18T05:26:15Z","title":"Shadows"},{"content":" Color Nickname Social construct Cause worth dying for  Beige FirstAwakening Family and Kin My family  Purple KinSpirits Tribe The sacred ground  Red PowerGods Kingdoms, Empire My king. Honor  Blue TrueBlue Church, Schools The Truth  Orange StriveDrive Capitalism, Democracy, and Science Give me liberty or give me death  Green HumanBond unions, environmentalism, feminism, racial justice, LGBTQ, et. al For my brothers and sisters  Yellow SecondAwakening Integral Theory, personal growth movement, medicine movement A life worth living  Turqoise PromisedLand Just starting to emerge Save the world   Spiral Dynamics is based on the research of the psychologist Clare Graves who was a contemporary of Abraham Maslov. Both of whom were exploring all the stages of human development from the highest and lowest. Clare Graves\u0026amp;rsquo;s health started to fail before he could fully develop his theory but his work was carried on by his younger colleagues Don Beck and Chris Cowan. They took Grave\u0026amp;rsquo;s original theory and made it more accessible by adding things like color mnemonics. Ken Wilber took the theory and added it to his Integral Theory. He later on modified it to reflect his focus on individual, spiritual growth which is a different focus. I don\u0026amp;rsquo;t cover his variations because my focus is more on the group than the indvidual. That was Don Beck\u0026amp;rsquo;s focus as well. He made many trips to South Africa to try and put Spiral Dynamics to practical use during the transition from Apartheid. Later on he tried the same thing with Israel and Palestine. He saw how this theory could transform the world. It is that focus that I am most interested in here.\nHere is what I love about Spiral Dynamics:\n  It is a practical tool. It is meant to be of use. Please judge it by its practical benefits. It suggests concrete actions to deal with the world.\n  It helps us understand why \u0026amp;ldquo;those\u0026amp;rdquo; people act as they do. Depending on what stage you are at, the world looks very different. …","date":-62135596800,"description":"","objectID":"d28d4d28f1c0b72a8c7d5fe79f85da67","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/spiral-dynamics/","title":"Spiral Dynamics"},{"content":"Beige  Color Nickname Social construct Cause worth dying for  Beige FirstAwakening Family and Kin My family   In the very beginning, our ancestors somehow had the first awakening. We stepped into a stage of consciousness higher than other animals. Imagine a caveman dad sitting on a rock with his son looking up at the full moon. The son says \u0026amp;ldquo;Dad, what is that?\u0026amp;rdquo;, And the dad says, \u0026amp;ldquo;I don\u0026amp;rsquo;t know. We call it the moon\u0026amp;rdquo; And both feel the awe and wonder of the world. This is where it all started. We have been using fire and primitive tools for maybe a million years. We don\u0026amp;rsquo;t know when we started to use language and when we first awoke to I, You, and Us. But awaken we did. We now had a higher vantage point of consciousness. Using imagination we could now travel into the future and the past.\nThis is my favorite stage. It is a reminder that we at our core are animals. Thinking animals, yes, but always and forever animals. Here we revel in the delights of our bodies and feel at one with our world. This is what I strive to return to when I go backpacking. We are meant to be part of nature not separate from it. There is a powerful spirituality in simply letting in the full beauty of the world. This is the stage with the best sex \u0026amp;ndash; primal and in the moment. This is where we go when we sit in front of a fire in the dark with friends and family and tell stories. This is the place we return to when we fully surrender to sweaty ecstatic dance.\nWe find that when doing the deep work of healing our traumas that it has to start here. In the body. The body keeps the score. Animals like deers, instinctively know that when something traumatic happens, like getting chased by a mountain lion, they have to take a moment and shake it off. The body has a deep wisdom of its own. But what a miracle to find a conscious mind inside our bodies. What a delicious thing it is to look out at the world and be a part of it yet separate.\nThis stage is the …","date":-62135596800,"description":"","objectID":"8eee7d25ef28e166468f1dae66c35f36","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/spiral-dynamics/beige/","title":"Beige"},{"content":" table tr#Blue td {background-color:#00BFFF !important;}   Color Nickname Social construct Cause worth dying for  Blue TrueBlue Church,Schools The Truth   There is a Truth that is eternal and greater than us. This is what we wake up to in the Blue stage. We surrender to something bigger than us. And that surrender brings a profound, sweet purpose and meaning to life. Before this, Truth was localized. Whoever had the most power and authority determined what Truth was. Now Truth is recognized as eternal and one.\nGod is one path to this Truth, but not the only way. Buddha woke up under a Bodhi tree just as himself, not a god. He taught a practical path to enlightenment that anyone willing to do the work can follow. Plato based his work on the very Blue notion that the world is just a shadowy reflection of the ideal. The Greeks had no shortage of eloquent smart thinkers, but when those thinkers only focused on selfish, individual ends they just ended up with sophistry. Nothing useful could be built on that. Plato and Aristotle gave the world a glimpse of what is possible when you base your ideas on the foundation of Truth. Science needs this stage first before it can flourish.\nAnd then there was Christ. Imagine his time. Rome was confidently in charge of its brutal slave empire. And the people suffered. Christianity has a lot to answer for, but consider what happened at the very, very beginning of this religion. Some how, some way this man inspired a revolution that spread throughout the Western world. Women and slaves were recognized as beloved of God. Might makes right was no longer the highest truth. The cross which was a torture device used to keep people in line now became a defiant symbol of redemption. What an incredibly sneaky way to revolt against the empire! No armies were needed. Instead people were ready and willing to die for a belief. And the world was changed.\nMohammed is a similar story. Just like Christ he went into the wilderness to find himself and …","date":-62135596800,"description":"","objectID":"7e546f40af22a08c0f2cb7b55d19e6f2","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/spiral-dynamics/blue/","title":"Blue"},{"content":" table tr#Green td {background-color:#228B22;}   Color Nickname Social construct Cause worth dying for  Green HumanBond unions, environmentalism, feminism, racial justice, LGBTQ, et. al For my brothers and sisters   The genius of Martin Luther King\u0026amp;rsquo;s I have a dream speech is that it builds on the (Orange) words of the Declaration of Independence and brings us forward into a new stage, Green.\n \u0026amp;ldquo;I have a dream that one day this nation will rise up and live out the true meaning of its creed - we hold these truths to be self-evident: that all men are created equal.\nI have a dream that one day on the red hills of Georgia the sons of former slaves and the sons of former slave-owners will be able to sit down together at a table of brotherhood.\n  \u0026amp;hellip;\n  And when this happens, when we allow freedom to ring, when we let it ring from every village and every hamlet, from every state and every city, we will be able to speed up that day when all of God\u0026amp;rsquo;s children, black men and white men, Jews and Gentiles, Protestants and Catholics, will be able to join hands and sing in the words of the old Negro spiritual: \u0026amp;ldquo;Free at last! Free at last! thank God Almighty, we are free at last!\u0026amp;rdquo;\n Notice how he bring us back together to our shared humanity. Our deeper freedom arises from coming together not splitting apart. This realization was the start of so many important awakenings. The environmental awakening. We commit to cherish, honor, and protect our mother earth. The feminist awakening. Time to stop oppressing women and break free of our sexist stereotypes and limits. The peace awakening. No more mindless wars. The race awakening. We recognize how deeply racist our society is and we commit to healing this broken mindset. Later on \u0026amp;ndash; this one took much longer \u0026amp;ndash; we started to embrace the LGBTQ community and the full continuum of our sexuality.\nAt this stage we start to realize that the rational mind is not the only source of Truth. Just because …","date":-62135596800,"description":"","objectID":"84a2cac9f14a910494402338d7b5eb0b","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/spiral-dynamics/green/","title":"Green"},{"content":" Color Nickname Social construct Cause worth dying for  Orange StriveDrive Capitalism, Democracy, and Science Give me liberty or give me death   The Japanese were confronting the technological results of The Age of Enlightenment. This was a turn away from the church and God towards looking for the Truth within. From this stage emerged modern science, capitalism, and democracy. America\u0026amp;rsquo;s Declaration of Independence is a quintessential expression of Orange:\n \u0026amp;ldquo;We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness\u0026amp;rdquo;\n Self-evident means that when you introspect on it, it becomes clear that it is true. Math proofs are meant to be self-evident. This was the age of Reason. Notice how this puts the source of Truth back in the individual. The purpose of life is now not focused on God but instead the pursuit of happiness. And we need our liberty (freedom) to go and do that. Both free market capitalism and democracy trust the wisdom of the crowd to get us to the best answers. This was a very radical idea at the time, and yet it has worked out surprisingly well. Markets do seem to be a much better mechanism than command economies and democracy is a much better governing system than all the alternatives.\nSo when those American Black ships steamed into Tokyo, Japan was faced with a stark choice. Stay Blue and inevitably become some western (Orange) country\u0026amp;rsquo;s helpless colony, or make the switch to Orange. Japan chose to make the switch. This was a remarkable period of time called the Meiji era. Japan is the only non-western country that I am aware of that avoided colonization. It was maybe a century behind technologically, but because of all those years of peace and prosperity it had a strong cohesive base to build on. Remember up till now almost no Japanese had ever left the country (or if they had, they …","date":-62135596800,"description":"","objectID":"7c5d3734043f62eb65b15e353f28454f","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/spiral-dynamics/orange/","title":"Orange"},{"content":" Color Nickname Social construct Cause worth dying for  Purple KinSpirits Tribe The sacred ground   Something amazing happened about 30,000 to 40,000 years ago. We see it in the cave paintings of the time. When we stop and really look at this powerful art we can not help but be moved. These people were just like us. This was clearly the next step up in consciousness. From smallish bands we formed bigger tribes and we became bad-asses. Human population numbers started to grow and we spread out across all of the planet. And where ever we spread, populations of bigger animals like Mastodons crashed. Presumably because we hunted them to death.\nSpirit became the center of our lives. Spirit of place, animal, and ancestors. Deep magic lives in the sacred places. Animal spirits and our ancestors are here to guide us, if only we can get quiet enough and reverent enough to hear them. We fast and pray for days. Then head off alone into the wilderness to do our sacred initiation rite and face our internal demons. Then we return to the wild celebration of the tribe. You are back! We are so glad you are back! We are one. Tell us of your visions so that we may all learn from the spirits. You are home. You are loved. So deeply loved.\nPurple throws the best parties. It was a big part of the draw of the hippies in the 60\u0026amp;rsquo;s. From all accounts Woodstock was very Purple. We tend to idolize this stage, but movies like Dances With Wolves do catch an important historical point. Colonists \u0026amp;ldquo;kidnapped\u0026amp;rdquo; by Native Americans never wanted to return when given the opportunity. The Native Americans living mostly at Purple were living a much richer, more satisfying life.\nThis is the stage when art and religion really took off. We started to awaken to a higher purpose than just the day to day cycle of survival. We turned to each other and found we share an even bigger mystery than individual consciousness \u0026amp;ndash; shared consciousness. We are tribal animals. The cruelest punishment …","date":-62135596800,"description":"","objectID":"f404b71c2a9d42b3ededce0db4bc0344","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/spiral-dynamics/purple/","title":"Purple"},{"content":" Color Nickname Social construct Cause worth dying for  Red PowerGods Kingdoms, Empire My king. Honor   This is the stage of empire. The strong ruled over the weak. We are taught to venerate Rome, but by today\u0026amp;rsquo;s standards it was a hopelessly evil slave empire. It was very Red. Rulers the world over declared themself as God. The Pharoahs built their pyramids and other rulers demanded that their followers commit suicide when they died. And people willingly followed them into death. This is the stage of the Alexander The Great and Genghis Khan. Alexander is remembered as a \u0026amp;ldquo;great\u0026amp;rdquo; man, but by today\u0026amp;rsquo;s standards he would be considered a murdering lunatic. He probably killed his father to gain power. He killed a lot of other people just for the glory of it. Genghis Khan by all accounts was a self-actualized guy who achieved his biggest dreams. Too bad about all those millions his troops killed. But here is the most important point. Genghis and Alexander (and their legions of followers) did not consider themselves evil. They considered themselves the good guys. And you have to kind of marvel at their martial excellence.\nThere is a real darkness here. Brutal wars of conquest swept across the world. The worship of the Goddess was suppressed and women became property. Slavery took root and flourished. Wealth and power went to the very top. People were forced into a brutal form of agriculture that put them into early graves. Much of the suffering of the world still comes from this stage of thinking. This is not how we want to live, but there is no turning back. Much as we might like to go back to Purple we have no choice. We have way too many people on this planet now to sustain a traditional Purple lifestyle. It is like when Cortes landed on the shores of Mexico determined to conquer the Aztec empire. He scouted the coasts for a bit then determined he had to head inland. So he did something very Red, he scuttled his ships. Can you imagine what it must …","date":-62135596800,"description":"","objectID":"698daa540c84f45e142d0608a8f8dc10","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/spiral-dynamics/red/","title":"Red"},{"content":" Color Nickname Social construct Cause worth dying for  Turqoise PromisedLand Just starting to emerge Save the world   After finding our vast strength in Yellow we start to really open up to all that is. And it hurts. Really hurts. The world is suffering in so many needless ways. We have met this pain before and run away, but this time we suddenly realize how truly big we are. We are more than just our narrow individual ego. We are part of something so so much bigger. Big enough even to face that scary tidal wave of world pain. We are all one. When you suffer, I suffer too. We now start to really get that. And it is so not OK what is happening. The deeper joy is the joy of all not just the one. From our place of strength we look up and out. And a wild, crazy hope emerges. On our own there is relatively little we can do. But together? Together we can change the world.\nTurquoise as a societal construct is not yet here. There is no history I can point to. So we don\u0026amp;rsquo;t really know yet exactly what Turquoise is going to look like. But we do have the pattern of what has happened up to now to give us some important clues. We know that this stage will be the (tock) return to community. And just like Yellow revisits Beige at a higher stage, Turquoise revisits Purple. We will know Turquoise has arrived by its awesome, legendary parties. Burning Man might be an early yearning towards this. Just like Purple was the start of religion, Turquoise almost certainly will see the rebirth of an enlightened form of religion. It will be a practice of spirit that deeply nourishes and strengthens. And we will become bad-asses once more.\nTurquoise is like a prophecy in a story. It is a dream of what we hope and pray will come. And it can be our intention. Our guide of what needs to happen in order for the world to flourish. But even though Turqoise is not yet fully here I do see some signs of it starting to emerge. Valerie Kaur\u0026amp;rsquo;s Revolutionary Love Project is one example.\nPlease …","date":-62135596800,"description":"","objectID":"eb4d38110ef904919048849c78321580","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/spiral-dynamics/turquoise/","title":"Turquoise"},{"content":" Color Nickname Social construct Cause worth dying for  Yellow SecondAwakening Integral Theory, personal growth movement, medicine movement A life worth living   At some point we need to turn back to ourselves to find the Truth of things. We have absorbed the lessons of Green, and yet we are not at peace with ourselves. Green by itself won\u0026amp;rsquo;t get us to the healing we need. Green by itself won\u0026amp;rsquo;t heal the world. People insist on going their own selfish ways no matter how patiently we explain to them how stupid and evil they are. Then we try a little louder and slower, like you might to someone who does not speak English well. You. are. stupid. And. Evil! Huh. How can they not understand that?!? Why don\u0026amp;rsquo;t they understand how stupid and evil they are?!? Maybe we are missing something? Perhaps there is a deeper stage to go here? Maybe just maybe there is something more workable than dividing the world up into good and evil? But to convince you of that I need for you to go very deeply into yourself. Kind of like an odyssey of the soul. It can be a bit scary and painful, but there is also wonder and joy. It feels like Odysseus tied to his ship finally surrendering, cutting his ropes, and jumping off to join the Sirens. Giving up this life so that he can know what worlds come after.\nAnd after we come up for air we are awakening all over again. We are right back to Beige stage staring in awe at the moon. It is exactly the same and yet different because this time we have the lived experience of so many previous generations. At Green we might dabble with Native American traditions, but it is at this Yellow stage where we truly get how much we can learn from these ancient cultures. And we find an incredible longing to go back to that way of life. But we can\u0026amp;rsquo;t go back. We scuttled our ships on the beach and the only way now is forward. Or die. The first step is to find our own strength and truth. It has to start here. Stop, breathe, spend time in nature …","date":-62135596800,"description":"","objectID":"b6096f1c81d751b24b8da2522c45f959","permalink":"https://cosmosgame.github.io/save-the-world/growing-up/spiral-dynamics/yellow/","title":"Yellow"},{"content":" Better Theory. We now have a theory called Integral theory that brings in all of us not just our western, rational minds. It welcomes the scientist as well as the Buddhist, and it suggests a hopeful path of what wants to happen next. Better Therapy. We are now seeing proven, effective treatments for even people suffering with severe trauma. We\u0026amp;rsquo;ve never had that before. Hurt people hurt people. If we can stop the cycle of suffering passed from one generation to the next that alone would dramatically change the world for the better. Practical spirituality. One of the therapy treatments for trauma is the use of Psychedelics. This Medicine work also opens up access to spiritual states that previously only the most driven and dedicated could get to. And now they are in the reach of everyone. Peoples hearts fling wide open when they get to these states.  ","date":-62135596800,"description":"","objectID":"e7e5900488a2cc9776f9d659cd996ce6","permalink":"https://cosmosgame.github.io/save-the-world/posts/better-theory/","title":""},{"content":"Let me start with a simple question. Why do we think the Civil War actually solved anything? Did that war really change hearts and minds? I don\u0026amp;rsquo;t think so. Not really. Imagine the end of the U.S. Civil War. The North has just crushed the South using brutal, total war: Sherman\u0026amp;rsquo;s March to the Sea. The South surrenders with the bitter realization that the North will stop at absolutely no unspeakable atrocity in order to totally crush them. And that truly may have been the only way to end the war. Imagine though that you are a slave owner that now has to free their slaves. Do you really awaken to your evil wickedness and acknowledge that the North was right all along? Of course you don\u0026amp;rsquo;t. I don\u0026amp;rsquo;t expect you to have sympathy at this point for the slave owner, but what about their children? Maybe you can find sympathy for them? They are growing up in a culture that teaches them a certain mindset. Why do we think that mindset would magically change? It didn\u0026amp;rsquo;t of course. Within twenty years after the war, Southern whites had regrouped and replaced the old system of slavery with a new form of economic slavery called share cropping. Yes, still better than actual slavery, but Blacks could not vote and still lived in oppression. This is the Authoritarian mindset. Why do we think that somehow this changes? How does that even work? So of course there is ongoing, systemic racism in the U.S.\nThose people proudly waving confederate flags carry almost the exact mindset of their ancestors. They are not stupid, they know exactly what they are celebrating, but they also don\u0026amp;rsquo;t consider themselves evil. We do of course, but they definitely don\u0026amp;rsquo;t. Interesting. OK, let\u0026amp;rsquo;s take one more step back. How did slavery even become a thing? It turns out that throughout history slavery was pretty common. Greece and Rome were slave empires. In a very real way the Authoritarian mindset of the Roman empire is still very much alive. Just look at all those …","date":-62135596800,"description":"","objectID":"38491ccace848b62e2bc16ae0d47a824","permalink":"https://cosmosgame.github.io/save-the-world/posts/civil-war/","title":""},{"content":"In some ways we are already too late. We already have launched irreversible climate change. That doesn\u0026amp;rsquo;t mean we are necessarily doomed, especially if we can rally to halt emissions in time. But it does mean that we are going to have to learn to cooperate in a way we have not before. Places that used to produce food will likely become barren with drought. But places that used to be too cold to grow food will suddenly become productive farmlands. This is already happening. The world is going to be a dif want to go much further than just that\n","date":-62135596800,"description":"","objectID":"01f10feccb8bdffda7d47f9b525978b5","permalink":"https://cosmosgame.github.io/save-the-world/posts/climate-change/","title":""},{"content":"It is a pretty wild ambition to save the world. To even have a chance it will require many, many different voices speaking from a place of deep Truth. We all have our own paths to Truth, let me first start with mine.\nSave the World When I let my heart open wider and wider into the vastness of all that is, I find pain. So. much. pain! Can you feel it also? At least a little? The sensitives among us certainly do. Here take this pill so you can function, as if shock and horror were not the most appropriate reaction to the world. As if everything is fine, just keep on going don\u0026amp;rsquo;t pay attention to that homeless person huddled miserably in the corner. And our history! Generation after generation passing its trauma on to the next. So many people growing up in hurt and lack. It hurts so much! The pain can feel like an immense, implacable ocean wave sweeping me away from the security of shore. Better, safer to hide away.\nAnd we are on a deadline. Global warming looks to be worse than scientists feared. If we don\u0026amp;rsquo;t take drastic action billions may die. Yet most people don\u0026amp;rsquo;t seem to really get how urgent the problem is. Don\u0026amp;rsquo;t seem to realize it for the existential threat that it is. My daughter asks me if it will be OK for her to have children in the future, and I have to stop and really think about it. What kind of world will her children live in? What evidence do I have that things are going to get better?\nIt is easy to give in to hopelessness. What can any one person really do in the face of the relentless forces shaping the world? People are going to suffer, and yes it is probably going to get much worse. We can do our best, but it probably won\u0026amp;rsquo;t be enough. It is hopeless.\nAnd yet.\nStop and breath, and know.\nThere is hope. Always.\nEven in the depths of horrific trauma there can be moments when all that pain cracks something open and lets Grace shine through. When despite it all we recognize the beauty and glory of simply being alive in this …","date":-62135596800,"description":"","objectID":"b42d398776c30867c3c39ba9511deb03","permalink":"https://cosmosgame.github.io/save-the-world/posts/despair-to-hope/","title":""},{"content":"Orange to Green Crying Indian Commercial\n","date":-62135596800,"description":"","objectID":"23ba32c909e7ba49f57ccebd3668650f","permalink":"https://cosmosgame.github.io/save-the-world/posts/examples/","title":""},{"content":"Body-Centered Psychotherapy\n   Old paradigm New paradigm     fundamental separateness unbroken wholeness\nfundamental connectedness   absolute certitude\nonly matter is real (materialism) uncertainty, relativity\nconsciosness is real (dualistm, monism)   the mind/body split mind/body integration   biology is destingy we create our own destiny    ","date":-62135596800,"description":"","objectID":"aba5f3838288b8371ef5a9c7ab62c6fc","permalink":"https://cosmosgame.github.io/save-the-world/posts/hakomi/","title":""},{"content":"Backpack without a backpack on the Pacific Crest Trail (PCT). Join us for our first \u0026amp;ldquo;comfy\u0026amp;rdquo; backpacking trip. Experience the magical connection with nature that backpackers get without the need to actually carry a backpack and provisions.\nHow is this possible??\nEach day you get to hike from one campground to the next. Our truck and trailer will transport the gear. At the next camp site your tent and hot meals await you. The hikes each day will last about 6 hours if you are hiking at a moderate pace including time for lunch. On flat stretches they will average 10 miles. On days with elevation gain they are no longer than 6 miles (but you can go longer if you want). On most days there are options for shorter hikes, and you can always ride in the truck if your body is ready for a day off.\nWe have planned a seven day journey into nature starting at the southern tip of the PCT (at the Mexican border). We have found it takes a few days to disconnect from the everyday world and to let yourself really immerse in nature. To accomplish this, we ask that you plan to stay with the group for the whole week. We also ask that you minimize use of cell phones to help keep you in the backpacker\u0026amp;rsquo;s mindset.\nEach afternoon Odysseus will also lead a walk to experience “forest bathing”. This custom originated in Japan and encourages us to use all our senses on a slow walk with stops to appreciate our surroundings.\nYour cost is only the actual cost for camping, supplies and gas. Cost: ~$200 (depending on number of people, max 10) plus your cost to get to and from San Diego. We will provide airport pickup as needed.\nBackpacking without carrying a backpack? Why not!\nDates (tentative) Saturday, April 16th 2022 - Saturday April 23rd 2022\nContact us! Interested but have questions? Ready to sign up? Send one of us an email:\n odysseus.levy@gmail.com rhonda@cayford.org  Itinerary    Day Start End Camp Distance (Options)     Day 0, Saturday Mile 0 Mile 2.4 Lake Moren Campground …","date":1641050775,"description":"","lastmod":"2022-01-01T15:26:15Z","objectID":"094113679270a57d7de82acc7e203c72","permalink":"https://cosmosgame.github.io/save-the-world/posts/pct-trip/","publishdate":"2022-01-01T15:26:15Z","title":"Hike the Pacific Crest Trail"},{"content":"I\u0026amp;rsquo;m curious to know if there is interest in this. It is kind of an amusing thing to think about. How could engineers have anything to contribute to the conversation of waking up to a bigger consciousness? And yet I think we do.\nPost a message if you might be interested in me writing this up. Right now I am focused on the main path and this is definitely not that.\nHere is the outline of what I would want to cover:\n Software engineer path  Radical truth  Running in debug mode Embrace when you are wrong Measuring   Learning to be wrong  It is a practice Needs to be supported OK to aspire to excellence anyways   Check your assumptions  debugging leads to this examine sources of truth   Dealing with complexity  simplify layers scrum  negotiating complexity not everyone has to be a software expert     Deep dive  Five whys Failure without blame Factoring in that humans are failable   Flow  Cure for sensitivity -hiding out in the crystalline, beautiful forests of reason Teaches possibility of joy  joy based life     Request For Comments (RFC)  Courageous asks that can change the world   Models Open source  Shared libraries Forking Not all opinions are equal      Five Whys ","date":1599434191,"description":"","lastmod":"2020-09-06T16:16:31-07:00","objectID":"ee67c5fa00ce0b4e1f6035527720bb59","permalink":"https://cosmosgame.github.io/save-the-world/posts/programmers-path/","publishdate":"2020-09-06T16:16:31-07:00","title":"Programmers Path"},{"content":"Actualized.org\nLong winded intro on Spiral Dynamics.\n Great motivation talk at the beginning Transformational dilemma is great idea, but the actual ones offered are terrible Weak on history Completely misses the impact of agriculture https://www.youtube.com/watch?v=23aDNBvn_2g  The Great Work, our way into the future https://thomasberry.org/quote/the-great-work-our-way-into-the-future/\n recommended by Forest Bathing organization  ","date":1626045391,"description":"","lastmod":"2021-07-11T16:16:31-07:00","objectID":"5e1b35d57b14a805ac5f9cc2b81cc5d4","permalink":"https://cosmosgame.github.io/save-the-world/posts/resources/","publishdate":"2021-07-11T16:16:31-07:00","title":"Resources"},{"content":"I love movies where the reluctant heroes are desperately trying to save the world against what seem impossible odds. First they overcome their fears and limitations, and then they commit. Then they work through their bitter squabbles and commit to each other. I want to be like them. I\u0026amp;rsquo;m hoping you do too, because the world is in desperate need of heroes right now.\nPolice kill black men seemingly at will. Large parts of the population seem to be indifferent to the needless deaths and suffering of a million people. And it gets worse. Global warming is here and we are burning. Species are dying in numbers we can barely comprehend. In our children\u0026amp;rsquo;s lifetimes it is possible large parts of the planet might become uninhabitable. If we don\u0026amp;rsquo;t make drastic changes, it is possible that billions of people will die. Seriously.\nStill with me? I don\u0026amp;rsquo;t blame you if your first instinct is to stop reading. If you let yourself really consider how bad things could get it is just too overwhelming. Billions of people dying? Surely that is hysterical hyperbole? It is just too much. Sadly it is a real possibility.\nThere is Hope But please know this. There is hope. Really and truly. It is not going to be easy of course. It never is in dire situations like this. And unlike the movies there is no guarantee that everything will work out in the end. But I wouldn\u0026amp;rsquo;t be writing this if I did not truly believe there is hope.\nAgain it is not going to be easy. No heroic journey ever is. Are you willing to at least start? The very first step is to embrace the pain. Really let yourself feel how awful this is. Yuck! Why would you want to do that? Because with pain comes a precious gift \u0026amp;ndash; the energy to do whatever it takes to get out of that pain. The bigger the pain the bigger the gift that comes with it. Think about times in your life when something hurt so bad that you just had to make a drastic change. That pain gave you the energy to make a change you might not …","date":1599434191,"description":"","lastmod":"2020-09-06T16:16:31-07:00","objectID":"6d2f71d94c1faa6e60c4af21ce1d33ef","permalink":"https://cosmosgame.github.io/save-the-world/posts/save-the-world/","publishdate":"2020-09-06T16:16:31-07:00","title":"Save the World"},{"content":"My goal is to first save the world, because it needs saving. If we don\u0026amp;rsquo;t stop carbon dioxide emissions soon, billions will die. But we have to go way beyond just that because in some ways it already is too late. Climate change is now irreversible. There is no going back. We are going to have to learn to share a very different, challenging world. Simply to survive we now have no choice but to learn to care for all. Some will live in areas that benefit from climate change and many will not. We will have to learn to share everything. But this urgent necessity is also an opportunity. We can chose to create a world of our dreams. It really is possible. In fact it is our best hope of survival. I hope to convince you to join me. I need allies. This world needs allies.\nThis site is meant for people who are excited by the bigger dream of what we are all collectively waking up to. Waking up to finding their bigger purpose of service. Service coming not from a place of self-sacrifice but instead from listening to the call for the deeper joy that is struggling to be born but needs some midwives. Please join me. I can\u0026amp;rsquo;t do this alone.\nSo many people are already working on saving the world. But often they are only bringing just a part of themselves to the work. Many people are doing great science (Mind) based work and wondering why people are not moved by what they have discovered. They are not meeting people where they are. Many people are doing the intense healing (Body) work that is so needed, but are not aware of how they fit into the bigger picture. We need people to step into a larger world view. Many people are doing the profound (Heart) work of loving themselves and the world. But they are learning to endure the unendurable. We need them to come back from their lofty heights and join the work.\nFor example, the Prosperity Gospel is a very Red mindset.\nWe wil regain the three primoridal freedoms:\n Freedom to move Freedom to disobey Freedom to create or transform …","date":-62135596800,"description":"","objectID":"0081eeab87f442e647e37a30ddb3d321","permalink":"https://cosmosgame.github.io/save-the-world/posts/snippets/","title":""},{"content":"Stone Soup \u0026amp;ndash; stone soup text goes here \u0026amp;mdash; edited\n","date":1606327471,"description":"","lastmod":"2020-11-25T10:04:31-08:00","objectID":"2fd043563f0da3a242fd1a778591cba4","permalink":"https://cosmosgame.github.io/save-the-world/posts/stone-soup/","publishdate":"2020-11-25T10:04:31-08:00","title":"Stone Soup1"},{"content":"During the Trump presidency it felt like political commentators were crashing around their bedroom at night trying to get to the bathroom. Not really recognizing what they were bumping into. For example many focused too much on Trump without realizing he just represented the yearning of a huge number of Americans. Many others viewed him as a uniquely American problem, and failed to see that there has been an absolute plague of Authoritarian governments in the world recently. Others only focused on recent events without realizing that this is an age old problem. It turns out that it is rare for a democracy to not succumb to Authoritarianism collapse at some point. And even more failed to recognize that this authoritarian mindset has been with us from the very beginnings of recorded history.\nWe need to stop and take the time to turn on the light and see where we are. What exactly are we bumping into? We see this Authoritarian mindset, are there other mindsets that are also driving the world? We need a map. If we truly want to succeed in winning hearts and minds we need to meet people where they actually are not where we think they should be. In my experience telling people that they are stupid and evil just has not been an effective way to get them to change. Have you had a different experience? This is where theory and models can help. We need a better understanding of why people do what they do. We need to bring our thinking minds in and go much deeper than we have.\nLater on I\u0026amp;rsquo;m going to introduce a theory called Spiral Dynamics which has a very powerful explanation for much that we see in the world. It lets us understand people without resorting to just calling them stupid and evil. But right here I want to focus on the need for some theory period. Here are a few examples of questions any theory we adopt would have to help us answer:\n","date":-62135596800,"description":"","objectID":"ddf346486995e816f1970d42e8533860","permalink":"https://cosmosgame.github.io/save-the-world/posts/trump/","title":""},{"content":"Everything is God (the Universe) and God (the Universe) is love\u0026amp;quot;\nDoes this ring true to you? It is the core belief of the various New Thought religions such as the Centers for Spiritual Living (CSL) . The truth of these words live in my full body not just my head. Back when I was still an atheist I spent many Sundays in CSL church standing and crying as I awoke to this deeper truth. The words started me on the journey but the music they played at church is what got me there. Everything is God. Including me. Including you. Including everything.\nEverything means everything\nI\u0026amp;rsquo;m always a little surprised when I tell people this belief and they just nod and don\u0026amp;rsquo;t push back. There is an awful lot packed into just this one sentence and following it fully can be quite challenging. Let me give you some examples\nLove your ego\nA little while ago there were a series of posts on this forum where people argued earnestly about how important it is to get rid of your ego. I found that alarming. Our ego is an important part of us and it serves us. It is there for a reason. They key is to notice how attached we can get to it and the suffering that can happen when we do. As an aside I confess it was deeply amusing to see people attack the ego in what (at least to me) seemed to be such an ego-full way.\nLove all the faces of God.\nWhether you spend two years in a forest monastery or spend two years learning Quantum dynamics in both cases you are devoting yourself to loving one of the faces of God. There are many paths. The way I found my way to spirit was to reassure my rational mind I would never forsake it. It too had an honored path to Truth. It is hard sometimes because I live in two worlds. I live with the Rationalists who don\u0026amp;rsquo;t fully get Spirit. And I live with the Spirit people who quite often don\u0026amp;rsquo;t get Reason and science and don\u0026amp;rsquo;t seem to respect them. There are so many paths to Truth! So many faces of God that I/we don\u0026amp;rsquo;t know yet.\nLove our …","date":-62135596800,"description":"","objectID":"65d97d7773743b5d6a5fe721843a574a","permalink":"https://cosmosgame.github.io/save-the-world/posts/we-are-one/","title":""},{"content":"But first we need a plan. Our current approach is not working. There are many things not working, but let me focus on climate change because it is a huge problem. Emissions keep on going up. World wide agreements are made, but never for enough and emissions keep on going up. Environmentalists pin their hope on elections but then the other party gets elected and dismantles previous work. And emissions keep on going up.\nWhy don\u0026amp;rsquo;t they get the importance of climate change? How can they not understand how important this is? Or if they do understand why is it not more of a priority? What can be more important than saving the world? If a meteor was on a collision course with the earth surely that would capture people\u0026amp;rsquo;s attention, so why not this?\nI have an explanation, but first let\u0026amp;rsquo;s start with an experiment. Take a moment to get settled and become aware of what is going on for you. Maybe take a breath, relax and pause for a moment here. Then when you are ready read the next sentence, and pay really close attention to what happens for you.\nThe very worst part of the climate change disaster is probably eighty or more years away.\nNow be honest with yourself. Doesn\u0026amp;rsquo;t that ease your concern at least a little? Eighty years is an awfully long time away, and most of us won\u0026amp;rsquo;t be alive then. But then you might argue that even right now we are suffering the effects of climate change. True the danger of billions of people dying is a long way off, but there is plenty of suffering to worry about in our immediate future. Yes, but now notice again how it feels when I reframe the above statement and say that billions might die in our children\u0026amp;rsquo;s life time. Notice how that feels different. It feels different because I have brought the issue closer into your sphere of compassion.\nWe all have spheres of compassion. The things in our inner sphere are the things we care most about and will protect. Typically your family is in this inner sphere. Then there …","date":1599434191,"description":"","lastmod":"2020-09-06T16:16:31-07:00","objectID":"516d4f7369653d2fe1cbecbefc66d823","permalink":"https://cosmosgame.github.io/save-the-world/posts/we-need-a-plan/","publishdate":"2020-09-06T16:16:31-07:00","title":"Spheres of compassion"},{"content":"All of me, All of you, All of us. If I\u0026amp;rsquo;m going to propose something so audacious as a plan to radically transform the world, it is going to require all of me. I can\u0026amp;rsquo;t hold anything back. I need to bring in everything that I am. Not just the shiny parts I want to show to you, but all of my rage, sorrow and pain too. Not just the gifts that I have, but the broken hurting places too. All of me is sacred and holy. All is welcome and loved. And all by myself I am nothing. If this has any chance of working I have to somehow inspire you to bring in all of yourself. All of your joy and all of your pain. All of you is sacred and holy. All of you is welcome and loved. And together as we look out at the world we need to find a way to bring everyone, yes truly everyone into it. How could it be otherwise? We need all of us.\nWe are so large and full of possibilities. And yet we tend to stay with just the parts we know. We must embrace all of ourselves. And then recognize that same vastness in others. How do we do that? Let\u0026amp;rsquo;s start with Mind, Body, and Heart. That is not all that we are but it is a good way to start. The Mind is incredibly helpful in letting us see the big picture. It lets us see the patterns that led us to this spot and helps us map out what we want to do next. We need an active mind. Then there is the body where we do this urgent thing called life. This is where we need to return for our deeper healing. This is where much of our joy comes from. We need to ground ourselves in our body. And finally we need the heart that gives life meaning. This is the path that leads to love and ultimately the most important Truth is found here. We need the heart to guide us.\nSpoiler alert \u0026amp;ndash; if I knew some way to jump everyone to the place of deep heart awakening I would have us skip straight there. Our ultimate goal is to collectively widen the circle of compassion so wide that it includes all people and even all species. Even to those that are not born …","date":-62135596800,"description":"","objectID":"14b5c2ec8cab5f39df8ab1668415a8b2","permalink":"https://cosmosgame.github.io/save-the-world/posts/we-need-a-plan2/","title":"We need a plan"},{"content":" Showing Up  Why it is now possible  better model reclaiming spirituality healing and growth   Boddhisatva vow Goals  Healing  Focus on what works Generational trauma \u0026amp;ndash; stop hurting children   Working with all the colors  add the missing blue helping people to find Turqoise     Church of personal growth  Establish practices (like karate does)   Bring up our own leaders  Build in feedback  Address fear of doing harm   Leader as servant mentality   What is working  HAI  CSL   MSC NVC Hakomi  RAIN   Cohousing  Very green! better ways to raise our children consensus as a personal growth mechanism   Medicine   Need to scale quickly Governance  Need for new governance. Sociocracy? Accountable Evangelical      ","date":-62135596800,"description":"","objectID":"2e3528445fbc83fc4d895b04b75617f7","permalink":"https://cosmosgame.github.io/save-the-world/showing-up/","title":"Showing Up"},{"content":"Let\u0026amp;rsquo;s start. May I have your permission to dream with me? Dream way, way, way bigger than you maybe normally do? OK? Here is my question: What do you really want. I mean really. Yes, yes you can have a billion dollars \u0026amp;ndash; boom \u0026amp;ndash; now keep on going deeper. This is a dream after all so you can have anything. What do you want beyond just the superficial stuff? Maybe deep happiness for yourself? Yes, please hold on to that part of the dream, but try going even a little further. Maybe dream of happiness for others? Certainly you can dream of happiness for your loved ones, but how about living in a world of joy for all? Wait, you can imagine a billion dollars but not that? Stay with me here. Let\u0026amp;rsquo;s try again. Stop and breathe. Settle down into your body. Notice where you are and everything you are feeling in this moment right now. And then ask yourself the question again, but this time from your heart. What is the biggest dream you can dream? How big can you open your heart? Notice if resistance comes up. That is very normal. Try to really get in touch with what that resistance is about. Know that it is very valuable to get in touch with this \u0026amp;ndash; it is going to guide us on the work that needs to happen. Just about all of us are working on expanding our hearts. I don\u0026amp;rsquo;t think we ever are done with this work. And we all can use teachers.\nMy first great teacher was my son. It happened in an unexpected way. After graduating from college I flew to Japan to teach English. My third week in Tokyo the Japanese woman I was seeing became pregnant with my child. She was fifteen years older than me, and we had been having a fling. No love between us at all really. She told me to go, she could handle this. But I had a waking vision \u0026amp;ndash; I never have waking visions \u0026amp;ndash; of a 18 year old stranger knocking on my door saying, \u0026amp;ldquo;Dad?\u0026amp;rdquo;. I had no idea of \u0026amp;ldquo;what\u0026amp;rdquo; needed to happen, but I was so very, very clear \u0026amp;ldquo;not that\u0026amp;rdquo;. And …","date":-62135596800,"description":"","objectID":"82a3c96cf09a4b36c283afafa5de8c55","permalink":"https://cosmosgame.github.io/save-the-world/the-dream/","title":"The Dream"},{"content":"If you walk into a bookstore you will find books on saving yourself, but not on saving the world. You will find books addressing specific problems, but not on how all these problems relate together as a whole. There are a few books like that of course. I have made a point of finding them. But they are not well known and definitely not best sellers. Why is that? Why don\u0026amp;rsquo;t we have even one well known plan to save the world? Partly because it is just too overwhelming. We are all stuck in the trance of helplessness. Our shared story is still way too small. But another part is that most of us don\u0026amp;rsquo;t have much experience working with complex systems. Some people do though \u0026amp;ndash; programmers. We have to. No one every formally taught me how to manage complex systems, but out of necessity I learned it over time. I learned that any problem at its heart is a human one and you have to figure out how to compensate for our weaknesses. It turns out that is true of all our problems, not just computer ones. Later on I discovered there is a name for this kind of thinking. It is called Systems Thinking. It recognizes that when you are dealing with the \u0026amp;ldquo;wicked problems\u0026amp;rdquo; of the world you first have to understand the whole system. The temptation is to just pick a part of the problem and get to work because the need is so urgent, but that ultimately has limits. It can help, but it will not get us all the way where we want. We need to go deeper. We need to teach people this style of thinking. It is the only thing that works. So how do does this method work? Let me give some examples.\nFind the root cause I truly hate getting woken up at 3am to solve a service outage. I especially don\u0026amp;rsquo;t like having to report to senior management why I personally cost the company many hundreds of thousands of dollars in lost revenue. And yet of course this has happened to me. So I am highly motivated after each incident to learn from it what we can do to reduce the chance of it …","date":-62135596800,"description":"","objectID":"410bef4c18a282cdfa9ab8c258817f0c","permalink":"https://cosmosgame.github.io/save-the-world/the-dream/going-deeper/","title":"Systems Thinking"},{"content":"Let me suggest a set of guiding principles for this project. Something that we can fall back on when we are trying to decide what goes in and what stays out. Something that guides us as we write and review. If you find that some part of this site does not match these principles please let me know - it is a bug that needs to be fixed.\nSimplicity I deeply value your time. I promise not to waste it. There is a lot to cover here, but I will only bring in the most important points. There are lots of fun tangents that can be visited as side topics, but the goal is to focus on finding the simplest thing that can work. Every idea will be expressed as simply and clearly as possible. If you don\u0026amp;rsquo;t understand a concept it is my fault not yours. Let me know. If you think I\u0026amp;rsquo;m wasting time on something, then you might have found an important bug (or at the very least I am not explaining well enough why it is essential).\nPractical The goal is to create something practical. Something that can actually change the world. Getting the theory right is incredibly important, but on the main path we don\u0026amp;rsquo;t want to bring in any more theory than is strictly necessary. People like myself can go off and do the readings, but then we need to come back here ready to share the useful nuggets that can be put to work.\nWe will know this project is working when we see it inspire actual healing and growth in the world.\nKaizen Kaizen means constant on-going improvement. It is always possible to grow and learn. You should be a bit skeptical of initial versions of this site, but over time as more people contribute and comment the site will grow and mature. Kaizen is a very open source concept. It is also very Japanese. You are never done with the work \u0026amp;ndash; there is always more to be done. And there is a deep joy in that.\nSelf evident Nothing written here is meant to be taken on faith. Please find the truth of everything within yourself. The request, though, is that you search for this …","date":-62135596800,"description":"","objectID":"e4b01eb809e6b3097214fd714a10fbfd","permalink":"https://cosmosgame.github.io/save-the-world/the-dream/guidelines/","title":"Principles"},{"content":"More people should be aware of the open source movement. It is kind of a big deal. I\u0026amp;rsquo;ve been watching it with fascination from the beginning. In the 1990\u0026amp;rsquo;s it was not at all clear that it would end up completely conquering the world, but it did. Much of the software that you are using at this very moment is open source. It is built into the very foundations of the internet. Open Source out competed fierce capitalistic companies because it is a better way of collaborating. It is the only instance that I know of where communism won. No one owns open source software; people freely donate their time to it as a gift to the world. Ideas work best when they are free. And frameworks work best when many people have taken a serious look at them and offered improvements. But despite this idealism open source exists to be of use. Not all contributions are accepted. It is not like the wikipedia where there are endless, wasteful edit wars over controversial topics. Open source tends to avoid all that and stays focused on delivering value. And if it doesn\u0026amp;rsquo;t, some other open source project comes along to replace it.\nOpen source does not have to be just for software. I propose that this plan to save the world should be an open source project. So how does that work? This website is hosted on Github, which is where many open source projects live. Every aspect of this site is open to inspection and review. Github supports this kind of collaboration through an intuitive interface. The Github UI is meant to be accessible even to people who are not strongly technical.\nThere are three main ways to interact with this site\nComments Please, please leave a comment below. Even just to say Hi. You have to create an account to do this, but that is to prevent bots from spamming the comments. My apologies for making you do that, but it is necessary. Unprotected websites get horribly spammed. And I hope you do register because I so want to hear your thoughts. This is the easiest …","date":-62135596800,"description":"","objectID":"7ee9af246a839b7da61bb68e6bf63389","permalink":"https://cosmosgame.github.io/save-the-world/the-dream/open-source/","title":"Open Source"},{"content":"So how are we going to do this? What does the plan look like?\nThe Goal First we need to be clear on where we are going. What do we truly want for this world? What would light us up all the way? I suggested earlier that we don\u0026amp;rsquo;t have to over think this. Let our love for our children guide us. Let our inner child guide us. We already know what we dream for the world, we just have to dare to believe it is possible. On some beautiful day the world is going to wake up in love and joy. But we can\u0026amp;rsquo;t just jump straight there from where we are now. This is where the work is.\nIntegral Theory The first step is getting our stories straight. The stories we have been telling ourself up to now have not been serving us. They have been keeping us helpless and isolated. We need to find a bigger story that brings us together. A story that gives us solid ground to stand on. Fortunately, I think much of this work has already been done. Ken Wilber is a brilliant philosopher who had the insight that it is more than past time to integrate all the different worlds of human experience into one integrated theory. Western philosopy, Eastern philosophy, Empiricism, Spirituality, Buddhism, and everything else all brought together as one. This theory is called Integral Theory. I find that it is a great foundation to build upon. It explains a lot of things well.\nThis is his beautifully succint summary of the work we all need to do:\n Growing Up Cleaning Up Waking Up Showing Up  And I would add one more to the list\n Wising Up  Growing Up Before we can change the world we have to really understand and model the vastly different ways people look at the world. We are missing a map to help us chart our way. We need to go deeper than just assuming that eveyone thinks about things pretty much like we do. They don\u0026amp;rsquo;t. Not even close in fact. And yet some how, some way we need to convince people to open their hearts wider and wider. How do we do that? First we need to meet them right where …","date":-62135596800,"description":"","objectID":"e2fe3311b96f8e275871b3078a5754bc","permalink":"https://cosmosgame.github.io/save-the-world/the-dream/overview/","title":"Overview"},{"content":"Who am I to save the world? I am just this nobody on the internet. I don\u0026amp;rsquo;t have any particular expertise or credentials. There is no particular reason you should listen to me other than maybe I can get you to think. But in some ways this ordinariness is actually an advantage. It is so obvious I can\u0026amp;rsquo;t do this alone. We are going to have to do this together\nTo give this any chance of working I can\u0026amp;rsquo;t hold anything back. I need to bring in everything that I am. Not just the shiny parts I want to show to you, but all of my rage, sorrow and pain too. Not just the gifts that I have, but the broken hurting places too. All of me is sacred and holy. All is welcome and loved. And all by myself I am nothing. I have to somehow inspire you to bring in all of yourself. All of your joy and all of your pain. All of you is sacred and holy. All of you is welcome and loved. And together as we look out at the world we need to find a way to bring everyone, yes truly everyone into it. How could it be otherwise? We need all of us.\nWe all have our unique stories. The stories that have shaped us. The stories that are our gift to the world. Let\u0026amp;rsquo;s start with mine.\nMy Story When I was younger I was in a lot of pain. The way I found myself out of that pain was to do intensive personal growth workshops. Those workshops (along with meditation) were one of the very few things that worked. I tried therapy with a few Freudian psychiatrists but their approach seemed (and still does frankly) like mostly nonsense. So personal growth workshops it was. And I did a lot of them. The month of my 50th birthday I did a particularly powerful workshop and I stepped into a lot of joy. I finally committed to fully loving myself and others. It was a big step deeper into an ongoing spiritual awakening, and brought me into a new phase of my life. Suddenly it was easy to go on a very strict, life-long diet because that was the most loving thing to do for myself. And then a few years later I did …","date":-62135596800,"description":"","objectID":"324530fd5670d698059fd97e970ae89f","permalink":"https://cosmosgame.github.io/save-the-world/the-dream/who-am-i/","title":"Who Am I?"},{"content":"(Not Started)\n Waking Up  Soulwork vs. Spirit work What has worked in the past?  Gandhi Martin Luther King Christian awakening Moslem awakening Sikh awakening   Mindful Self Compassion  Final level Unity consciousness Everything is God (or the Universe)   Spirituality at all color levels How do we know what is true?  Spirituality does not have to be in conflict with science Magical thinking Need again for a model   Quadrants  UR UL LR LL Quadrant myopia  UL UR LR LL   Embrace all quadrants  Tale of two churches  CSL Unitarian       Integral Spirituality  Embrace all colors Embrace all quadrants      ","date":-62135596800,"description":"","objectID":"f7a5a8a9f721702b11dd3651bf1d7b7c","permalink":"https://cosmosgame.github.io/save-the-world/waking-up/","title":"Waking Up"},{"content":" Wising Up  Personal growth mindset Mindful Self Compassion  second level of three What you don\u0026amp;rsquo;t love in others..  mirror work with others   Loving others as self (mirror work) Preparation for Truth   Hakomi Principles  Hakomi intro RAINN  recognize acceptance investigate nurture needed experience   Love  should be included preparation for Truth   Non violence  different schools of personal growth; \u0026amp;ldquo;pop-it\u0026amp;rdquo;   Truth  Coyote Accountability  Victim stories     Mindfulness Mind/Body Organicity Unity Change  Accept that change is possible Accept that change is inevitable Creativity     Accountability  Victim mindset Empowered victim   Intraverts vs. Extraverts  Not an either or Healing individual Healing with groups Our society needs much more empahsis on the group  cohousing        ","date":-62135596800,"description":"","objectID":"311221c0456741a1dbd76ea51d8fd260","permalink":"https://cosmosgame.github.io/save-the-world/wising-up/","title":"Wising Up"}]